// size: 0x264
struct KiteSquirrelAPI {
    // void* vtable; // 0x0
    int __dword_4; // 0x4
    void* sq_open; // 0x8
    void* sq_newthread; // 0xC
    void* sq_seterrorhandler; // 0x10
    void* sq_close; // 0x14
    void* sq_setforeignptr; // 0x18
    void* sq_getforeignptr; // 0x1C
    int __dword_20; // 0x20
    int __dword_24; // 0x24
    int __dword_28; // 0x28
    int __dword_2C; // 0x2C
    int __dword_30; // 0x30
    int __dword_34; // 0x34
    void* sq_setprintfunc; // 0x38
    void* sq_getprintfunc; // 0x3C
    void* sq_geterrorfunc; // 0x40
    void* __func_44; // 0x44
    void* sq_wakeupvm; // 0x48
    void* sq_getvmstate; // 0x4C
    void* sq_getversion; // 0x50
    void* sq_compile; // 0x54
    void* sq_compilebuffer; // 0x58
    void* sq_enabledebuginfo; // 0x5C
    void* sq_notifyallexceptions; // 0x60
    void* sq_setcompilererrorhandler; // 0x64
    void* sq_push; // 0x68
    void* sq_pop; // 0x6C
    void* __func_70; // 0x70
    void* sq_remove; // 0x74
    void* sq_gettop; // 0x78
    void* sq_settop; // 0x7C
    void* sq_reservestack; // 0x80
    void* sq_cmp; // 0x84
    void* sq_move; // 0x88
    void* sq_newuserdata; // 0x8C
    void* sq_newtable; // 0x90
    void* sq_newtableex; // 0x94
    void* sq_newarray; // 0x98
    void* sq_newclosure; // 0x9C
    void* sq_setparamscheck; // 0xA0
    void* sq_bindenv; // 0xA4
    int __dword_A8; // 0xA8
    int __dword_AC; // 0xAC
    void* sq_pushstring; // 0xB0
    void* sq_pushfloat; // 0xB4
    void* sq_pushinteger; // 0xB8
    void* sq_pushbool; // 0xBC
    void* sq_pushuserpointer; // 0xC0
    void* sq_pushnull; // 0xC4
    int __dword_C8; // 0xC8
    void* sq_gettype; // 0xCC
    void* __func_D0; // 0xD0
    void* sq_getsize; // 0xD4
    void* sq_gethash; // 0xD8
    void* sq_getbase; // 0xDC
    void* sq_instanceof; // 0xE0
    void* __func_E4; // 0xE4
    void* sq_tobool; // 0xE8
    void* sq_getstring; // 0xEC
    void* sq_getinteger; // 0xF0
    void* sq_getfloat; // 0xF4
    void* sq_getbool; // 0xF8
    void* sq_getthread; // 0xFC
    void* sq_getuserpointer; // 0x100
    void* sq_getuserdata; // 0x104
    void* sq_settypetag; // 0x108
    void* sq_gettypetag; // 0x10C
    void* sq_setreleasehook; // 0x110
    int __dword_114; // 0x114
    void* sq_getscratchpad; // 0x118
    void* __func_11C; // 0x11C
    void* __func_120; // 0x120
    void* __func_124; // 0x124
    void* sq_setnativeclosurename; // 0x128
    void* sq_setinstanceup; // 0x12C
    void* sq_getinstanceup; // 0x130
    void* __func_134; // 0x134
    void* sq_newclass; // 0x138
    void* __func_13C; // 0x13C
    void* __func_140; // 0x140
    void* __func_144; // 0x144
    void* __func_148; // 0x148
    void* __func_14C; // 0x14C
    void* __func_150; // 0x150
    void* __func_154; // 0x154
    void* __func_158; // 0x158
    void* __func_15C; // 0x15C
    void* sq_pushroottable; // 0x160
    void* sq_pushregistrytable; // 0x164
    void* sq_pushconsttable; // 0x168
    void* sq_setroottable; // 0x16C
    void* sq_setconsttable; // 0x170
    void* sq_newslot; // 0x174
    void* __func_178; // 0x178
    void* sq_set; // 0x17C
    void* sq_get; // 0x180
    void* sq_rawget; // 0x184
    void* __func_188; // 0x188
    void* __func_18C; // 0x18C
    void* __func_190; // 0x190
    void* __func_194; // 0x194
    void* __func_198; // 0x198
    void* __func_19C; // 0x19C
    void* sq_arrayresize; // 0x1A0
    void* __func_1A4; // 0x1A4
    void* __func_1A8; // 0x1A8
    void* sq_arrayinsert; // 0x1AC
    void* sq_setdelegate; // 0x1B0
    void* sq_getdelegate; // 0x1B4
    void* sq_clone; // 0x1B8
    void* __func_1BC; // 0x1BC
    void* __func_1C0; // 0x1C0
    void* sq_getweakrefval; // 0x1C4
    void* __func_1C8; // 0x1C8
    void* sq_call; // 0x1CC
    void* sq_resume; // 0x1D0
    void* sq_getlocal; // 0x1D4
    void* sq_getcallee; // 0x1D8
    void* sq_getfreevariable; // 0x1DC
    void* sq_throwerror; // 0x1E0
    void* __func_1E4; // 0x1E4
    void* sq_reseterror; // 0x1E8
    void* sq_getlasterror; // 0x1EC
    void* __func_1F0; // 0x1F0
    void* sq_pushobject; // 0x1F4
    void* sq_addref; // 0x1F8
    void* sq_release; // 0x1FC
    void* sq_getrefcount; // 0x200
    void* sq_resetobject; // 0x204
    void* sq_objtostring; // 0x208
    void* sq_objtobool; // 0x20C
    void* sq_objtointeger; // 0x210
    void* sq_objtofloat; // 0x214
    void* sq_objtouserpointer; // 0x218
    void* __func_21C; // 0x21C
    int __dword_220; // 0x220
    void* sq_collectgarbage; // 0x224
    void* __func_228; // 0x228
    void* sq_writeclosure; // 0x22C
    void* __func_230; // 0x230
    void* sq_vm_malloc; // 0x234
    void* sq_vm_realloc; // 0x238
    void* sq_vm_free; // 0x23C
    void* sq_stackinfos; // 0x240
    void* __func_244; // 0x244
    void* sq_setnativedebughook; // 0x248
    int __dword_24C; // 0x24C
    int __dword_250; // 0x250
    int __dword_254; // 0x254
    void* sqstd_register_iolib; // 0x258
    int __dword_25C; // 0x25C
    void* sqstd_seterrorhandlers; // 0x260
    void* sqstd_printcallstack; // 0x264
    // 0x268
};