#pragma once

#ifndef Z86_CORE_INTERNAL_PRE_H
#define Z86_CORE_INTERNAL_PRE_H 1

#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include <limits>
#include <algorithm>
#include <utility>
#include <type_traits>
//#include <new>
//#include <memory>

// TODO: Investigate these:
// https://gist.github.com/TomHarte/f9c89349f676ebbe5bc92e52af77b0a1
// https://fd.lod.bz/rbil/opcode/other.html

// Random 80186 jank: https://news.ycombinator.com/item?id=34334799

#include "../zero/util.h"

#define USE_BITFIELDS 1
#define USE_VECTORS 1

#undef REX

static inline constexpr unsigned long long operator ""_KB(unsigned long long value) {
    return value * 1024ull;
}

static inline constexpr unsigned long long operator ""_KB(long double value) {
    return value * 1024.0L;
}

static inline constexpr unsigned long long operator ""_MB(unsigned long long value) {
    return value * 1048576ull;
}

static inline constexpr unsigned long long operator ""_MB(long double value) {
    return value * 1048576.0L;
}

static inline constexpr unsigned long long operator ""_GB(unsigned long long value) {
    return value * 1073741824ull;
}

static inline constexpr unsigned long long operator ""_GB(long double value) {
    return value * 1073741824.0L;
}

template <typename T, typename ... Args>
static inline constexpr void reconstruct_at(T* p, Args&&... args) {
    std::destroy_at(p);
    new (p) T(std::forward<Args>(args)...);
}

// Avoid the values 8, 16, 32, and 64 so that template values
// can be differentiated from bit values.
// THESE VALUES WILL LIKELY CHANGE
enum z86CoreType : size_t {
    z8086 = 0,
    z80186 = 1,
    z80286 = 2,
    zNV30 = 3,
    z80386 = 4,
    z80486
};

// V20 series:
// TEST1, CLR1, SET1, NOT1, ADD4S, SUB4S, CMP4S, ROL4, ROR4, EXT, INS, REPC, REPNC, FPO2
// BRKEM

// Feature Flags
enum z86FeatureTier {
    FEATURES_8086, // PUSH CS, No #UD, unmasked shifts
    FEATURES_80186, // #UD, PUSHA, POPA, BOUND, (PUSH Is), (PUSH Ib), (IMUL Rv, Mv, Is), (IMUL Rb, Mb, Ib), INS, OUTS, ENTER, LEAVE
    FEATURES_80286, // Protected mode, ARPL, 2 byte opcodes
};

static inline constexpr uint64_t QUIRK_FLAGS_A_START = __COUNTER__ + 1;

// I got tired of rewriting the flag shifts
#define QUIRK_FLAG(...) __VA_ARGS__ = 1ull << (__COUNTER__ - QUIRK_FLAGS_A_START)

// QUIRK DEFS
enum z86FeatureFlagsA : uint64_t {
    QUIRK_FLAG(FLAG_PUSH_CS),               // 8086
    QUIRK_FLAG(FLAG_SAL_IS_SETMO),          // 8086
    QUIRK_FLAG(FLAG_REP_INVERT_MUL),        // 8086
    QUIRK_FLAG(FLAG_REP_INVERT_IDIV),       // 8086, 80186
    QUIRK_FLAG(FLAG_FAULTS_ARE_TRAPS),      // 8086
    QUIRK_FLAG(FLAG_NO_UD),                 // 8086
    QUIRK_FLAG(FLAG_SINGLE_MEM_WRAPS),      // 8086, 80186
    QUIRK_FLAG(FLAG_UNMASK_SHIFTS),         // 8086, 80186, v20
    QUIRK_FLAG(FLAG_OLD_PUSH_SP),           // 8086, 80186, v20
    QUIRK_FLAG(FLAG_OLD_RESET_PC),          // 8086, 80186, v20
    QUIRK_FLAG(FLAG_OLD_AAA),               // 8086, 80186 (v20 unknown)
    QUIRK_FLAG(FLAG_WRAP_SEGMENT_MODRM),    // 8086, 80186
    QUIRK_FLAG(FLAG_AAM_NO_DE),             // 80186
    QUIRK_FLAG(FLAG_UNMASK_ENTER),          // 80186, v20
    QUIRK_FLAG(FLAG_REP_BOUND),             // 80186
    QUIRK_FLAG(FLAG_REP_MUL_MISSTORE),      // 80186
    QUIRK_FLAG(FLAG_PROTECTED_MODE),        // 80286+
    QUIRK_FLAG(FLAG_PAGING),                // 80386+
    QUIRK_FLAG(FLAG_LONG_MODE),
    QUIRK_FLAG(FLAG_HAS_TEST_REGS),         // 80386, 80486
    QUIRK_FLAG(FLAG_OPCODES_80186),
    QUIRK_FLAG(FLAG_OPCODES_80286),
    QUIRK_FLAG(FLAG_OPCODES_V20),
    QUIRK_FLAG(FLAG_OPCODES_80386),
    QUIRK_FLAG(FLAG_OPCODES_80486),
    QUIRK_FLAG(FLAG_OPCODES_P5),
    QUIRK_FLAG(FLAG_OPCODES_P6),
    QUIRK_FLAG(FLAG_HAS_CPUID),
    QUIRK_FLAG(FLAG_HAS_LONG_NOP),
    QUIRK_FLAG(FLAG_CPUID_X87),
    QUIRK_FLAG(FLAG_CPUID_CMOV),
    QUIRK_FLAG(FLAG_CPUID_MMX),
    QUIRK_FLAG(FLAG_CPUID_3DNOW),
    QUIRK_FLAG(FLAG_CPUID_SSE),
    QUIRK_FLAG(FLAG_CPUID_SSE2),
    QUIRK_FLAG(FLAG_CPUID_SSE3),
    QUIRK_FLAG(FLAG_CPUID_SSSE3),
    QUIRK_FLAG(FLAG_CPUID_SSE41),
    QUIRK_FLAG(FLAG_CPUID_SSE42),
    QUIRK_FLAG(FLAG_CPUID_SSE4A),
    QUIRK_FLAG(FLAG_CPUID_AVX),
    QUIRK_FLAG(FLAG_CPUID_AVX2),
    QUIRK_FLAG(FLAG_CPUID_XOP),
    QUIRK_FLAG(FLAG_CPUID_FMA3),
    QUIRK_FLAG(FLAG_CPUID_POPCNT),
    QUIRK_FLAG(FLAG_CPUID_BMI1),
    QUIRK_FLAG(FLAG_CPUID_BMI2),
};

// Code shared between x86 cores

template <size_t bytes>
struct z86Memory {
    unsigned char raw[bytes];

    template <typename T = uint8_t>
    inline T* ptr(size_t offset) {
        return (T*)&this->raw[offset];
    }

    template <typename T = uint8_t>
    inline const T* ptr(size_t offset) const {
        return (const T*)&this->raw[offset];
    }

    template <typename T = uint8_t>
    inline T& ref(size_t offset) {
        return *this->ptr<T>(offset);
    }

    template <typename T = uint8_t>
    inline const T& ref(size_t offset) const {
        return *this->ptr<T>(offset);
    }

    template <typename T = uint8_t>
    inline T read(size_t offset) const {
        return this->ref<T>(offset);
    }

    template <typename T = uint8_t>
    inline void regcall write(size_t offset, const T& value) {
        if constexpr (!std::is_array_v<std::remove_reference_t<T>>) {
            this->ref<T>(offset) = value;
        } else {
            memcpy(this->ptr(offset), &value, sizeof(T));
        }
    }

    inline uint8_t& operator[](size_t offset) {
        return this->read(offset);
    }

    inline const uint8_t& operator[](size_t offset) const {
        return this->read(offset);
    }

    inline size_t read(void* dst, size_t src, size_t length) const {
        if (src < bytes) {
            length = (std::min)(bytes - src, length);
            memcpy(dst, &this->raw[src], length);
            return length;
        }
        return 0;
    }

    inline void* read_movsb(void* dst, size_t src, size_t length) const {
        return rep_movsb(dst, &this->raw[src], length);
    }

    inline size_t write(size_t dst, const void* src, size_t length) {
        if (dst < bytes) {
            length = (std::min)(bytes - dst, length);
            memcpy(&this->raw[dst], src, length);
            return length;
        }
        return 0;
    }

    inline const void* write_movsb(size_t dst, const void* src, size_t length) {
        return rep_movsbS(&this->raw[dst], src, length);
    }
};

template <size_t bits>
struct GPR;

template <>
struct GPR<16> {
    union {
        uint16_t qword;
        uint16_t dword;
        uint16_t word;
        struct {
            uint8_t byte;
            uint8_t hbyte;
        };
    };
};

template <>
struct GPR<32> {
    union {
        uint32_t qword;
        uint32_t dword;
        uint16_t word;
        struct {
            uint8_t byte;
            uint8_t hbyte;
        };
    };
};

template <>
struct GPR<64> {
    union {
        uint64_t qword;
        uint32_t dword;
        uint16_t word;
        struct {
            uint8_t byte;
            uint8_t hbyte;
        };
    };
};

struct MMXREG {
    union {
        vec<float, 2> f32;
        double f64;
        vec<uint8_t, 8> byte;
        vec<int8_t, 8> sbyte;
        vec<uint16_t, 4> word;
        vec<int16_t, 4> sword;
        vec<uint32_t, 2> dword;
        vec<int32_t, 2> sdword;
        vec<uint64_t, 1> qword;
        vec<int64_t, 1> sqword;
    };

    template <typename T>
    static inline constexpr size_t vec_size() {
        return 8 / sizeof(T);
    }
};

template <typename T>
using MMXT = std::conditional_t<std::is_same_v<T, void>, MMXREG,
             std::conditional_t<MMXREG::vec_size<T>() != 0,
                                vec<T, MMXREG::vec_size<T>()>,
                                void>>;

struct FPUREG {
    union {
        long double st;
        MMXREG mmx;
    };
};

struct SSEREG {
    union {
        vec<float, 4> f32;
        vec<double, 2> f64;
        vec<uint8_t, 16> byte;
        vec<int8_t, 16> sbyte;
        vec<uint16_t, 8> word;
        vec<int16_t, 8> sword;
        vec<uint32_t, 4> dword;
        vec<int32_t, 4> sdword;
        vec<uint64_t, 2> qword;
        vec<int64_t, 2> sqword;
        uint128_t oword;
        int128_t soword;
    };

    template <typename T>
    static inline constexpr size_t vec_size() {
        return 16 / sizeof(T);
    }
};

template <typename T>
using SSET = std::conditional_t<std::is_same_v<T, void>, SSEREG,
             std::conditional_t<SSEREG::vec_size<T>() != 0,
                 std::conditional_t<SSEREG::vec_size<T>() != 1,
                                        vec<T, SSEREG::vec_size<T>()>,
                                        T>,
                                    void>>;

struct AVXREG {
    union {
        vec<float, 8> f32;
        vec<double, 4> f64;
        vec<uint8_t, 32> byte;
        vec<int8_t, 32> sbyte;
        vec<uint16_t, 16> word;
        vec<int16_t, 16> sword;
        vec<uint32_t, 8> dword;
        vec<int32_t, 8> sdword;
        vec<uint64_t, 4> qword;
        vec<int64_t, 4> sqword;
        vec<uint128_t, 2> oword;
        vec<int128_t, 2> soword;
    };

    template <typename T>
    static inline constexpr size_t vec_size() {
        return 32 / sizeof(T);
    }
};

template <typename T>
using AVXT = std::conditional_t<std::is_same_v<T, void>, AVXREG,
             std::conditional_t<AVXREG::vec_size<T>() != 0,
                 std::conditional_t<AVXREG::vec_size<T>() != 1,
                                        vec<T, AVXREG::vec_size<T>()>,
                                        T>,
                                    void>>;

struct AVX512REG {
    union {
        vec<float, 16> f32;
        vec<double, 8> f64;
        vec<uint8_t, 64> byte;
        vec<int8_t, 64> sbyte;
        vec<uint16_t, 32> word;
        vec<int16_t, 32> sword;
        vec<uint32_t, 16> dword;
        vec<int32_t, 16> sdword;
        vec<uint64_t, 8> qword;
        vec<int64_t, 8> sqword;
        vec<uint128_t, 4> oword;
        vec<int128_t, 4> soword;
    };

    template <typename T>
    static inline constexpr size_t vec_size() {
        return 64 / sizeof(T);
    }
};

template <typename T>
using AVX512T = std::conditional_t<std::is_same_v<T, void>, AVX512REG,
                std::conditional_t<AVX512REG::vec_size<T>() != 0,
                    std::conditional_t<AVX512REG::vec_size<T>() != 1,
                                           vec<T, AVX512REG::vec_size<T>()>,
                                           T>,
                                       void>>;

template <size_t bits>
struct SEG_DESCRIPTOR {
    union {
        uint16_t limit_low;
        uint16_t gate_ip;
    };
    union {
        uint16_t base_low;
        uint16_t gate_cs;
    };
    union {
        uint8_t base_middle;
        uint8_t gate_params : 5;
    };
    union {
        uint8_t flags1;
        struct { // Generic flags
            uint8_t type : 5;
            uint8_t dpl : 2;
            uint8_t present : 1;
        };
        struct {
            uint8_t accessed : 1;
            uint8_t readable : 1;
            uint8_t conforming : 1;
        } code;
        struct {
            uint8_t accessed : 1;
            uint8_t writable : 1;
            uint8_t expand_down : 1;
        } data;
        struct {
            uint8_t type : 4;
        } system;
    };

    inline constexpr bool is_system() const {
        return this->type < 0b10000;
    }

    inline constexpr bool is_code() const {
        return this->type >= 0b11000;
    }

    inline constexpr bool is_data() const {
        return this->type - 0b10000u < 0b1000u;
    }

    inline constexpr bool is_gate() const {
        return (this->type & 0b10111) - 4 < 3;
    }
};

template <>
struct SEG_DESCRIPTOR<16> : SEG_DESCRIPTOR<0> {
    uint16_t must_be_zero;

    inline uint32_t base() const {
        return *(uint32_t*)&this->base_low & 0xFFFFFF;
    }

    inline constexpr uint16_t limit() const {
        return this->limit_low;
    }

    inline constexpr uint16_t ip() const {
        return this->gate_ip;
    }
};

template <>
struct SEG_DESCRIPTOR<32> : SEG_DESCRIPTOR<0> {
    union {
        struct {
            union {
                uint8_t flags2;
                struct {
                    uint8_t limit_high : 4;
                    uint8_t system_use : 1;
                    uint8_t long_mode : 1;
                    uint8_t big : 1;
                    uint8_t granularity : 1;
                };
            };
            uint8_t base_high;
        };
        uint16_t gate_ip_high;
    };

    inline uint32_t base() const {
#if USE_VECTORS
        const vec<uint8_t, 8> seg = *(vec<uint8_t, 8>*)this;
        const vec<uint8_t, 8> zero = {};
        vec<uint8_t, 8> ret = shufflevec(seg, zero, 2, 3, 4, 7, 8, 8, 8, 8);
        return std::bit_cast<vec<uint32_t, 2>>(ret)[0];
#else
        return (*(uint32_t*)&this->base_low & 0xFFFFFF) | (uint32_t)this->base_high << 24;
#endif
    }

    inline constexpr uint32_t limit() const {
        uint32_t limit = (uint32_t)this->limit_low | (uint32_t)this->limit_high << 16;
        if (this->granularity) {
            limit <<= 12;
        }
        return limit;
    }

    inline constexpr uint32_t ip() const {
        return (uint32_t)this->gate_ip | (uint32_t)this->gate_ip_high << 16;
    }
};

template <>
struct SEG_DESCRIPTOR<64> : SEG_DESCRIPTOR<32> {
    union {
        uint32_t base_upper;
        uint32_t gate_ip_upper;
    };
    uint32_t must_be_zero;

    inline uint64_t base() const {
#if USE_VECTORS
        if constexpr (sizeof(void*) == sizeof(uint64_t)) {
            const vec<uint8_t, 16> seg = *(vec<uint8_t, 16>*)this;
            const vec<uint8_t, 16> zero = {};
            vec<uint8_t, 16> ret = shufflevec(seg, zero, 2, 3, 4, 7, 8, 9, 10, 11, 16, 16, 16, 16, 16, 16, 16, 16);
            return std::bit_cast<vec<uint64_t, 2>>(ret)[0];
        }
        else {
            const vec<uint8_t, 8> seg = *(vec<uint8_t, 8>*)this;
            const vec<uint8_t, 8> zero = {};
            vec<uint8_t, 8> ret = shufflevec(seg, zero, 2, 3, 4, 7, 8, 8, 8, 8);
            return (uint64_t)std::bit_cast<vec<uint32_t, 2>>(ret)[0] | (uint64_t)this->base_upper << 32;
        }
#else
        uint64_t ret = *(uint32_t*)&seg->base_low & 0xFFFFFF | (uint32_t)seg->base_high << 24;
        return ret | (uint64_t)seg->base_upper << 32;
#endif
    }

    inline constexpr uint64_t ip() const {
        uint64_t ret = (uint32_t)this->gate_ip | (uint32_t)this->gate_ip_high << 16;
        return ret | (uint64_t)this->gate_ip_upper << 32;
    }
};

#define DS DS_SEG

enum REG_INDEX : uint8_t {
    ZMM0  =  0, YMM0  =  0, XMM0  =  0, RAX  =  0, EAX  =  0, AX   =  0, AL   =  0, ES  =  0, CR0 = 0, K0 = 0, ST0 = 0, MM0 = 0, DR0 = 0,
    ZMM1  =  1, YMM1  =  1, XMM1  =  1, RCX  =  1, ECX  =  1, CX   =  1, CL   =  1, CS  =  1, CR1 = 1, K1 = 1, ST1 = 1, MM1 = 1, DR1 = 1,
    ZMM2  =  2, YMM2  =  2, XMM2  =  2, RDX  =  2, EDX  =  2, DX   =  2, DL   =  2, SS  =  2, CR2 = 2, K2 = 2, ST2 = 2, MM2 = 2, DR2 = 2,
    ZMM3  =  3, YMM3  =  3, XMM3  =  3, RBX  =  3, EBX  =  3, BX   =  3, BL   =  3, DS  =  3, CR3 = 3, K3 = 3, ST3 = 3, MM3 = 3, DR3 = 3,
    ZMM4  =  4, YMM4  =  4, XMM4  =  4, RSP  =  4, ESP  =  4, SP   =  4, AH   =  4, FS  =  4, CR4 = 4, K4 = 4, ST4 = 4, MM4 = 4, DR4 = 4,
    ZMM5  =  5, YMM5  =  5, XMM5  =  5, RBP  =  5, EBP  =  5, BP   =  5, CH   =  5, GS  =  5, CR5 = 5, K5 = 5, ST5 = 5, MM5 = 5, DR5 = 5,
    ZMM6  =  6, YMM6  =  6, XMM6  =  6, RSI  =  6, ESI  =  6, SI   =  6, DH   =  6, DS3 =  6, CR6 = 6, K6 = 6, ST6 = 6, MM6 = 6, DR6 = 6,
    ZMM7  =  7, YMM7  =  7, XMM7  =  7, RDI  =  7, EDI  =  7, DI   =  7, BH   =  7, DS2 =  7, CR7 = 7, K7 = 7, ST7 = 7, MM7 = 7, DR7 = 7,
    ZMM8  =  8, YMM8  =  8, XMM8  =  8, R8   =  8, R8D  =  8, R8W  =  8, R8B  =  8, LDT =  8, CR8 = 8,
    ZMM9  =  9, YMM9  =  9, XMM9  =  9, R9   =  9, R9D  =  9, R9W  =  9, R9B  =  9, TSS =  9,
    ZMM10 = 10, YMM10 = 10, XMM10 = 10, R10  = 10, R10D = 10, R10W = 10, R10B = 10, GDT = 10,
    ZMM11 = 11, YMM11 = 11, XMM11 = 11, R11  = 11, R11D = 11, R11W = 11, R11B = 11, IDT = 11,
    ZMM12 = 12, YMM12 = 12, XMM12 = 12, R12  = 12, R12D = 12, R12W = 12, R12B = 12,
    ZMM13 = 13, YMM13 = 13, XMM13 = 13, R13  = 13, R13D = 13, R13W = 13, R13B = 13,
    ZMM14 = 14, YMM14 = 14, XMM14 = 14, R14  = 14, R14D = 14, R14W = 14, R14B = 14,
    ZMM15 = 15, YMM15 = 15, XMM15 = 15, R15  = 15, R15D = 15, R15W = 15, R15B = 15,
    ZMM16 = 16, YMM16 = 16, XMM16 = 16, R16  = 16, R16D = 16, R16W = 16, R16B = 16,
    ZMM17 = 17, YMM17 = 17, XMM17 = 17, R17  = 17, R17D = 17, R17W = 17, R17B = 17,
    ZMM18 = 18, YMM18 = 18, XMM18 = 18, R18  = 18, R18D = 18, R18W = 18, R18B = 18,
    ZMM19 = 19, YMM19 = 19, XMM19 = 19, R19  = 19, R19D = 19, R19W = 19, R19B = 19,
    ZMM20 = 20, YMM20 = 20, XMM20 = 20, R20  = 20, R20D = 20, R20W = 20, R20B = 20,
    ZMM21 = 21, YMM21 = 21, XMM21 = 21, R21  = 21, R21D = 21, R21W = 21, R21B = 21,
    ZMM22 = 22, YMM22 = 22, XMM22 = 22, R22  = 22, R22D = 22, R22W = 22, R22B = 22,
    ZMM23 = 23, YMM23 = 23, XMM23 = 23, R23  = 23, R23D = 23, R23W = 23, R23B = 23,
    ZMM24 = 24, YMM24 = 24, XMM24 = 24, R24  = 24, R24D = 24, R24W = 24, R24B = 24,
    ZMM25 = 25, YMM25 = 25, XMM25 = 25, R25  = 25, R25D = 25, R25W = 25, R25B = 25,
    ZMM26 = 26, YMM26 = 26, XMM26 = 26, R26  = 26, R26D = 26, R26W = 26, R26B = 26,
    ZMM27 = 27, YMM27 = 27, XMM27 = 27, R27  = 27, R27D = 27, R27W = 27, R27B = 27,
    ZMM28 = 28, YMM28 = 28, XMM28 = 28, R28  = 28, R28D = 28, R28W = 28, R28B = 28,
    ZMM29 = 29, YMM29 = 29, XMM29 = 29, R29  = 29, R29D = 29, R29W = 29, R29B = 29,
    ZMM30 = 30, YMM30 = 30, XMM30 = 30, R30  = 30, R30D = 30, R30W = 30, R30B = 30,
    ZMM31 = 31, YMM31 = 31, XMM31 = 31, R31  = 31, R31D = 31, R31W = 31, R31B = 31
};

enum CONDITION_CODE : uint8_t {
    CondO = 0,
    CondNO = 1,
    CondC = 2, CondB = CondC, CondNAE = CondC,
    CondNC = 3, CondNB = CondNC, CondAE = CondNC,
    CondZ = 4, CondE = CondZ,
    CondNZ = 5, CondNE = CondNZ,
    CondBE = 6, CondNA = CondBE,
    CondA = 7, CondNBE = CondA,
    CondS = 8,
    CondNS = 9,
    CondP = 10, CondPE = CondP,
    CondNP = 11, CondPO = CondP,
    CondL = 12, CondNGE = CondL,
    CondGE = 13, CondNL = CondGE,
    CondLE = 14, CondNG = CondLE,
    CondG = 15, CondNLE = CondG
};

enum DATA_SIZE : int8_t {
    DataSize64 = -1,
    DataSize32 = 0,
    DataSize16 = 1
};

enum ADDR_SIZE : int8_t {
    AddrSize64 = -1,
    AddrSize32 = 0,
    AddrSize16 = 1
};

enum REP_STATE : int8_t {
    NO_REP = -1,
    REP_NZ = 0, REP_NE = REP_NZ,
    REP_Z = 1, REP_E = REP_Z,
    REP_NC = 2,
    REP_C = 3
};

enum OPCODE_PREFIX_TYPE : uint8_t {
    OpcodeNoPrefix = 0,
    Opcode66Prefix = 1,
    OpcodeF2Prefix = 2,
    OpcodeF3Prefix = 3
};

struct REX {
#if USE_BITFIELDS
    union {
        uint8_t raw;
        struct {
            uint8_t b : 1;
            uint8_t x : 1;
            uint8_t r : 1;
            uint8_t w : 1;
            uint8_t pre : 4;
        };
    };

    inline constexpr REX() : raw(0) {}
    inline constexpr REX(uint8_t raw) : raw(raw) {}

    inline constexpr uint8_t B() const {
        return this->b << 3;;
    }

    inline constexpr uint8_t X() const {
        return this->x << 3;
    }

    inline constexpr uint8_t R() const {
        return this->r << 3;
    }

    inline constexpr bool W() const {
        return this->w;
    }
#else
    uint8_t raw;

    inline constexpr uint8_t B() const {
        return (this->raw & 1) << 3;
    }

    inline constexpr uint8_t X() const {
        return (this->raw & 2) << 2;
    }

    inline constexpr uint8_t R() const {
        return (this->raw & 4) << 1;
    }

    inline constexpr bool W() const {
        return this->raw & 8;
    }
#endif

    inline constexpr bool is_present() const {
        return this->raw;
    }

    inline constexpr operator bool() const {
        return this->raw;
    }

    inline constexpr bool operator!() const {
        return !this->raw;
    }
};

template <size_t max_bits>
struct z86BaseGPRs;

// size: 0x10
template <>
struct z86BaseGPRs<16> {

    using HT = uint8_t; // Half Reg Type
    using RT = uint16_t; // Reg Type
    using DT = uint32_t; // Double Reg Type

    union {
        GPR<16> gpr[8];
        struct {
            union {
                uint16_t rax;
                uint16_t eax;
                uint16_t ax;
                struct {
                    uint8_t al;
                    uint8_t ah;
                };
            };
            union {
                uint16_t rcx;
                uint16_t ecx;
                uint16_t cx;
                struct {
                    uint8_t cl;
                    uint8_t ch;
                };
            };
            union {
                uint16_t rdx;
                uint16_t edx;
                uint16_t dx;
                struct {
                    uint8_t dl;
                    uint8_t dh;
                };
            };
            union {
                uint16_t rbx;
                uint16_t ebx;
                uint16_t bx;
                struct {
                    uint8_t bl;
                    uint8_t bh;
                };
            };
            union {
                uint16_t rsp;
                uint16_t esp;
                uint16_t sp;
                uint8_t spl;
            };
            union {
                uint16_t rbp;
                uint16_t ebp;
                uint16_t bp;
                uint8_t bpl;
            };
            union {
                uint16_t rsi;
                uint16_t esi;
                uint16_t si;
                uint8_t sil;
            };
            union {
                uint16_t rdi;
                uint16_t edi;
                uint16_t di;
                uint8_t dil;
            };
        };
    };
};

// size: 0x20
template <>
struct z86BaseGPRs<32> {

    using HT = uint16_t; // Half Reg Type
    using RT = uint32_t; // Reg Type
    using DT = uint64_t; // Double Reg Type

    union {
        GPR<32> gpr[8];
        struct {
            union {
                uint32_t rax;
                uint32_t eax;
                uint16_t ax;
                struct {
                    uint8_t al;
                    uint8_t ah;
                };
            };
            union {
                uint32_t rcx;
                uint32_t ecx;
                uint16_t cx;
                struct {
                    uint8_t cl;
                    uint8_t ch;
                };
            };
            union {
                uint32_t rdx;
                uint32_t edx;
                uint16_t dx;
                struct {
                    uint8_t dl;
                    uint8_t dh;
                };
            };
            union {
                uint32_t rbx;
                uint32_t ebx;
                uint16_t bx;
                struct {
                    uint8_t bl;
                    uint8_t bh;
                };
            };
            union {
                uint32_t rsp;
                uint32_t esp;
                uint16_t sp;
                uint8_t spl;
            };
            union {
                uint32_t rbp;
                uint32_t ebp;
                uint16_t bp;
                uint8_t bpl;
            };
            union {
                uint32_t rsi;
                uint32_t esi;
                uint16_t si;
                uint8_t sil;
            };
            union {
                uint32_t rdi;
                uint32_t edi;
                uint16_t di;
                uint8_t dil;
            };
        };
    };
};

// size: 0x40
template <>
struct z86BaseGPRs<64> {

    using HT = uint32_t; // Half Reg Type
    using RT = uint64_t; // Reg Type
    using DT = uint128_t; // Double Reg Type

    union {
        GPR<64> gpr[16];
        struct {
            union {
                uint64_t rax;
                uint32_t eax;
                uint16_t ax;
                struct {
                    uint8_t al;
                    uint8_t ah;
                };
            };
            union {
                uint64_t rcx;
                uint32_t ecx;
                uint16_t cx;
                struct {
                    uint8_t cl;
                    uint8_t ch;
                };
            };
            union {
                uint64_t rdx;
                uint32_t edx;
                uint16_t dx;
                struct {
                    uint8_t dl;
                    uint8_t dh;
                };
            };
            union {
                uint64_t rbx;
                uint32_t ebx;
                uint16_t bx;
                struct {
                    uint8_t bl;
                    uint8_t bh;
                };
            };
            union {
                uint64_t rsp;
                uint32_t esp;
                uint16_t sp;
                uint8_t spl;
            };
            union {
                uint64_t rbp;
                uint32_t ebp;
                uint16_t bp;
                uint8_t bpl;
            };
            union {
                uint64_t rsi;
                uint32_t esi;
                uint16_t si;
                uint8_t sil;
            };
            union {
                uint64_t rdi;
                uint32_t edi;
                uint16_t di;
                uint8_t dil;
            };
            union {
                uint64_t r8;
                uint32_t r8d;
                uint16_t r8w;
                uint8_t r8b;
            };
            union {
                uint64_t r9;
                uint32_t r9d;
                uint16_t r9w;
                uint8_t r9b;
            };
            union {
                uint64_t r10;
                uint32_t r10d;
                uint16_t r10w;
                uint8_t r10b;
            };
            union {
                uint64_t r11;
                uint32_t r11d;
                uint16_t r11w;
                uint8_t r11b;
            };
            union {
                uint64_t r12;
                uint32_t r12d;
                uint16_t r12w;
                uint8_t r12b;
            };
            union {
                uint64_t r13;
                uint32_t r13d;
                uint16_t r13w;
                uint8_t r13b;
            };
            union {
                uint64_t r14;
                uint32_t r14d;
                uint16_t r14w;
                uint8_t r14b;
            };
            union {
                uint64_t r15;
                uint32_t r15d;
                uint16_t r15w;
                uint8_t r15b;
            };
        };
    };
};

template <bool has_x87>
struct z86BaseFPU {
};

// size: 0x80
template <>
struct z86BaseFPU<true> {
    union {
        alignas(16) long double st[8];
        alignas(16) MMXREG mm[8];
        struct {
            union {
                alignas(16) long double st0;
                alignas(16) MMXREG mm0;
            };
            union {
                alignas(16) long double st1;
                alignas(16) MMXREG mm1;
            };
            union {
                alignas(16) long double st2;
                alignas(16) MMXREG mm2;
            };
            union {
                alignas(16) long double st3;
                alignas(16) MMXREG mm3;
            };
            union {
                alignas(16) long double st4;
                alignas(16) MMXREG mm4;
            };
            union {
                alignas(16) long double st5;
                alignas(16) MMXREG mm5;
            };
            union {
                alignas(16) long double st6;
                alignas(16) MMXREG mm6;
            };
            union {
                alignas(16) long double st7;
                alignas(16) MMXREG mm7;
            };
        };
    };
};

template <size_t max_bits, size_t reg_count>
struct z86BaseSSE;

template <>
struct z86BaseSSE<0, 0> {
};

template <>
struct z86BaseSSE<128, 8> {
    union {
        SSEREG xmm[8];
        SSEREG ymm[8];
        SSEREG zmm[8];
        struct {
            union {
                SSEREG xmm0;
                SSEREG ymm0;
                SSEREG zmm0;
            };
            union {
                SSEREG xmm1;
                SSEREG ymm1;
                SSEREG zmm1;
            };
            union {
                SSEREG xmm2;
                SSEREG ymm2;
                SSEREG zmm2;
            };
            union {
                SSEREG xmm3;
                SSEREG ymm3;
                SSEREG zmm3;
            };
            union {
                SSEREG xmm4;
                SSEREG ymm4;
                SSEREG zmm4;
            };
            union {
                SSEREG xmm5;
                SSEREG ymm5;
                SSEREG zmm5;
            };
            union {
                SSEREG xmm6;
                SSEREG ymm6;
                SSEREG zmm6;
            };
            union {
                SSEREG xmm7;
                SSEREG ymm7;
                SSEREG zmm7;
            };
        };
    };
};

template <>
struct z86BaseSSE<128, 16> {
    union {
        SSEREG xmm[16];
        SSEREG ymm[16];
        SSEREG zmm[16];
        struct {
            union {
                SSEREG xmm0;
                SSEREG ymm0;
                SSEREG zmm0;
            };
            union {
                SSEREG xmm1;
                SSEREG ymm1;
                SSEREG zmm1;
            };
            union {
                SSEREG xmm2;
                SSEREG ymm2;
                SSEREG zmm2;
            };
            union {
                SSEREG xmm3;
                SSEREG ymm3;
                SSEREG zmm3;
            };
            union {
                SSEREG xmm4;
                SSEREG ymm4;
                SSEREG zmm4;
            };
            union {
                SSEREG xmm5;
                SSEREG ymm5;
                SSEREG zmm5;
            };
            union {
                SSEREG xmm6;
                SSEREG ymm6;
                SSEREG zmm6;
            };
            union {
                SSEREG xmm7;
                SSEREG ymm7;
                SSEREG zmm7;
            };
            union {
                SSEREG xmm8;
                SSEREG ymm8;
                SSEREG zmm8;
            };
            union {
                SSEREG xmm9;
                SSEREG ymm9;
                SSEREG zmm9;
            };
            union {
                SSEREG xmm10;
                SSEREG ymm10;
                SSEREG zmm10;
            };
            union {
                SSEREG xmm11;
                SSEREG ymm11;
                SSEREG zmm11;
            };
            union {
                SSEREG xmm12;
                SSEREG ymm12;
                SSEREG zmm12;
            };
            union {
                SSEREG xmm13;
                SSEREG ymm13;
                SSEREG zmm13;
            };
            union {
                SSEREG xmm14;
                SSEREG ymm14;
                SSEREG zmm14;
            };
            union {
                SSEREG xmm15;
                SSEREG ymm15;
                SSEREG zmm15;
            };
        };
    };
};

template <>
struct z86BaseSSE<256, 16> {
    union {
        SSEREG xmm[16];
        AVXREG ymm[16];
        AVXREG zmm[16];
        struct {
            union {
                SSEREG xmm0;
                AVXREG ymm0;
                AVXREG zmm0;
            };
            union {
                SSEREG xmm1;
                AVXREG ymm1;
                AVXREG zmm1;
            };
            union {
                SSEREG xmm2;
                AVXREG ymm2;
                AVXREG zmm2;
            };
            union {
                SSEREG xmm3;
                AVXREG ymm3;
                AVXREG zmm3;
            };
            union {
                SSEREG xmm4;
                AVXREG ymm4;
                AVXREG zmm4;
            };
            union {
                SSEREG xmm5;
                AVXREG ymm5;
                AVXREG zmm5;
            };
            union {
                SSEREG xmm6;
                AVXREG ymm6;
                AVXREG zmm6;
            };
            union {
                SSEREG xmm7;
                AVXREG ymm7;
                AVXREG zmm7;
            };
            union {
                SSEREG xmm8;
                AVXREG ymm8;
                AVXREG zmm8;
            };
            union {
                SSEREG xmm9;
                AVXREG ymm9;
                AVXREG zmm9;
            };
            union {
                SSEREG xmm10;
                AVXREG ymm10;
                AVXREG zmm10;
            };
            union {
                SSEREG xmm11;
                AVXREG ymm11;
                AVXREG zmm11;
            };
            union {
                SSEREG xmm12;
                AVXREG ymm12;
                AVXREG zmm12;
            };
            union {
                SSEREG xmm13;
                AVXREG ymm13;
                AVXREG zmm13;
            };
            union {
                SSEREG xmm14;
                AVXREG ymm14;
                AVXREG zmm14;
            };
            union {
                SSEREG xmm15;
                AVXREG ymm15;
                AVXREG zmm15;
            };
        };
    };
};

template <>
struct z86BaseSSE<512, 32> {
    union {
        SSEREG xmm[32];
        AVXREG ymm[32];
        AVX512REG zmm[32];
        struct {
            union {
                SSEREG xmm0;
                AVXREG ymm0;
                AVX512REG zmm0;
            };
            union {
                SSEREG xmm1;
                AVXREG ymm1;
                AVX512REG zmm1;
            };
            union {
                SSEREG xmm2;
                AVXREG ymm2;
                AVX512REG zmm2;
            };
            union {
                SSEREG xmm3;
                AVXREG ymm3;
                AVX512REG zmm3;
            };
            union {
                SSEREG xmm4;
                AVXREG ymm4;
                AVX512REG zmm4;
            };
            union {
                SSEREG xmm5;
                AVXREG ymm5;
                AVX512REG zmm5;
            };
            union {
                SSEREG xmm6;
                AVXREG ymm6;
                AVX512REG zmm6;
            };
            union {
                SSEREG xmm7;
                AVXREG ymm7;
                AVX512REG zmm7;
            };
            union {
                SSEREG xmm8;
                AVXREG ymm8;
                AVX512REG zmm8;
            };
            union {
                SSEREG xmm9;
                AVXREG ymm9;
                AVX512REG zmm9;
            };
            union {
                SSEREG xmm10;
                AVXREG ymm10;
                AVX512REG zmm10;
            };
            union {
                SSEREG xmm11;
                AVXREG ymm11;
                AVX512REG zmm11;
            };
            union {
                SSEREG xmm12;
                AVXREG ymm12;
                AVX512REG zmm12;
            };
            union {
                SSEREG xmm13;
                AVXREG ymm13;
                AVX512REG zmm13;
            };
            union {
                SSEREG xmm14;
                AVXREG ymm14;
                AVX512REG zmm14;
            };
            union {
                SSEREG xmm15;
                AVXREG ymm15;
                AVX512REG zmm15;
            };
            union {
                SSEREG xmm16;
                AVXREG ymm16;
                AVX512REG zmm16;
            };
            union {
                SSEREG xmm17;
                AVXREG ymm17;
                AVX512REG zmm17;
            };
            union {
                SSEREG xmm18;
                AVXREG ymm18;
                AVX512REG zmm18;
            };
            union {
                SSEREG xmm19;
                AVXREG ymm19;
                AVX512REG zmm19;
            };
            union {
                SSEREG xmm20;
                AVXREG ymm20;
                AVX512REG zmm20;
            };
            union {
                SSEREG xmm21;
                AVXREG ymm21;
                AVX512REG zmm21;
            };
            union {
                SSEREG xmm22;
                AVXREG ymm22;
                AVX512REG zmm22;
            };
            union {
                SSEREG xmm23;
                AVXREG ymm23;
                AVX512REG zmm23;
            };
            union {
                SSEREG xmm24;
                AVXREG ymm24;
                AVX512REG zmm24;
            };
            union {
                SSEREG xmm25;
                AVXREG ymm25;
                AVX512REG zmm25;
            };
            union {
                SSEREG xmm26;
                AVXREG ymm26;
                AVX512REG zmm26;
            };
            union {
                SSEREG xmm27;
                AVXREG ymm27;
                AVX512REG zmm27;
            };
            union {
                SSEREG xmm28;
                AVXREG ymm28;
                AVX512REG zmm28;
            };
            union {
                SSEREG xmm29;
                AVXREG ymm29;
                AVX512REG zmm29;
            };
            union {
                SSEREG xmm30;
                AVXREG ymm30;
                AVX512REG zmm30;
            };
            union {
                SSEREG xmm31;
                AVXREG ymm31;
                AVX512REG zmm31;
            };
        };
    };
    union {
        uint64_t k[8];
        struct {
            uint64_t k0;
            uint64_t k1;
            uint64_t k2;
            uint64_t k3;
            uint64_t k4;
            uint64_t k5;
            uint64_t k6;
            uint64_t k7;
        };
    };
};

template <size_t max_bits, bool has_x87, bool has_sse>
struct z86BaseFPUControl {};

// size: 0x4
template <size_t max_bits>
struct z86BaseFPUControl<max_bits, false, true> {
    MXCSR mxcsr; // 0x0
    // 0x4
};

// size: 0x14
template <>
struct z86BaseFPUControl<16, true, false> {
    FCW fcw; // 0x0
    FSW fsw; // 0x2
    uint16_t ftw; // 0x4
    uint16_t fop; // 0x6
    uint32_t fip; // 0x8
    uint32_t fdp; // 0xC
    uint32_t stack_top; // 0x10
    // 0x14
};

// size: 0x18
template <>
struct z86BaseFPUControl<16, true, true> {
    FCW fcw; // 0x0
    FSW fsw; // 0x2
    uint16_t ftw; // 0x4
    uint16_t fop; // 0x6
    uint32_t fip; // 0x8
    uint32_t fdp; // 0xC
    uint32_t stack_top; // 0x10
    MXCSR mxcsr; // 0x14
    // 0x18
};

// size: 0x18
template <>
struct z86BaseFPUControl<32, true, false> {
    FCW fcw; // 0x0
    FSW fsw; // 0x2
    uint16_t ftw; // 0x4
    uint16_t fop; // 0x6
    uint32_t fip; // 0x8
    uint32_t fdp; // 0xC
    uint16_t fcs; // 0x10
    uint16_t fds; // 0x12
    uint32_t stack_top; // 0x14
    // 0x18
};

// size: 0x1C
template <>
struct z86BaseFPUControl<32, true, true> {
    FCW fcw; // 0x0
    FSW fsw; // 0x2
    uint16_t ftw; // 0x4
    uint16_t fop; // 0x6
    uint32_t fip; // 0x8
    uint32_t fdp; // 0xC
    uint16_t fcs; // 0x10
    uint16_t fds; // 0x12
    uint32_t stack_top; // 0x14
    MXCSR mxcsr; // 0x18
    // 0x1C
};

// size: 0x20
template <>
struct z86BaseFPUControl<64, true, false> {
    FCW fcw; // 0x0
    FSW fsw; // 0x2
    uint16_t ftw; // 0x4
    uint16_t fop; // 0x6
    uint64_t fip; // 0x8
    uint64_t fdp; // 0x10
    uint16_t fcs; // 0x18
    uint16_t fds; // 0x1A
    uint32_t stack_top; // 0x1C
    // 0x20
};

// size: 0x28 (because of alignment)
template <>
struct z86BaseFPUControl<64, true, true> {
    FCW fcw; // 0x0
    FSW fsw; // 0x2
    uint16_t ftw; // 0x4
    uint16_t fop; // 0x6
    uint64_t fip; // 0x8
    uint64_t fdp; // 0x10
    uint16_t fcs; // 0x18
    uint16_t fds; // 0x1A
    uint32_t stack_top; // 0x1C
    MXCSR mxcsr; // 0x20
    // 0x24
};

struct z86DescriptorCache80286 {
    uint16_t base_low;
    uint8_t base_high;
    uint8_t access_rights;
    uint16_t limit;
};

template <size_t max_bits>
struct z86DescriptorCacheBase;
// Seg Defaults:
// - Base: 0
// - Limit: 0xFFFF
// - Access: 0x93
// Table Defaults:
// - Base: 0
// - Limit: 0xFFFF
// - Access: 0x82

// Size: 0x8
template <>
struct z86DescriptorCacheBase<16> {
    using BT = uint32_t; // Base Type
    using LT = uint16_t; // Limit type

    const uint32_t base = 0; // 0x0
    const uint16_t limit = 0; // 0x4
    const uint8_t type = 0; // 0x6
    const uint8_t privilege = 0; // 0x7
    // 0x8

    inline constexpr z86DescriptorCacheBase() = default;
    inline constexpr z86DescriptorCacheBase(uint16_t limit, uint32_t base) : base(base), limit(limit), type(0), privilege(0) {}
