#pragma clang diagnostic ignored "-Wc++20-extensions"
#pragma clang diagnostic ignored "-Wdeprecated-volatile"
#pragma clang diagnostic ignored "-Winvalid-source-encoding"

#include <stdlib.h>
#include <stdint.h>
#include <limits.h>
#include <stdint.h>
#include <direct.h>
#include <type_traits>

#include <string.h>

#define _USE_MATH_DEFINES 1
#include <math.h>

#if __INTELLISENSE__
#undef _HAS_CXX17
#define _HAS_CXX20 1
#endif
#include <bit>

#if __INTELLISENSE__
#undef _HAS_CXX17
#define _HAS_CXX17 1
#undef _HAS_CXX20
#define _HAS_CXX20 0
#endif
#include <mutex>

#include "../zero/FloatConstants.h"

#include "../zero/util.h"

template <typename T>
using ZUNList = ZUNListBase<T, true>;
template <typename T>
using ZUNListHead = ZUNListHeadBase<T, true>;

#define GAME_VERSION UDoALG_VER

#define ENGLISH_STRINGS

#ifndef ENGLISH_STRINGS
#define JpEnStr(jstring, estring) jstring
#else
#define JpEnStr(jstring, estring) estring
#endif

//#define USE_VOLATILES_AND_BARRIERS_FOR_ORIGINAL_CODEGEN 1

#if USE_VOLATILES_AND_BARRIERS_FOR_ORIGINAL_CODEGEN
#define codegen_volatile volatile
#define codegen_barrier() _ReadWriteBarrier()
#else
#define codegen_volatile
#define codegen_barrier() do {} while(false)
#endif


#undef WIN32_LEAN_AND_MEAN
#include <Windows.h>
#include <process.h>
#include <WinUser.h>
#include <wbemidl.h>
#include <winnls32.h>
#include <d3d9.h>
#include <dinput.h>
#include <dsound.h>
#define UNICODE
#include <Core/DXUT.h>
#include <Optional/SDKsound.h>
#undef UNICODE


#include "../zero/zun.h"

//#pragma comment (lib, "wbemuuid.lib")


#ifndef SAFE_FREE
#define SAFE_FREE(p)       { if (p) { free ((void*)p);     (p)=NULL; } }
#endif

#ifndef SAFE_FREE_FAST
#define SAFE_FREE_FAST(p)       { if (auto ptr = (p)) { free ((void*)ptr);     (p)=NULL; } }
#endif


dllexport gnu_noinline void* cdecl memset_force(void* dst, int val, size_t size) {
    gnu_attr(musttail) return memset(dst, val, size);
}

#define zero_this() memset_force(this, 0, sizeof(*this));

#define UNUSED_DWORD (GARBAGE_ARG(int32_t))
#define UNUSED_FLOAT (GARBAGE_ARG(float))

typedef struct AnmManager AnmManager;

#define ANM_FULL_ID_BITS (32)
#define ANM_FAST_ID_BITS (15)
#define ANM_SLOW_ID_BITS (ANM_FULL_ID_BITS - ANM_FAST_ID_BITS)
#define INVALID_FAST_ID uint_width_max(ANM_FAST_ID_BITS)



// size: 0x4
union AnmID {
    uint32_t full;
    struct {
        uint32_t fast_id : ANM_FAST_ID_BITS;
        uint32_t slow_id : ANM_SLOW_ID_BITS;
    };

    inline AnmID() : full(0) {}

    inline AnmID(AnmID& id) : full(id.full) {}

    inline constexpr operator uint32_t() const {
        return this->full;
    }
    template<typename T> requires(std::is_integral_v<T>)
       inline constexpr AnmID& operator=(const T& raw) {
        this->full = raw;
        return *this;
    }
};

// size: 0x634
struct AnmVM {
    // size: 0x4D8
    struct AnmVMData {
        dummy_fields(0x18);
        uint32_t layer; // 0x18
        dummy_fields(0x4BC);
    };
    ValidateStructSize(0x4D8, AnmVMData);

    // size: 0x15C
    struct AnmVMController {
        AnmID id = {}; // 0x0, 0x4D8
        uint32_t fast_id; // 0x4, 0x4DC
        dummy_fields(0x2C); // 0x8, 0x4E0
        ZUNList<AnmVM> global_list_node; // 0x34
        ZUNList<AnmVM> __draw_list_node; // 0x44
        ZUNList<AnmVM> child_list_node; // 0x54
        ZUNList<AnmVM> child_list_head; // 0x64
        ZUNList<AnmVM> destroy_list_node; // 0x74
        AnmVM* next_in_layer; // 0x84
        AnmVM* prev_in_layer; // 0x88
        AnmVM* root_vm; // 0x8C
        AnmVM* parent; // 0x90
        float slowdown; // 0x94
        void* special_data; // 0x98
        uint32_t special_data_size; // 0x9C
        uint32_t __vm_state; // 0xA0
        dummy_fields(0xB8);
    };
    ValidateStructSize(0x15C, AnmVMController);

    AnmVMData data; // 0x0
    AnmVMController controller; // 0x4D8
    // 0x634
};
ValidateStructSize(0x634, AnmVM);

// size: 0x64C
struct AnmFastVM : AnmVM {
    ZUNList<AnmFastVM> fast_node; // 0x634
    bool alive; // 0x644
    padding_bytes(0x3); // 0x645
    uint32_t fast_id; // 0x648
    // 0x64C
};
ValidateStructSize(0x64C, AnmFastVM);

// Rx22AEC8
static std::mutex ANM_LIST_MUTEX;

struct AnmManager {
    // size: 0x20
    struct AnmListEnds {
        // size: 0x10
        struct AnmListEnd {
            ZUNList<AnmVM>* __ptr_0; // 0x0
            ZUNList<AnmVM>* __ptr_4; // 0x4
            ZUNList<AnmVM>* __ptr_8; // 0x8
            ZUNList<AnmVM>* __ptr_C; // 0xC
            // 0x10
        };
        ValidateStructSize(0x10, AnmListEnd);

        AnmListEnd head; // 0x0
        AnmListEnd tail; // 0x10
        // 0x20
    };
    ValidateStructSize(0x20, AnmListEnds);

    unknown_fields(0x1C); // 0x0
    int __dword_1C; // 0x1C
    int __dword_20; // 0x20
    dummy_fields(0xA0); // 0x24
    int __int_C4; // 0xC4
    int __dword_C8; // 0xC8
    int __int_CC; // 0xCC
    int __int_D0; // 0xD0
    Int2 __int2_D4; // 0xD4
    Float2 __float2_DC; // 0xDC
    uint32_t __counter_E4; // 0xE4
    AnmVM root_vm; // 0xE8
    int __int_71C; // 0x71C
    int32_t __current_side; // 0x720
    union {
        AnmListEnds lists[2]; // 0x724
        struct {
            AnmListEnds world_list; // 0x724
            AnmListEnds ui_list; // 0x744
        };
    };
    AnmFastVM fast_array[uint_width_max(ANM_FAST_ID_BITS)]; // 0x764
    AnmFastVM fast_array_end;
    int32_t next_snapshot_fast_id; // 0x3260764
    int32_t next_snapshot_discriminator; // 0x3260768
    ZUNList<AnmVM> snapshot_list_head; // 0x326076C
    ZUNList<AnmVM> free_list_head; // 0x326077C
    int __dword_326078C; // 0x326078C


    // RxBE0F0
    dllexport AnmVM* get_vm_with_id(AnmID id) {
        if (id) {
            if (id.fast_id == INVALID_FAST_ID) {
                for (size_t i = 0; i < countof(this->lists); ++i) {
                    for (
                        ZUNList<AnmVM>* node = this->lists[i].head.__ptr_0;
                        node;
                        node = node->next
                    ) {
                        AnmVM* vm = node->data;
                        if (vm->controller.id == id) {
                            return vm;
                        }
                    }
                    for (
                        ZUNList<AnmVM>* node = this->lists[i].head.__ptr_8;
                        node;
                        node = node->next
                    ) {
                        AnmVM* vm = node->data;
                        if (vm->controller.id == id) {
                            return vm;
                        }
                    }
                }
            }
            else if (this->fast_array[id].alive) {
                AnmFastVM* vm = &this->fast_array[id];
                if (vm->controller.id == id) {
                    return vm;
                }
            }
        }
        return NULL;
    }

    dllexport AnmVM* get_vm_with_id_new(const AnmID id) const {
        if (id) {
            if (expect(id.fast_id == INVALID_FAST_ID, false)) {
                for (size_t i = 0; i < countof(this->lists); ++i) {
                    for (
                        ZUNList<AnmVM>* node = this->lists[i].head.__ptr_0;
                        node;
                        node = node->next
                    ) {
                        AnmVM* vm = node->data;
                        if (vm->controller.id == id) {
                            return vm;
                        }
                    }
                    for (
                        ZUNList<AnmVM>* node = this->lists[i].head.__ptr_8;
                        node;
                        node = node->next
                    ) {
                        AnmVM* vm = node->data;
                        if (vm->controller.id == id) {
                            return vm;
                        }
                    }
                }
            }
            else if (this->fast_array[id].alive) {
                const AnmFastVM* vm = &this->fast_array[id];
                if (vm->controller.id == id) {
                    return (AnmVM*)vm;
                }
            }
        }
        return NULL;
    }
};

struct AnmManagerC {
    // size: 0x20
    struct AnmListEnds {
        // size: 0x10
        struct AnmListEnd {
            ZUNList<AnmVM>* __ptr_0; // 0x0
            ZUNList<AnmVM>* __ptr_4; // 0x4
            ZUNList<AnmVM>* __ptr_8; // 0x8
            ZUNList<AnmVM>* __ptr_C; // 0xC
            // 0x10
        };
        ValidateStructSize(0x10, AnmListEnd);

        AnmListEnd head; // 0x0
        AnmListEnd tail; // 0x10
        // 0x20
    };
    ValidateStructSize(0x20, AnmListEnds);

    unknown_fields(0xC); // 0x0
    int __dword_1C; // 0x1C
    int __dword_20; // 0x20
    dummy_fields(0xA0); // 0x24
    int __int_C4; // 0xC4
    int __dword_C8; // 0xC8
    int __int_CC; // 0xCC
    int __int_D0; // 0xD0
    Int2 __int2_D4; // 0xD4
    Float2 __float2_DC; // 0xDC
    uint32_t __counter_E4; // 0xE4
    AnmVM root_vm; // 0xE8
    int __int_71C; // 0x71C
    int32_t __current_side; // 0x720
    union {
        AnmListEnds lists[2]; // 0x724
        struct {
            AnmListEnds world_list; // 0x724
            AnmListEnds ui_list; // 0x744
        };
    };
    AnmFastVM fast_array[uint_width_max(ANM_FAST_ID_BITS)]; // 0x764
    AnmFastVM fast_array_end;
    int32_t next_snapshot_fast_id; // 0x3260764
    int32_t next_snapshot_discriminator; // 0x3260768
    ZUNList<AnmVM> snapshot_list_head; // 0x326076C
    ZUNList<AnmVM> free_list_head; // 0x326077C
    int __dword_326078C; // 0x326078C

    // This looks like it's just D3D config, hopefully it can be called less
    dllexport gnu_noinline void thiscall __sub_rCC030(int32_t layer_index, size_t list_index) {
        use_var(layer_index);
        use_var(list_index);
        volatile float dumb = tan(rand());
    }

    dllexport gnu_noinline void thiscall draw_vm(AnmVM* vm) {
        use_var(vm);
        volatile float dumb = tan(rand());
    }

    dllexport int thiscall render_layer(int32_t layer_index) {
        std::scoped_lock<std::mutex> lock(ANM_LIST_MUTEX);

        for (size_t i = 0; i < countof(this->lists); ++i) {

            this->lists[i].tail = {
                (ZUNList<AnmVM>*)&this->lists[i].head,
                NULL,
                NULL,
                NULL
            };

            ZUNList<AnmVM>* tail_node = (ZUNList<AnmVM>*)&this->lists[i].tail;

            ZUNList<AnmVM>* cur_node = this->lists[i].head.__ptr_0;

            bool found_data = false;

            while (cur_node) {
                const uint32_t* vm_state_ptr = based_pointer<uint32_t>(cur_node, 0x6C);
                if (!*vm_state_ptr) {
                    AnmVM* vm_ptr = based_pointer<AnmVM>(cur_node, -0x50C);
                    //uint32_t layer = *based_pointer<uint32_t>(cur_node, -0x4F4);
                    uint32_t layer = vm_ptr->data.layer;
                    switch (layer) {
                        case 0x2B:
                            layer = 0x1A;
                            break;
                        case 0x2C ... 0x33:
                            layer -= 15;
                            break;
                    }
                    if (expect_chance(layer == layer_index, false, 0.75)) {
                        found_data = true;

                        //vm_ptr->controller.__draw_list_node.data = vm_ptr;
                        //vm_ptr->controller.__draw_list_node.idk = NULL;

                        ZUNList<AnmVM>* tail_next = tail_node->next;
                        vm_ptr->controller.__draw_list_node.next = tail_next;
                        vm_ptr->controller.__draw_list_node.prev = tail_node;
                        ZUNList<AnmVM>* draw_node = cur_node + 1;
                        tail_node->next = draw_node;
                        if (tail_next) {
                            tail_next->prev = draw_node;
                        }
                        tail_node = draw_node;
                    }
                }

                cur_node = cur_node->next;
            }
        }
    }

    dllexport int render_layer_new(int32_t layer_index) {
        std::scoped_lock<std::mutex> lock(ANM_LIST_MUTEX);

        for (uint8_t i = 0; i < countof(this->lists); ++i) {

            ZUNList<AnmVM>* cur_node = this->lists[i].head.__ptr_0;

            uint8_t d3d_unconfigured = true;

            while (expect(cur_node != NULL, true)) {
                const uint32_t* vm_state_ptr = based_pointer<uint32_t>(cur_node, 0x6C);
                if (!*vm_state_ptr) {
                    uint32_t layer = *based_pointer<uint32_t>(cur_node, -0x4F4);
                    switch (layer) {
                        case 0x2B:
                            layer = 0x1A;
                            break;
                        case 0x2C ... 0x33:
                            layer -= 15;
                            break;
                    }
                    if (expect_chance(layer == layer_index, false, 0.75)) {
                        if (expect(!!d3d_unconfigured, false)) {
                            d3d_unconfigured = false;
                            this->__sub_rCC030(layer_index, i);
                        }
                        AnmVM* vm_ptr = based_pointer<AnmVM>(cur_node, -0x50C);
                        this->draw_vm(vm_ptr);
                        //++this->__counter_E4;
                    }
                }
                cur_node = cur_node->next;
            }

            cur_node = this->lists[i].head.__ptr_8;

            while (expect(cur_node != NULL, true)) {
                const uint32_t* vm_state_ptr = based_pointer<uint32_t>(cur_node, 0x6C);
                if (!*vm_state_ptr) {
                    uint32_t layer = *based_pointer<uint32_t>(cur_node, -0x4F4);
                    switch (layer) {
                        case 0x1A:
                            layer = 0x2B;
                            break;
                        case 0x1D ... 0x24:
                            layer += 15;
                            break;
                        default:
                            layer = 0x2D;
                            break;
                    }
                    if (expect_chance(layer == layer_index, false, 0.75)) {
                        if (expect(!!d3d_unconfigured, false)) {
                            d3d_unconfigured = false;
                            this->__sub_rCC030(layer_index, i);
                        }
                        AnmVM* vm_ptr = based_pointer<AnmVM>(cur_node, -0x50C);
                        this->draw_vm(vm_ptr);
                        //++this->__counter_E4;
                    }
                }
                cur_node = cur_node->next;
            }
        }

        return 1;
    }

    dllexport int render_layer_new2(int32_t layer_index) {
        std::scoped_lock<std::mutex> lock(ANM_LIST_MUTEX);

        for (uint8_t i = 0; i < countof(this->lists); ++i) {

            ZUNList<AnmVM>* cur_node = this->lists[i].head.__ptr_0;

            uint8_t d3d_unconfigured = true;

            while (expect(cur_node != NULL, true)) {
                if (!*based_pointer<uint32_t>(cur_node, 0x6C)) {
                    uint32_t layer = *based_pointer<uint32_t>(cur_node, -0x4F4);
                    switch (layer) {
                        case 0x2B:
                            layer = 0x1A;
                            break;
                        case 0x2C ... 0x33:
                            layer -= 15;
                            break;
                    }
                    if (expect_chance(layer == layer_index, false, 0.75)) {
                        if (expect(!!d3d_unconfigured, false)) {
                            d3d_unconfigured = false;
                            this->__sub_rCC030(layer_index, i);
                        }
                        this->draw_vm(based_pointer<AnmVM>(cur_node, -0x50C));
                    }
                }
                cur_node = cur_node->next;
            }

            cur_node = this->lists[i].head.__ptr_8;

            while (expect(cur_node != NULL, true)) {
                if (!*based_pointer<uint32_t>(cur_node, 0x6C)) {
                    uint32_t layer = *based_pointer<uint32_t>(cur_node, -0x4F4);
                    switch (layer) {
                        case 0x1A:
                            layer = 0x2B;
                            break;
                        case 0x1D ... 0x24:
                            layer += 15;
                            break;
                        default:
                            layer = 0x2D;
                            break;
                    }
                    if (expect_chance(layer == layer_index, false, 0.75)) {
                        if (expect(!!d3d_unconfigured, false)) {
                            d3d_unconfigured = false;
                            this->__sub_rCC030(layer_index, i);
                        }
                        this->draw_vm(based_pointer<AnmVM>(cur_node, -0x50C));
                    }
                }
                cur_node = cur_node->next;
            }
        }

        return 1;
    }
};

dllexport gnu_noinline long double vectorcall zsinB(double value) {
    use_var(value);
    return tan(rand());
}

dllexport float vectorcall zsinfB(float value) {
    return zsinB(value);
}

struct Player {
    char gap0[8420]; // 0x0
    int32_t unfocused_linear_speed; // 0x20E4
    int32_t focused_linear_speed; // 0x20E8
    int32_t unfocused_diagonal_speed; // 0x20EC
    int32_t focused_diagonal_speed; // 0x20F0
};

// size: 0x3C
struct CpuCollider {
    Float3 position; // 0x0
    Float3 __float3_C; // 0xC
    Float2 __hitbox_size; // 0x18
    float __hitbox_radius; // 0x20
    float __angle_24; // 0x24
    float __angle_28; // 0x28
    float __float_2C; // 0x2C
    int32_t __life; // 0x30
    void* __entity_ptr; // 0x34
    union {
        uint32_t flags; // 0x38
        struct {
            uint32_t round : 1;
        };
    };
    // 0x3C
};

struct GameSide;

// size: 0xEA64C
struct CpuHit {
    void* vftable; // 0x0
    CpuCollider __collider_array_4[8000]; // 0x4
    CpuCollider __collider_array_75304[8000]; // 0x75304
    int32_t collider_count; // 0xEA604
    Float3 position; // 0xEA608
    int __int_EA614; // 0xEA614
    int32_t __int_EA618; // 0xEA618
    int32_t __int_EA61C; // 0xEA61C
    int32_t __int_EA620; // 0xEA620
    int32_t __int_EA624; // 0xEA624
    int __int_EA628; // 0xEA628
    int __dword_EA62C; // 0xEA62C
    int __int_EA630; // 0xEA630
    int __int_EA634; // 0xEA634
    int __int_EA638; // 0xEA638
    int __int_EA63C; // 0xEA63C
    int __int_EA640; // 0xEA640
    uint32_t side_index; // 0xEA644
    GameSide* game_side_ptr; // 0xEA648
    // 0xEA64C
};

// size: 0x36EECC
struct CpuHitC {
    void* vftable; // 0x0
    CpuCollider __collider_array_4[30000]; // 0x4
    CpuCollider __collider_array_1B7744[30000]; // 0x1B7744
    int32_t collider_count; // 0x36EE84
    Float3 position; // 0x36EE88
    int __int_36EE94; // 0x36EE94
    int32_t __int_36EE98; // 0x36EE98
    int32_t __int_36EE9C; // 0x36EE9C
    int32_t __int_36EEA0; // 0x36EEA0
    int32_t __int_36EEA4; // 0x36EEA4
    int __int_36EEA8; // 0x36EEA8
    int __dword_36EEAC; // 0x36EEAC
    int __int_36EEB0; // 0x36EEB0
    int __int_36EEB4; // 0x36EEB4
    int __int_36EEB8; // 0x36EEB8
    int __int_36EEBC; // 0x36EEBC
    int __int_36EEC0; // 0x36EEC0
    uint32_t side_index; // 0x36EEC4
    GameSide* game_side_ptr; // 0x36EEC8
    // 0x36EECC

    dllexport uint32_t* vectorcall __check_colliders_new(int, uint32_t *volatile hit_flags_ptr, float, float, float radius);
};

// size: 0x3C
struct GameSide {
    void* bullet_manager_ptr; // 0x0
    Player* player_ptr; // 0x4
    void* enemy_manager_ptr; // 0x8
    void* item_manager_ptr; // 0xC
    void* spellcard_ptr; // 0x10
    void* laser_manager_ptr; // 0x14
    void* gauge_manager_ptr; // 0x18
    void* bomb_manager_ptr; // 0x1C
    void* ability_manager_ptr; // 0x20
    void* popup_manager_ptr; // 0x24
    void* effect_manager_ptr; // 0x28
    void* globals_side_ptr; // 0x2C
    void* shot_manager_ptr; // 0x30
    void* __cpu_hit_ptr; // 0x34
    void* ex_attack_manager_ptr; // 0x38
    // 0x3C
};
ValidateStructSize(0x3C, GameSide);

dllexport GameSide GAME_SIDES[2];

extern "C" {
    extern vec<float, 4> vectorcall __libm_sse2_sincosf(float angle) asm("___libm_sse2_sincosf_");
}

dllexport uint32_t* vectorcall CpuHitC::__check_colliders_new(int, uint32_t *volatile hit_flags_ptr, float, float, float radius) {

    uint32_t hit_flags;
    __asm__(
        "xor %0, %0"
        : "=r"(hit_flags)
    );

    size_t collider_count = this->collider_count;
    if (collider_count) {

        CpuCollider* collider = &this->__collider_array_4[0];
        __asm__("":"+r"(collider));

        vec<int32_t, 4> speed_vec_int = *(vec<int32_t, 4>*)&this->game_side_ptr->player_ptr->unfocused_linear_speed; // { UL, FL, UD, FD }
        vec<float, 4> speed_vec = convertvec(speed_vec_int, vec<float, 4>);
        speed_vec *= 1.0f / 128.0f;

        vec<float, 4> neg_speed_vec = -speed_vec;

