#pragma clang diagnostic ignored "-Wc++17-extensions"
#pragma clang diagnostic ignored "-Wc++20-extensions"
#pragma clang diagnostic ignored "-Wshift-op-parentheses"

// Something got undefined in my cmake file or some
// crap and I'd rather just define it here than fix it
#define POINTER_64 __ptr64

#include <stdlib.h>
#include <stdint.h>
#include <stdio.h>
#include <utility>
#include <tuple>

#include <Windows.h>
#include <winternl.h>
#include <Rpc.h>
#include <winhttp.h>
#include <WinSock2.h>
#include <ws2tcpip.h>
#include <mswsock.h>
#define SECURITY_WIN32
#include <security.h>
#include <schannel.h>
#include <sspi.h>

#include <windns.h>

#include "../zero/util.h"

#pragma comment (lib, "Ws2_32.lib")
#pragma comment (lib, "Dnsapi")
#pragma comment (lib, "secur32.lib")

// Use this when the int3 is intended to
// be a stop rather than a debug break
#define halt_and_catch_fire() __asm__("int3")

/*
Clang doesn't inline string functions from string.h, only memory functions
*/

template <typename T>
static inline constexpr size_t str_len(const T* str) {
	size_t len = 0;
	while (*str++) ++len;
	return len;
}

// Returns end pointer for simplifying concat operations
template <typename T>
static inline T* str_copy(T* dst, const T* src, size_t count) {
	for (size_t i = 0; i < count; ++i) {
		dst[i] = src[i];
	}
	return dst + count;
}

template <typename T, typename ... StrsT>
static inline T* build_str(T* buffer, const T* str, size_t len, StrsT&&... next_strs) {

dllexport DWORD WINAPI WinHttpWebSocketSend(HINTERNET hWebSocket, WINHTTP_WEB_SOCKET_BUFFER_TYPE eBufferType, PVOID pvBuffer, DWORD dwBufferLength) asm("_WinHttpWebSocketSend");
dllexport HINTERNET WINAPI WinHttpWebSocketCompleteUpgrade(HINTERNET hRequest, DWORD_PTR pContext) asm("_WinHttpWebSocketCompleteUpgrade");
dllexport BOOL WINAPI WinHttpReceiveResponse(HINTERNET hRequest, LPVOID lpReserved) asm("_WinHttpReceiveResponse");
dllexport BOOL WINAPI WinHttpSendRequest(HINTERNET hRequest, LPCWSTR lpszHeaders, DWORD dwHeadersLength, LPVOID lpOptional, DWORD dwOptionalLength, DWORD dwTotalLength, DWORD_PTR dwContext) asm("_WinHttpSendRequest");
dllexport HINTERNET WINAPI WinHttpOpenRequest(HINTERNET hConnect, LPCWSTR pwszVerb, LPCWSTR pwszObjectName, LPCWSTR pwszVersion, LPCWSTR pwszReferrer, LPCWSTR FAR* ppwszAcceptTypes, DWORD dwFlags) asm("_WinHttpOpenRequest");
dllexport BOOL WINAPI WinHttpSetOption(HINTERNET hInternet, DWORD dwOption, LPVOID lpBuffer, DWORD dwBufferLength) asm("_WinHttpSetOption");
dllexport HINTERNET WINAPI WinHttpOpen(LPCWSTR pszAgentW, DWORD dwAccessType, LPCWSTR pszProxyW, LPCWSTR pszProxyBypassW, DWORD dwFlags) asm("_WinHttpOpen");

// Replacement version of getaddrinfo that doesn't crash
INT WSAAPI getaddrinfo_replacement(PCSTR pNodeName, PCSTR pServiceName, const ADDRINFOA* pHints, PADDRINFOA* ppResult) {
	char addr_buff[48];
	if (pNodeName) {
		for (const char* node_name_scan = pNodeName; char c = *node_name_scan; ++node_name_scan) {
			switch (c) {
				case '.': case '0' ... '9':
					continue;
			}
			bool restrict_ip_type = false;
			WORD dns_type = DNS_TYPE_AAAA;
			if (pHints) {
				switch (pHints->ai_family) {
					case AF_INET:
						dns_type = DNS_TYPE_A;
						[[fallthrough]];
					case AF_INET6:
						restrict_ip_type = true;
						break;
				}
			}
			PDNS_RECORDA records;
			if (expect(DnsQuery_A(pNodeName, dns_type, !restrict_ip_type ? DNS_QUERY_DUAL_ADDR : 0, NULL, (PDNS_RECORD*)&records, NULL) == 0, true)) {
				PDNS_RECORDA cur_record = records;
				do {
					void* ipv4;
					switch (cur_record->wType) {
						[[unlikely]] default:
							halt_and_catch_fire();
						case DNS_TYPE_CNAME:
							break;
						case DNS_TYPE_AAAA:
							if (
								restrict_ip_type ||
								!(cur_record->Data.AAAA.Ip6Address.IP6Dword[0] == 0 &&
								  cur_record->Data.AAAA.Ip6Address.IP6Dword[1] == 0 &&
								  cur_record->Data.AAAA.Ip6Address.IP6Dword[2] == 0xFFFF0000)
							) {
								inet_ntop(AF_INET6, &cur_record->Data.AAAA.Ip6Address, addr_buff, countof(addr_buff));
								goto found_addr;
							} else if (1) {
								ipv4 = &cur_record->Data.AAAA.Ip6Address.IP6Dword[3];
							} else {
						case DNS_TYPE_A:
							ipv4 = &cur_record->Data.A.IpAddress;
							}
							inet_ntop(AF_INET, ipv4, addr_buff, countof(addr_buff));
							goto found_addr;
					}
				} while ((cur_record = cur_record->pNext));
				DnsFree(records, DnsFreeRecordList);
			}
			return EAI_FAIL;
		found_addr:
			DnsFree(records, DnsFreeRecordList);
			pNodeName = addr_buff;
		}
	}
	return getaddrinfo(pNodeName, pServiceName, pHints, ppResult);
}


struct StaticFlags {
	bool initialized_winsock;
};

static inline constinit StaticFlags flags{
	.initialized_winsock = false
};

#define not_null_hinternet ((HINTERNET)1)

// This is a static variable so that stack space
// doesn't need to be allocated for it every single time
static WSADATA idgaf_about_winsock_version;

/*
static inline constexpr const wchar_t request_header_part_1[] = L"GET ";
static inline constexpr const wchar_t request_header_part_2[] = L" HTTP/1.1\r\n"
																L"Connection: Upgrade\r\n"
																L"Upgrade: websocket\r\n"
																L"User-Agent: ";
static inline constexpr const wchar_t request_header_part_3[] = L"\r\n"
																L"Sec-WebSocket-Key: ";
static inline constexpr const wchar_t request_header_part_4[] = L"\r\n"
																L"Sec-WebSocket-Version: 13\r\n"
																L"Host: ";
static inline constexpr const wchar_t request_header_part_5[] = L":";
static inline constexpr const wchar_t request_header_part_6[] = L"\r\n";
static inline constexpr const wchar_t request_header_part_7[] = L"\r\n\r\n";
*/

// These parts are in the open request func
static inline constexpr const wchar_t request_header_part_1[] = { L'G',L'E',L'T',L' ' };
static inline constexpr const wchar_t request_header_part_2[] = { L' ',L'H',L'T',L'T',L'P',L'/',L'1',L'.',L'1',L'\r',L'\n',
																  L'C',L'o',L'n',L'n',L'e',L'c',L't',L'i',L'o',L'n',L':',L' ',L'U',L'p',L'g',L'r',L'a',L'd',L'e',L'\r',L'\n',
																  L'U',L'p',L'g',L'r',L'a',L'd',L'e',L':',L' ',L'w',L'e',L'b',L's',L'o',L'c',L'k',L'e',L't',L'\r',L'\n',
																  L'U',L's',L'e',L'r',L'-',L'A',L'g',L'e',L'n',L't',L':',L' '
};
static inline constexpr const wchar_t request_header_part_3[] = { L'\r',L'\n',
																  L'S',L'e',L'c',L'-',L'W',L'e',L'b',L'S',L'o',L'c',L'k',L'e',L't',L'-',L'K',L'e',L'y',L':',L' '
};
static inline constexpr const wchar_t request_header_part_4[] = { L'\r',L'\n',
																  L'S',L'e',L'c',L'-',L'W',L'e',L'b',L'S',L'o',L'c',L'k',L'e',L't',L'-',L'V',L'e',L'r',L's',L'i',L'o',L'n',L':',L' ',L'1',L'3',L'\r',L'\n',
																  L'H',L'o',L's',L't',L':',L' '
};
static inline constexpr const wchar_t request_header_part_5[] = { L':' };
static inline constexpr const wchar_t request_header_part_6[] = { L'\r',L'\n' };
// This part is in the send request func
static inline constexpr const wchar_t request_header_part_7[] = { L'\r',L'\n',L'\r',L'\n' };

#define RESPECT_HTTPS 1

static inline constexpr size_t receive_buffer_size = UINT16_MAX + 1;

#if RESPECT_HTTPS
#define TLS_MAX_PACKET_SIZE (16384+512) // payload + extra over head for header/mac/padding (probably an overestimate)
#endif

typedef struct UserAgentData UserAgentData;
typedef struct SocketData SocketData;
typedef struct RequestData RequestData;
typedef struct WebSocketData WebSocketData;

enum StructType {
	GenericDataType,
	SocketDataType,
};

template <StructType _data_type = GenericDataType>
struct FreeData {

	StructType data_type; // 0x0

	inline constexpr FreeData() : data_type(_data_type) {}

	inline void cleanup() {
		switch (this->data_type) {
			case SocketDataType:
				((SocketData*)this)->~SocketData();
				break;
		}
	}
};
ValidateStructSize32(0x4, FreeData<>);

struct UserAgentData : FreeData<GenericDataType> {
	size_t user_agent_str_len; // 0x4
	wchar_t user_agent_str[]; // 0x8

	inline constexpr operator HINTERNET() const {
		return (HINTERNET)this;
	}

	inline UserAgentData(const wchar_t* str, size_t str_len) : user_agent_str_len(str_len) {
		str_copy(this->user_agent_str, str, str_len);
	}

	inline ~UserAgentData() = default;

	static inline UserAgentData* allocate(const wchar_t* str) {
		size_t user_agent_str_len = str_len(str);
		return new (::allocate<UserAgentData, wchar_t>(user_agent_str_len)) UserAgentData(str, user_agent_str_len);
	}
};

static inline constexpr size_t nonce_key_encode_bits = 144;

struct SocketData : FreeData<SocketDataType> {

	static inline constexpr size_t port_str_buf_len = 8;

	SOCKET sock; // 0x4
	wchar_t* server_str; // 0x8
	size_t server_str_len; // 0xC
	wchar_t port_str[port_str_buf_len]; // 0x10
	wchar_t nonce_key_str[24]; // 0x20
	union { // 0x50
		uint8_t nonce_key[16];
		uint32_t nonce_key_dwords[5];
		UBitInt(nonce_key_encode_bits) nonce_key_wide;
	};
	const wchar_t* user_agent_str; // 0x64
	size_t user_agent_str_len; // 0x68
	size_t port_str_len; // 0x6C
	bool upgraded_to_websocket; // 0x70
	bool generated_nonce_key; // 0x71
#if RESPECT_HTTPS
	bool tls_in_use; // 0x72
	bool tls_initialized; // 0x73
	SecPkgContext_StreamSizes tls_sizes; // 0x74
	// uint64_t __unused_qword_A; // 0x88
	CredHandle tls_handle; // 0x90
	CtxtHandle tls_context; // 0xA0
	//cache_align char packet_buffer[TLS_MAX_PACKET_SIZE];
#endif

	inline constexpr operator HINTERNET() const {
		return (HINTERNET)this;
	}

	inline SocketData(SOCKET sock, const wchar_t* _server_str, const wchar_t* port_str, size_t port_str_len, UserAgentData* user_agent_data)
		: sock(sock), upgraded_to_websocket(false), generated_nonce_key(false), port_str_len(port_str_len),
#if RESPECT_HTTPS
		tls_in_use(false), tls_initialized(false),
#endif
		user_agent_str(user_agent_data->user_agent_str), user_agent_str_len(user_agent_data->user_agent_str_len)
	{
		this->nonce_key_dwords[4] = 0;
		str_copy(this->port_str, port_str, port_str_buf_len);
		size_t server_str_len = str_len(_server_str);
		this->server_str_len = server_str_len;
		wchar_t* server_str = ::allocate<wchar_t>(server_str_len);
		this->server_str = server_str;
		str_copy(server_str, _server_str, server_str_len);
	}

	inline ~SocketData() {
		free(this->server_str);
		// TODO: Close socket like a sane person.
		// For some reason closing the socket here seems to cause requests to fail?
		// The game might be calling close a bit too fast, so try moving this
		// to part of the receive code since that is called from an async thread.
		closesocket(this->sock);
	}

	static inline SocketData* allocate(SOCKET sock, const wchar_t* server_str, const wchar_t* port_str, size_t port_str_len, UserAgentData* user_agent_data) {
		return new (::allocate<SocketData>()) SocketData(sock, server_str, port_str, port_str_len, user_agent_data);
	}

	static inline SocketData* allocate(SOCKET sock, const wchar_t* server_str, const wchar_t* port_str, size_t port_str_len, HINTERNET user_agent_data) {
		return allocate(sock, server_str, port_str, port_str_len, (UserAgentData*)user_agent_data);
	}
};

struct RequestData : FreeData<GenericDataType> {
	SocketData* socket; // 0x4
	size_t request_str_len; // 0x8
	wchar_t request_str[]; // 0xC

	inline constexpr operator HINTERNET() const {
		return (HINTERNET)this;
	}

	inline RequestData(SocketData* socket_data, size_t request_str_len)
		: socket(socket_data), request_str_len(request_str_len)
	{
		// Copying the data into the string is still done outside of this
		// TODO: More parameter packs?
	}

	inline ~RequestData() = default;

	static inline RequestData* allocate(SocketData* socket_data, size_t request_str_len) {
		return new (::allocate<RequestData, wchar_t>(request_str_len)) RequestData(socket_data, request_str_len);
	}

	static inline RequestData* allocate(HINTERNET socket_data, size_t request_str_len) {
		return allocate((SocketData*)socket_data, request_str_len);
	}
};

// This is only a separate struct so that the
// pointer can be blindly freed in WinHttpCloseHandle
struct WebSocketData : FreeData<GenericDataType> {
	SocketData* socket; // 0x4

	inline constexpr operator HINTERNET() const {
		return (HINTERNET)this;
	}

	inline WebSocketData(SocketData* socket_data) : socket(socket_data) {}

	inline ~WebSocketData() = default;

	static inline WebSocketData* allocate(SocketData* socket_data) {
		return new (::allocate<WebSocketData>()) WebSocketData(socket_data);
	}

	static inline WebSocketData* allocate(RequestData* request_data) {
		return allocate(request_data->socket);
	}

	static inline WebSocketData* allocate(HINTERNET request_data) {
		return allocate((RequestData*)request_data);
	}
};

static FILE* websocket_log = NULL;
static FILE* winsock_log = NULL;

/*

th19 info: WinHttpOpen(L"Photon", WINHTTP_ACCESS_TYPE_DEFAULT_PROXY, WINHTTP_NO_PROXY_NAME, WINHTTP_NO_PROXY_BYPASS, 0)

*/
dllexport HINTERNET WINAPI WinHttpOpen(LPCWSTR pszAgentW, DWORD, LPCWSTR, LPCWSTR, DWORD) {
	if (expect(!flags.initialized_winsock, false)) {
