#pragma clang diagnostic ignored "-Wc++17-extensions"
#pragma clang diagnostic ignored "-Wc++20-extensions"
#pragma clang diagnostic ignored "-Wshift-op-parentheses"

// Something got undefined in my cmake file or some
// crap and I'd rather just define it here than fix it
#define POINTER_64 __ptr64

#include <stdlib.h>
#include <stdint.h>
#include <utility>

#include <Windows.h>
#include <winternl.h>
#include <Rpc.h>
#include <winhttp.h>
#include <WinSock2.h>
#include <ws2tcpip.h>
#include <mswsock.h>
#define SECURITY_WIN32
#include <security.h>
#include <schannel.h>
#include <sspi.h>

#include <windns.h>

#include "../zero/util.h"

#pragma comment (lib, "Ws2_32.lib")
#pragma comment (lib, "Dnsapi")
#pragma comment (lib, "secur32.lib")

#define unused gnu_attr(unused)

#define static_str_len(str) (countof(str)-1)

// Use this when the int3 is intended to
// be a stop rather than a debug break
#define halt_and_catch_fire() __asm__("int3")

/*
Clang doesn't inline string functions from string.h, only memory functions
*/

template <typename T>
static inline constexpr size_t str_len(const T* str) {
	size_t len = 0;
	while (*str++) ++len;
	return len;
}

// Returns end pointer for simplifying concat operations
template <typename T>
static inline T* str_copy(T* dst, const T* src, size_t count) {
	for (size_t i = 0; i < count; ++i) {
		dst[i] = src[i];
	}
	return dst + count;
}

template <typename T1, typename T2>
static inline T1* build_str(T1* buffer, T2* str, size_t len) {

static inline T1* build_str(T1* buffer, T2* str, size_t len, StrsT&&... next_views) {
	return build_str(str_copy(buffer, str, len), std::forward<StrsT>(next_views)...);
}

template <typename T>
static inline size_t uint16_to_strbuf(uint16_t value, T* text_buffer) {
	size_t digit_offset;
	switch (value) {
		case 0 ... 9:
			digit_offset = 0;
			break;
		case 10 ... 99:
			digit_offset = 1;
			break;
		case 100 ... 999:
			digit_offset = 2;
			break;
		case 1000 ... 9999:
			digit_offset = 3;
			break;
		default:
			digit_offset = 4;
			break;
	}
	size_t ret = digit_offset + 1;
	do {
		uint16_t digit = value % 10;
		value /= 10;
		text_buffer[digit_offset] = ((T)'0') + digit;
	} while (digit_offset--);
	return ret;
}

template<typename T>
static inline T* allocate() {
	return (T*)malloc(sizeof(T));
}

template<typename T>
static inline T* allocate(size_t count) {
	return (T*)malloc(sizeof(T[count]));
}

template<typename T1, typename T2>
static inline T1* allocate(size_t count) {
	return (T1*)malloc(sizeof(T1) + sizeof(T2[count]));
}

// Status: DONE
dllexport BOOL WINAPI WinHttpCloseHandle(HINTERNET hInternet) asm("_WinHttpCloseHandle");
// Status: 
dllexport HINTERNET WINAPI WinHttpConnect(HINTERNET hSession, LPCWSTR pswzServerName, INTERNET_PORT nServerPort, DWORD dwReserved) asm("_WinHttpConnect");
// Status: 
dllexport DWORD WINAPI WinHttpWebSocketClose(HINTERNET hWebSocket, USHORT usStatus, PVOID pvReason, DWORD dwReasonLength) asm("_WinHttpWebSocketClose");
// Status: 
dllexport DWORD WINAPI WinHttpWebSocketReceive(HINTERNET hWebSocket, PVOID pvBuffer, DWORD dwBufferLength, DWORD* pdwBytesRead, WINHTTP_WEB_SOCKET_BUFFER_TYPE* peBufferType) asm("_WinHttpWebSocketReceive");
// Status: 
dllexport DWORD WINAPI WinHttpWebSocketSend(HINTERNET hWebSocket, WINHTTP_WEB_SOCKET_BUFFER_TYPE eBufferType, PVOID pvBuffer, DWORD dwBufferLength) asm("_WinHttpWebSocketSend");
// Status: 
dllexport HINTERNET WINAPI WinHttpWebSocketCompleteUpgrade(HINTERNET hRequest, DWORD_PTR pContext) asm("_WinHttpWebSocketCompleteUpgrade");
// Status: 
dllexport BOOL WINAPI WinHttpReceiveResponse(HINTERNET hRequest, LPVOID lpReserved) asm("_WinHttpReceiveResponse");
// Status: 
dllexport BOOL WINAPI WinHttpSendRequest(HINTERNET hRequest, LPCWSTR lpszHeaders, DWORD dwHeadersLength, LPVOID lpOptional, DWORD dwOptionalLength, DWORD dwTotalLength, DWORD_PTR dwContext) asm("_WinHttpSendRequest");
// Status: IDK what I'm doing
dllexport HINTERNET WINAPI WinHttpOpenRequest(HINTERNET hConnect, LPCWSTR pwszVerb, LPCWSTR pwszObjectName, LPCWSTR pwszVersion, LPCWSTR pwszReferrer, LPCWSTR FAR* ppwszAcceptTypes, DWORD dwFlags) asm("_WinHttpOpenRequest");
// Status: Maybe a NOP
dllexport BOOL WINAPI WinHttpSetOption(HINTERNET hInternet, DWORD dwOption, LPVOID lpBuffer, DWORD dwBufferLength) asm("_WinHttpSetOption");
// Status: DONE(?)
dllexport HINTERNET WINAPI WinHttpOpen(LPCWSTR pszAgentW, DWORD dwAccessType, LPCWSTR pszProxyW, LPCWSTR pszProxyBypassW, DWORD dwFlags) asm("_WinHttpOpen");


struct StaticFlags {
	/*
	union {
		uint32_t flags;
		struct {
		};
	};
	*/
	bool initialized_winsock;
};

static inline constinit StaticFlags flags{
	.initialized_winsock = false
};

#define not_null_hinternet ((HINTERNET)1)

// This is a static variable so that stack space
// doesn't need to be allocated for it every single time
static WSADATA idgaf_about_winsock_version;

#define USE_STRING_BUILDER 1

#define USE_FACTORIES 1

//#define NULL_TERMINATE_STRINGS 1

#if NULL_TERMINATE_STRINGS
static inline constexpr bool include_null_terminator = true;
#else
static inline constexpr bool include_null_terminator = false;
#endif
static inline constexpr const wchar_t null_string[] = L"";


//#define RESPECT_HTTPS 1

#if RESPECT_HTTPS
#define TLS_MAX_PACKET_SIZE (16384+512) // payload + extra over head for header/mac/padding (probably an overestimate)
#endif

typedef struct UserAgentData UserAgentData;
typedef struct SocketData SocketData;
typedef struct RequestData RequestData;
typedef struct WebSocketData WebSocketData;

enum StructType {
	GenericDataType,
	SocketDataType,
};

template <StructType _data_type = GenericDataType>
struct FreeData {

	StructType data_type; // 0x0

	inline constexpr FreeData() : data_type(_data_type) {}

	inline void cleanup() {
		switch (this->data_type) {
			case SocketDataType:
				((SocketData*)this)->~SocketData();
				break;
		}
	}
};

struct UserAgentData : FreeData<GenericDataType> {
	size_t user_agent_str_len; // 0x4
	wchar_t user_agent_str[]; // 0x8

	inline constexpr operator HINTERNET() const {
		return (HINTERNET)this;
	}

	inline UserAgentData(const wchar_t* str, size_t str_len) : user_agent_str_len(str_len) {
		str_copy(this->user_agent_str, str, str_len);
	}

	inline ~UserAgentData() = default;

	static inline UserAgentData* allocate(const wchar_t* str) {
		size_t user_agent_str_len = str_len(str);
		return new (::allocate<UserAgentData, wchar_t>(user_agent_str_len + include_null_terminator)) UserAgentData(str, user_agent_str_len + include_null_terminator);
	}
};
ValidateFieldOffset32(0x4, UserAgentData, user_agent_str_len);

static inline constexpr size_t nonce_key_encode_bits = 144;

struct SocketData : FreeData<SocketDataType> {

	static inline constexpr size_t port_str_buf_len = 8;

	SOCKET sock; // 0x4
	wchar_t* server_str; // 0x8
	size_t server_str_len; // 0xC
	wchar_t port_str[port_str_buf_len]; // 0x10
	wchar_t nonce_key_str[24]; // 0x20
	union { // 0x50
		uint8_t nonce_key[16];
		uint32_t nonce_key_dwords[5];
		UBitInt(nonce_key_encode_bits) nonce_key_wide;
	};
	const wchar_t* user_agent_str; // 0x64
	size_t user_agent_str_len; // 0x68
	size_t port_str_len; // 0x6C
	bool upgraded_to_websocket; // 0x70
	bool generated_nonce_key; // 0x71
#if RESPECT_HTTPS
	bool tls_in_use; // 0x72
	bool tls_initialized; // 0x73
	CredHandle tls_handle;
	CtxtHandle tls_context;
	SecPkgContext_StreamSizes tls_sizes;
	cache_align char recv_packet_buffer[TLS_MAX_PACKET_SIZE];
	//cache_align char send_packet_buffer[49152]; // Supposedly this buffer needs to be big?
#endif

	inline constexpr operator HINTERNET() const {
		return (HINTERNET)this;
	}

	inline SocketData(SOCKET sock, const wchar_t* _server_str, const wchar_t* port_str, size_t port_str_len, UserAgentData* user_agent_data)
		: sock(sock), upgraded_to_websocket(false), generated_nonce_key(false), port_str_len(port_str_len),
#if RESPECT_HTTPS
		tls_in_use(false), tls_initialized(false),
#endif
		user_agent_str(user_agent_data->user_agent_str), user_agent_str_len(user_agent_data->user_agent_str_len)
	{
		this->nonce_key_dwords[4] = 0;
		str_copy(this->port_str, port_str, port_str_buf_len);
		size_t server_str_len = str_len(_server_str);
		this->server_str_len = server_str_len;
		wchar_t* server_str = ::allocate<wchar_t>(server_str_len + include_null_terminator);
		this->server_str = server_str;
		str_copy(server_str, _server_str, server_str_len + include_null_terminator);
	}

	inline ~SocketData() {
		free(this->server_str);
		// TODO: Close socket like a sane person
		//closesocket(this->sock);
	}

	static inline SocketData* allocate(SOCKET sock, const wchar_t* server_str, const wchar_t* port_str, size_t port_str_len, UserAgentData* user_agent_data) {
		return new (::allocate<SocketData>()) SocketData(sock, server_str, port_str, port_str_len, user_agent_data);
	}

	static inline SocketData* allocate(SOCKET sock, const wchar_t* server_str, const wchar_t* port_str, size_t port_str_len, HINTERNET user_agent_data) {
		return allocate(sock, server_str, port_str, port_str_len, (UserAgentData*)user_agent_data);
	}
};


// These parts are in the open request func
static inline constexpr const wchar_t request_header_part_1[] =	L"GET ";
static inline constexpr const wchar_t request_header_part_2[] = L" HTTP/1.1\r\n"
																L"Connection: Upgrade\r\n"
																L"Upgrade: websocket\r\n"
																L"User-Agent: ";
static inline constexpr const wchar_t request_header_part_3[] = L"\r\n"
																L"Sec-WebSocket-Key: ";
static inline constexpr const wchar_t request_header_part_4[] = L"\r\n"
																L"Sec-WebSocket-Version: 13\r\n"
																L"Host: ";
static inline constexpr const wchar_t request_header_part_5[] = L":";
static inline constexpr const wchar_t request_header_part_6[] = L"\r\n";
// This part is in the send request func
static inline constexpr const wchar_t request_header_part_7[] = L"\r\n\r\n";

struct RequestData : FreeData<GenericDataType> {
	SocketData* socket; // 0x4
	size_t request_str_len; // 0x8
	wchar_t request_str[]; // 0xC

	inline constexpr operator HINTERNET() const {
		return (HINTERNET)this;
	}

	inline RequestData(SocketData* socket_data, size_t request_str_len)
		: socket(socket_data), request_str_len(request_str_len)
	{}

	inline ~RequestData() = default;

	static inline RequestData* allocate(SocketData* socket_data, size_t request_str_len) {
		return new (::allocate<RequestData, wchar_t>(request_str_len + include_null_terminator)) RequestData(socket_data, request_str_len + include_null_terminator);
	}

	static inline RequestData* allocate(HINTERNET socket_data, size_t request_str_len) {
		return allocate((SocketData*)socket_data, request_str_len);
	}
};

// This is only a separate allocation so that I don't
// need to keep track of which pointer is which when
// freeing them in WinHttpCloseHandle
struct WebSocketData : FreeData<GenericDataType> {
	SocketData* socket; // 0x4

	inline constexpr operator HINTERNET() const {
		return (HINTERNET)this;
	}

	inline WebSocketData(SocketData* socket_data) : socket(socket_data) {}

	inline ~WebSocketData() = default;

	static inline WebSocketData* allocate(SocketData* socket_data) {
		return new (::allocate<WebSocketData>()) WebSocketData(socket_data);
	}

	static inline WebSocketData* allocate(RequestData* request_data) {
		return allocate(request_data->socket);
	}

	static inline WebSocketData* allocate(HINTERNET request_data) {
		return allocate((RequestData*)request_data);
	}
};

/*

th19 info: WinHttpOpen(L"Photon", WINHTTP_ACCESS_TYPE_DEFAULT_PROXY, WINHTTP_NO_PROXY_NAME, WINHTTP_NO_PROXY_BYPASS, 0)

*/
dllexport HINTERNET WINAPI WinHttpOpen(LPCWSTR pszAgentW, DWORD, LPCWSTR, LPCWSTR, DWORD) {
	if (expect(!flags.initialized_winsock, false)) {
		flags.initialized_winsock = !WSAStartup(WINSOCK_VERSION, &idgaf_about_winsock_version);
	}
	if (expect(flags.initialized_winsock, true)) {
