#pragma clang diagnostic ignored "-Wc++20-extensions"
#pragma clang diagnostic ignored "-Wdeprecated-volatile"
#pragma clang diagnostic ignored "-Winvalid-source-encoding"

#if !CLANG_CL && __INTELLISENSE__
#define _HAS_CXX17 1
#define _HAS_CXX20 0
#endif

#include <stdlib.h>
#include <stdint.h>
#include <limits.h>
#include <stdint.h>
#include <direct.h>
#include <time.h>

#include <string.h>

#define _USE_MATH_DEFINES 1
#include <math.h>

#include <bit>

#include "../zero/FloatConstants.h"

#include "../zero/util.h"
//#include "../zero/custom_intrin.h"
#include "../zero/func_traits_basic.h"

//#define USE_FAST_REDUCE_ANGLE
#include "../reduce_angle_fast.h"

template <typename T>
using ZUNLinkedListOld = ZUNLinkedListBase<T, true>;

template <typename T>
using ZUNLinkedList = ZUNLinkedListBase<T, true>;
template <typename T>
using ZUNLinkedListHead = ZUNLinkedListHeadDummyBase<T, true>;

#define GAME_VERSION UM_VER

#define ENGLISH_STRINGS

#ifndef ENGLISH_STRINGS
#define JpEnStr(jstring, estring) jstring
#else
#define JpEnStr(jstring, estring) estring
#endif

//#define USE_VOLATILES_AND_BARRIERS_FOR_ORIGINAL_CODEGEN 1

#if USE_VOLATILES_AND_BARRIERS_FOR_ORIGINAL_CODEGEN
#define codegen_volatile volatile
#define codegen_barrier() _ReadWriteBarrier()
#else
#define codegen_volatile
#define codegen_barrier() do {} while(false)
#endif

#define CHEAT_THE_LOADER

#undef WIN32_LEAN_AND_MEAN
#include <Windows.h>
#include <process.h>
#include <WinUser.h>
#include <wbemidl.h>
#include <winnls32.h>
#include <d3d9.h>
#include <dinput.h>
#include <dsound.h>
#define UNICODE
#include <Core/DXUT.h>
#include <Optional/SDKsound.h>
#undef UNICODE

#include "../zero/zun.h"

#pragma comment (lib, "wbemuuid.lib")
#pragma comment (lib, "Xinput9_1_0.lib")


#ifndef SAFE_FREE
#define SAFE_FREE(p)       { if (p) { free ((void*)p);     (p)=NULL; } }
#endif

#ifndef SAFE_FREE_FAST
#define SAFE_FREE_FAST(p)       { if (auto ptr = (p)) { free ((void*)ptr);     (p)=NULL; } }
#endif

/*
#ifdef cdecl
#undef cdecl
#endif
#define cdecl __cdecl
*/


dllexport gnu_noinline void* cdecl memset_force(void* dst, int val, size_t size) {
    gnu_attr(musttail) return memset(dst, val, size);
}

#define zero_this() memset_force(this, 0, sizeof(*this));

#define zero_this_inline() __builtin_memset(this, 0, sizeof(*this));

#define UNUSED_DWORD (GARBAGE_ARG(int32_t))
#define UNUSED_FLOAT (GARBAGE_ARG(float))

struct D3DMATRIXZ : D3DMATRIX {
    // D3DXMatrixIdentity
    inline void set_identity() {
        this->m[0][0] = 1.0f;
        this->m[0][1] = 0.0f;
        this->m[0][2] = 0.0f;
        this->m[0][3] = 0.0f;
        this->m[1][0] = 0.0f;
        this->m[1][1] = 1.0f;
        this->m[1][2] = 0.0f;
        this->m[1][3] = 0.0f;
        this->m[2][0] = 0.0f;
        this->m[2][1] = 0.0f;
        this->m[2][2] = 1.0f;
        this->m[2][3] = 0.0f;
        this->m[3][0] = 0.0f;
        this->m[3][1] = 0.0f;
        this->m[3][2] = 0.0f;
        this->m[3][3] = 1.0f;
    }

    // D3DXMatrixScaling
    inline void set_scaled(float X, float Y, float Z = 1.0f) {
        this->m[0][0] = X;
        this->m[0][1] = 0.0f;
        this->m[0][2] = 0.0f;
        this->m[0][3] = 0.0f;
        this->m[1][0] = 0.0f;
        this->m[1][1] = Y;
        this->m[1][2] = 0.0f;
        this->m[1][3] = 0.0f;
        this->m[2][0] = 0.0f;
        this->m[2][1] = 0.0f;
        this->m[2][2] = Z;
        this->m[2][3] = 0.0f;
        this->m[3][0] = 0.0f;
        this->m[3][1] = 0.0f;
        this->m[3][2] = 0.0f;
        this->m[3][3] = 1.0f;
    }
};
#pragma region // D3DMATRIXZ Validation
ValidateStructSize32(0x40, D3DMATRIXZ);
#pragma endregion

/*
// 0x4028F0
dllexport float vectorcall reduce_angle(float angle) asm_symbol_rel(0x4028F0);
dllexport float vectorcall reduce_angle(float angle) {
    int32_t counter = 0;
    while (angle > PI_f) {
        angle -= TWO_PI_f;
        if (counter++ > 32) break;
    }
    while (-PI_f > angle) {
        angle += TWO_PI_f;
        if (counter++ > 32) break;
    }
    return angle;
}

template <InlineState inline_state = DefaultInline>
static auto reduce_angle(float angle) {
    if constexpr (inline_state == ForceInline) {
        clang_forceinline return reduce_angle(angle);
    } else if constexpr (inline_state == NoInline) {
        clang_noinline return reduce_angle(angle);
    } else {
        return reduce_angle(angle);
    }
}

// 0x402890
// ZUN has always had this function... IDK why
dllexport float vectorcall reduce_angle_add(float angle, float value) asm_symbol_rel(0x402890);
dllexport float vectorcall reduce_angle_add(float angle, float value) {
    return reduce_angle(angle + value);
}
*/

// 0x404BC0
dllexport float& vectorcall reduce_angle_add_write(float& angle_ref, float& out, float value) asm_symbol_rel(0x404BC0);
dllexport float& vectorcall reduce_angle_add_write(float& angle_ref, float& out, float value) {
    return out = reduce_angle_add(angle_ref, value);
}
/*
// 0x404D10
dllexport float& vectorcall reduce_angle_add_assign_write(float& angle_ref, float value) asm_symbol_rel(0x404D10) {
    return angle_ref = reduce_angle_add_ref(angle_ref, value);
}
*/

inline float vectorcall __angle_diffB(float angle, float value, float temp) {
    if (temp > PI_f) {
        return angle - (value + TWO_PI_f);
    } else if (value - angle > PI_f) {
        return angle - (value - TWO_PI_f);
    } else {
        return temp;
    }
}

// 0x439FE0
dllexport float vectorcall reduced_angle_diff(float angle, float value) asm_symbol_rel(0x439FE0);
dllexport float vectorcall reduced_angle_diff(float angle, float value) {
    float temp = angle - value;
    if (temp > PI_f) {
        return angle - (value + TWO_PI_f);
    }
    else if (value - angle > PI_f) {
        return angle - (value - TWO_PI_f);
    }
    else {
        return temp;
    }
}


// 0x46F150
dllexport char* stdcall pbg_strdup(const char* str) asm_symbol_rel(0x46F150);
dllexport char* stdcall pbg_strdup(const char* str) {
    char* ret = (char*)malloc(byteloop_strlen(str));
    if (ret) {
        byteloop_strcpy(ret, str);
    }
    return ret;
}

/*
// 0x404C70
dllexport float& vectorcall reduce_angle_diff_write(float& angle_ref, float& out, float& value_ref) asm_symbol_rel(0x404C70) {
    return reduce_angle_write(out, reduced_angle_diff(angle_ref, value_ref));
}
*/

// size: 0x4
// Of course this exists...
struct ZUNAngle {
    float value; // 0x0

    inline constexpr ZUNAngle() {}

    // 0x404C20
    dllexport gnu_noinline vectorcall ZUNAngle(float value) asm_symbol_rel(0x404C20) {
        this->value = reduce_angle(value);
    }

    // 0x404D70
    dllexport ZUNAngle& vectorcall operator=(float value) asm_symbol_rel(0x404D70) {
        this->value = reduce_angle(value);
        return *this;
    }

    /*
    inline ZUNAngle& operator=(const ZUNAngle& value) {
        this->value = value.value;
        return *this;
    }
    */
    
    // 0x404DC0
    dllexport vectorcall operator float() const asm_symbol_rel(0x404DC0) {
        return this->value;
    }

    // 0x404BC0
    dllexport ZUNAngle vectorcall operator+(const float value) const asm_symbol_rel(0x404BC0) {
        return this->value + value;
    }

    // 0x45E2A0
    dllexport ZUNAngle thiscall operator+(const ZUNAngle& angle) const asm_symbol_rel(0x45E2A0) {
        return this->value + angle.value;
    }
    
    // 0x404D10
    dllexport gnu_noinline ZUNAngle& vectorcall operator+=(const float value) asm_symbol_rel(0x404D10) {
        clang_forceinline return *this = *this + value;
    }

    // th14: 0x443D60
    ZUNAngle& thiscall operator+=(const ZUNAngle& angle) {
        return *this = *this + angle;
    }

    inline ZUNAngle operator-(const float value) const {
        return this->value - value;
    }

    // 0x404C70
    dllexport ZUNAngle thiscall operator-(const ZUNAngle& angle) const asm_symbol_rel(0x404C70) {
        return reduced_angle_diff(this->value, angle.value);
    }
    
    /*
    inline ZUNAngle& diff(float value) const {
        ZUNAngle temp;
        temp.value = value;
        return *this - temp;
    }
    */

    inline ZUNAngle& operator-=(const float value) {
        return *this = *this - value;
    }

    // 0x461540
    dllexport gnu_noinline ZUNAngle& thiscall mul_write(ZUNAngle& out, float value) asm_symbol_rel(0x404BC0) {
        return out = reduce_angle(this->value * value);
    }

    inline ZUNAngle vectorcall operator*(const float& value) {
        ZUNAngle ret;
        clang_forceinline return this->mul_write(ret, value);
    }

    // th14: 0x443D00
    ZUNAngle vectorcall operator/(const float value) const {
        return this->value / value;
    }
};

struct DUMB_FUNCTIONS {
private:
    // 0x403BC0
    dllexport static gnu_noinline int32_t vectorcall __sub_403BC0(float* arg1, float* arg2, float, float, float arg3, float arg4, float, float, float arg5, float arg6, float arg7, float arg8) {
        float A = reduce_angle(arg5);
        float B = reduce_angle(arg8);
        float C = reduced_angle_diff(A, B);
        float D = reduce_angle(C);
        if (!(fabsf(D) < 0.001f)) {
            float E = reduce_angle(__angle_diffB(A, B, C));
            float F = reduce_angle(reduced_angle_diff(E, PI_f));
            if (!(fabsf(F) < 0.001f)) {
                Float2 G;
                G.make_from_vector(arg5, 10.0f);
                float H = G.x;
                float I;
                float J;
                float K = 0.0f;
                BOOL L;
                if (fabsf(H) < 0.01f) {
                    I = arg3;
                    J = 0.0f;
                    L = true;
                } else {
                    L = false;
                    J = G.y / H;
                    I = arg4 - J * arg3;
                }
                G.make_from_vector(arg8, 10.0f);
                H = G.x;
                float M;
                BOOL N;
                if (fabsf(H) < 0.01f) {
                    M = arg6;
                    N = true;
                } else {
                    N = false;
                    K = G.y / H;
                    M = arg7 - K * arg6;
                }
                float O;
                float P;
                if (!L) {
                    if (!N) {
                        O = M - I;
                        float Q = J - K;
                        P = O * J / Q + I;
                        O /= Q;
                    } else {
                        O = arg6;
                        P = J * arg6 + I;
                    }
                } else {
                    if (!N) {
                        P = K * arg3 + M;
                        O = arg3;
                    } else {
                        P = arg3;
                        if (fabsf(P - arg6) < 0.001f) {
                            return 0;
                        }
                        *arg2 = arg4;
                        *arg1 = P;
                        return 1;
                    }
                }
                *arg1 = O;
                *arg2 = P;
                return 1;
            }
        }
        *arg2 = arg4;
        *arg1 = arg3;
        return 0;
    }
public:
    forceinline static int32_t __sub_403BC0(float* arg1, float* arg2, float arg3, float arg4, float arg5, float arg6, float arg7, float arg8) {
        return __sub_403BC0(arg1, arg2, UNUSED_FLOAT, UNUSED_FLOAT, arg3, arg4, UNUSED_FLOAT, UNUSED_FLOAT, arg5, arg6, arg7, arg8);
    }
};

forceinline int32_t __sub_403BC0(float* arg1, float* arg2, float arg3, float arg4, float arg5, float arg6, float arg7, float arg8) {
    return DUMB_FUNCTIONS::__sub_403BC0(arg1, arg2, arg3, arg4, arg5, arg6, arg7, arg8);
}

enum CriticalSectionIndex {
    UpdateFuncRegistry_CS = 0,
    __unused_cs_1 = 1,
    FileIO_CS = 2,
    Logging_CS = 3,
    __unused_cs_2 = 4,
    Menu_CS = 5,
    __supervisor_thread_cs_1 = 6,
    __unused_cs_3 = 7,
    __unused_cs_4 = 8,
    AnmList_CS = 9,
    RNG_CS = 10,
    __unknown_cs_2 = 11,
    __unknown_cs_3 = 12,
    __unused_cs_5 = 13,
};

// size: 0x1D0
struct CriticalSectionManager {
    CRITICAL_SECTION sections[14]; // 0x0
    uint8_t section_depths[14]; // 0x1C0
    bool enable_sections; // 0x1CE

    // Pretty sure these aren't actually class methods, but whatever. Not the point.
    inline void initialize() {
        nounroll for (size_t i = 0; i < countof(this->sections); ++i) {
            InitializeCriticalSection(&this->sections[i]);
        }
        this->enable_sections = true;
    }

    // 0x404F60
    dllexport static inline void stdcall leave_section(CriticalSectionIndex index) asm_symbol_rel(0x404F60);
    
    // 0x404F90
    dllexport static inline void stdcall enter_section(CriticalSectionIndex index) asm_symbol_rel(0x404F90);

    static inline void leave_section_volatile(CriticalSectionIndex index);
    static inline void enter_section_volatile(CriticalSectionIndex index);
};
/*
#pragma region // CriticalSectionManager Validation
ValidateFieldOffset32(0x0, CriticalSectionManager, sections);
ValidateFieldOffset32(0x1C0, CriticalSectionManager, section_depths);
ValidateFieldOffset32(0x1CE, CriticalSectionManager, enable_sections);
ValidateStructSize32(0x1D0, CriticalSectionManager);
#pragma endregion
*/

extern "C" {
    // 0x521660
    extern CriticalSectionManager CRITICAL_SECTION_MANAGER asm("_CRITICAL_SECTION_MANAGER");
}

// 0x404F60
dllexport inline void stdcall CriticalSectionManager::leave_section(CriticalSectionIndex index) {
    if (CRITICAL_SECTION_MANAGER.enable_sections) {
        LeaveCriticalSection(&CRITICAL_SECTION_MANAGER.sections[index]);
        --CRITICAL_SECTION_MANAGER.section_depths[index];
    }
}
// 0x404F90
dllexport inline void stdcall CriticalSectionManager::enter_section(CriticalSectionIndex index) {
    if (CRITICAL_SECTION_MANAGER.enable_sections) {
        EnterCriticalSection(&CRITICAL_SECTION_MANAGER.sections[index]);
        ++CRITICAL_SECTION_MANAGER.section_depths[index];
    }
}
inline void CriticalSectionManager::leave_section_volatile(CriticalSectionIndex index) {
    if (*(volatile uint8_t*)&CRITICAL_SECTION_MANAGER.enable_sections) {
        LeaveCriticalSection(&CRITICAL_SECTION_MANAGER.sections[index]);
        --*(volatile uint8_t*)&CRITICAL_SECTION_MANAGER.section_depths[index];
    }
}
inline void CriticalSectionManager::enter_section_volatile(CriticalSectionIndex index) {
    if (*(volatile uint8_t*)&CRITICAL_SECTION_MANAGER.enable_sections) {
        EnterCriticalSection(&CRITICAL_SECTION_MANAGER.sections[index]);
        ++*(volatile uint8_t*)&CRITICAL_SECTION_MANAGER.section_depths[index];
    }
}

template<CriticalSectionIndex index>
struct ScopedCriticalSection {
    inline ScopedCriticalSection() {
        CRITICAL_SECTION_MANAGER.enter_section(index);
    }
    inline ~ScopedCriticalSection() {
        CRITICAL_SECTION_MANAGER.leave_section(index);
    }
};

static constexpr auto wkrwjher = sizeof(ScopedCriticalSection<UpdateFuncRegistry_CS>);

#define UniqueCriticalSectionLock(index) auto unique_name(critical_section_scope_guard_) = ScopedCriticalSection<index>()
#define CriticalSectionBlock(index) switch (UniqueCriticalSectionLock(index); 0) default:

// size: 0x4
struct DebugLogger {
    int __dword_0; // 0x0

    // 0x404E80
    dllexport static gnu_noinline void cdecl __debug_log_stub_4(const char* format, ...) asm_symbol_rel(0x404E80) {}

    // 0x404F50
    dllexport gnu_noinline int32_t thiscall __debug_log_stub_12(int32_t value, int, const char*) asm_symbol_rel(0x404F50) {
        return value;
    }

    // 0x43A280
    dllexport static gnu_noinline void cdecl __debug_log_stub_3(const char* format, ...) asm_symbol_rel(0x43A280) {}

    // 0x442440
    dllexport static gnu_noinline void cdecl __debug_log_stub_8(const char* format, ...) asm_symbol_rel(0x442440) {}

    // 0x4562A0
    dllexport static gnu_noinline void cdecl __debug_log_stub_7(const char* format, ...) asm_symbol_rel(0x4562A0) {}

    // 0x46F1D0
    dllexport static gnu_noinline void cdecl __debug_log_stub_2(const char* format, ...) asm_symbol_rel(0x46F1D0) {}

    // 0x471110
    dllexport static gnu_noinline void cdecl __debug_log_stub_11(const char* format, ...) asm_symbol_rel(0x471110) {}

    // 0x476310
    dllexport static gnu_noinline void cdecl __debug_log_stub_1(const char* format, ...) asm_symbol_rel(0x476310) {}

    // 0x477AF0
    dllexport static gnu_noinline void cdecl __debug_log_stub_10(const char* format, ...) asm_symbol_rel(0x477AF0) {}

    // 0x489590
    [[gnu::no_caller_saved_registers]] dllexport static gnu_noinline void cdecl __debug_log_stub_6(const char* format, ...) asm_symbol_rel(0x489590) {}

    // 0x48B010
    dllexport static gnu_noinline void cdecl __debug_log_stub_9(const char* format, ...) asm_symbol_rel(0x48B010) {}

    // 0x48B020
    dllexport static gnu_noinline void cdecl __debug_log_stub_5(const char* format, ...) asm_symbol_rel(0x48B020) {}
};

extern "C" {
    // 0x4CF290
    extern DebugLogger* DEBUG_LOG_PTR asm("_DEBUG_LOG_PTR");
}

namespace Pbg {

    // size: 0x4
    struct IFile {
        // Method 0
        virtual gnu_noinline bool thiscall open_file(LPCSTR path, const char* mode) = 0;
        // Method 4
        virtual gnu_noinline void thiscall close_file() = 0;
        // Method 8
        virtual gnu_noinline DWORD thiscall read_file_to_buffer(LPVOID buffer, DWORD size) = 0;
        // Method C
        virtual gnu_noinline bool thiscall write_buffer_to_file(LPVOID buffer, DWORD size) = 0;
        // Method 10
        virtual gnu_noinline DWORD thiscall get_file_pointer() = 0;
        // Method 14
        virtual gnu_noinline DWORD thiscall get_file_size() = 0;
        // Method 18
        virtual gnu_noinline bool thiscall set_file_pointer(LONG offset, DWORD origin) = 0;
        
        // 0x46F580
        virtual ~IFile() {}
    };

    // size: 0xC
    struct File : IFile {

        HANDLE handle; // 0x4
        ACCESS_MASK access_mask; // 0x8
        // 0xC

        inline File() : handle(INVALID_HANDLE_VALUE), access_mask(0) {}

        // 0x46F230
        // Method 0
        virtual gnu_noinline bool thiscall open_file(LPCSTR path_in, const char* mode_str) asm_symbol_rel(0x46F230) {
            BOOL is_append = false;
            DWORD create_type = 0;
            this->close_file();
            const char* read_mode = mode_str;
            for (
                char c;
                (c = *read_mode);
                ++read_mode
            ) {
                switch (c) {
                    case 'r':
                        this->access_mask = GENERIC_READ;
                        create_type = OPEN_EXISTING;
                        goto valid_mode;
                    case 'w':
                        this->access_mask = GENERIC_WRITE;
                        create_type = CREATE_ALWAYS;
                        goto valid_mode;
                    case 'a':
                        is_append = true;
                        this->access_mask = GENERIC_WRITE;
                        create_type = OPEN_ALWAYS;
                        goto valid_mode;
                }
            }
            return false;
        valid_mode:
            if (!*read_mode) {
                return false;
            }
            const char* path_no_drive = strchr(path_in, ':');
            char path_buffer[MAX_PATH];
            if (path_no_drive) {
                byteloop_strcpy(path_buffer, path_in);
            }
            else {
                GetModuleFileNameA(NULL, path_buffer, MAX_PATH);
                char* filename = strrchr(path_buffer, '\\');
                path_buffer[0] = filename ? '\0' : path_buffer[0];
                filename[1] = '\0';
                byteloop_strcat(path_buffer, path_in);
            }
            HANDLE file_handle = CreateFileA(
                path_buffer,
                this->access_mask,
                FILE_SHARE_READ,
                NULL,
                create_type,
                FILE_ATTRIBUTE_NORMAL | FILE_FLAG_SEQUENTIAL_SCAN,
                NULL
            );
            this->handle = file_handle;
            if (file_handle == INVALID_HANDLE_VALUE) {
                return false;
            }
            if (is_append) {
                SetFilePointer(file_handle, 0, NULL, FILE_END);
            }
            return true;
        }

        // 0x46F3E0
        // Method 4
        virtual gnu_noinline void thiscall close_file() asm_symbol_rel(0x46F3E0) {
            HANDLE file_handle = this->handle;
            if (file_handle != INVALID_HANDLE_VALUE) {
                CloseHandle(file_handle);
            }
            this->handle = INVALID_HANDLE_VALUE;
            this->access_mask = 0;
        }

        // 0x46F410
        // Method 8
        virtual gnu_noinline DWORD thiscall read_file_to_buffer(LPVOID buffer, DWORD size) asm_symbol_rel(0x46F410) {
            DWORD read_size = 0;
            if (this->access_mask != GENERIC_READ) {
                return 0;
            }
            ReadFile(this->handle, buffer, size, &read_size, NULL);
            return read_size;
        }

        // 0x46F450
        // Method C
        virtual gnu_noinline bool thiscall write_buffer_to_file(LPVOID buffer, DWORD size) asm_symbol_rel(0x46F450) {
            DWORD read_size = 0;
            if (this->access_mask != GENERIC_WRITE) {
                return false;
            }
            WriteFile(this->handle, buffer, size, &read_size, NULL);
            return size == read_size;
        }

        // 0x46F490
        // Method 10
        virtual gnu_noinline DWORD thiscall get_file_pointer() asm_symbol_rel(0x46F490) {
            HANDLE file_handle = this->handle;
            if (file_handle == INVALID_HANDLE_VALUE) {
                return 0;
            }
            return SetFilePointer(file_handle, 0, NULL, FILE_CURRENT);
        }

        // 0x46F4B0
        // Method 14
        virtual gnu_noinline DWORD thiscall get_file_size() asm_symbol_rel(0x46F4B0) {
            HANDLE file_handle = this->handle;
            if (file_handle == INVALID_HANDLE_VALUE) {
                return 0;
            }
            return GetFileSize(file_handle, NULL);
        }

        // 0x46F4D0
        // Method 18
        virtual gnu_noinline bool thiscall set_file_pointer(LONG offset, DWORD origin) asm_symbol_rel(0x46F4D0) {
            HANDLE file_handle = this->handle;
            if (file_handle == INVALID_HANDLE_VALUE) {
                return false;
            }
            SetFilePointer(file_handle, offset, NULL, origin);
            return true;
        }

        // 0x46F1E0
        // Method 1C
        virtual ~File() {
            HANDLE file_handle = this->handle;
            if (file_handle != INVALID_HANDLE_VALUE) {
                CloseHandle(file_handle);
                this->handle = INVALID_HANDLE_VALUE;
                this->access_mask = 0;
            }
        }

        // 0x46F500
        // Method 20
        virtual gnu_noinline LPVOID copy_file_to_new_buffer(LONG file_offset) asm_symbol_rel(0x46F500) {
            if (this->access_mask == GENERIC_READ) {
                DWORD file_size = this->get_file_size();
                if ((DWORD)file_offset <= file_size) {
                    if (LPVOID buffer = malloc(file_size)) {
                        file_offset = this->get_file_pointer();
                        if (this->set_file_pointer(file_offset, FILE_BEGIN)) {
                            if (!this->read_file_to_buffer(buffer, file_size)) {
                                // Yes, this free is misplaced and can leak memory
                                free(buffer);
                            } else {
                                this->set_file_pointer(file_offset, FILE_BEGIN);
                                return buffer;
                            }
                        }
                    }
                }
            }
            return NULL;
        }
    };

};

// size: 0x10(?)
struct ArcFileInner {
    char* __string_0; // 0x0
    int __dword_4; // 0x4
    int32_t file_size; // 0x8
    int __dword_C; // 0xC
    // 0x10

    // 0x46F1C0
    ArcFileInner() : __string_0(NULL) {}

    // 0x46F1A0
    ~ArcFileInner() {
        SAFE_FREE(this->__string_0);
    }
};

// size: 0xC
struct UnknownP {
    uint8_t xor_mask; // 0x0
    uint8_t xor_accel; // 0x1
    uint8_t __ubyte_2; // 0x2
    probably_padding_bytes(0x1); // 0x3
    int32_t __int_4; // 0x4
    int32_t __int_8; // 0x8
    // 0xC
};

/*
extern "C" {
    // 0x4C5360
    extern UnknownP UNKNOWN_P[] asm("_UNKNOWN_P");
}
*/

// 0x4C5360
static UnknownP UNKNOWN_P[] = {
    [0] = {
        .xor_mask = 0x1B,
        .xor_accel = 0x73,
        .__ubyte_2 = 0xAA,
        .__int_4 = 256,
        .__int_8 = 0x3800
    },
    [1] = {
        .xor_mask = 0x12,
        .xor_accel = 0x43,
        .__ubyte_2 = 0xFF,
        .__int_4 = 512,
        .__int_8 = 0x3E00
    },
    [2] = {
        .xor_mask = 0x35,
        .xor_accel = 0x79,
        .__ubyte_2 = 0x11,
        .__int_4 = 1024,
        .__int_8 = 0x3C00
    },
    [3] = {
        .xor_mask = 0x03,
        .xor_accel = 0x91,
        .__ubyte_2 = 0xDD,
        .__int_4 = 128,
        .__int_8 = 0x6400
    },
    [4] = {
        .xor_mask = 0xAB,
        .xor_accel = 0xDC,
        .__ubyte_2 = 0xEE,
        .__int_4 = 128,
        .__int_8 = 0x7000
    },
    [5] = {
        .xor_mask = 0x51,
        .xor_accel = 0x9E,
        .__ubyte_2 = 0xBB,
        .__int_4 = 256,
        .__int_8 = 0x4000
    },
    [6] = {
        .xor_mask = 0xC1,
        .xor_accel = 0x15,
        .__ubyte_2 = 0xCC,
        .__int_4 = 1024,
        .__int_8 = 0x2C00
    },
    [7] = {
        .xor_mask = 0x99,
        .xor_accel = 0x7D,
        .__ubyte_2 = 0x77,
        .__int_4 = 128,
        .__int_8 = 0x4400
    }
};

// 0x401F50
dllexport gnu_noinline void* fastcall __crypt_buffer(void* buffer, int32_t buffer_size, uint8_t xor_mask, uint8_t xor_accel, int32_t arg3, int32_t arg4) asm_symbol_rel(0x401F50);
dllexport gnu_noinline void* fastcall __crypt_buffer(void* buffer, int32_t buffer_size, uint8_t xor_mask, uint8_t xor_accel, int32_t arg3, int32_t arg4) {
    use_var(buffer);
    use_var(buffer_size);
    use_var(xor_mask);
    use_var(xor_accel);
    use_var(arg3);
    use_var(arg4);
    return (void*)rand();
}

// 0x401E40
dllexport gnu_noinline void* fastcall __decrypt_buffer(void* buffer, int32_t buffer_size, uint8_t xor_mask, uint8_t xor_accel, int32_t arg3, int32_t arg4) asm_symbol_rel(0x401E40);
dllexport gnu_noinline void* fastcall __decrypt_buffer(void* buffer, int32_t buffer_size, uint8_t xor_mask, uint8_t xor_accel, int32_t arg3, int32_t arg4) {
    int32_t intA = buffer_size % arg3; // EBX
    uint8_t* input_buffer = (uint8_t*)buffer; // ESI
    uint8_t* buffer_write_offset = input_buffer; // EBP-4
    int32_t intB = arg3 / 4; // EBP-C
    // Definitely not a min func since those use <
    int32_t temp_size = arg4 > buffer_size ? buffer_size : arg4; // EBP-10
    void* temp_buffer = malloc(temp_size);
    input_buffer = (uint8_t*)temp_buffer;
    if (temp_buffer) {
        buffer_size = (buffer_size & ~1) - (intA >= intB ? 0 : intA);
        memcpy(temp_buffer, buffer, temp_size);
        while (buffer_size > 0) {
            if (arg4 <= 0) {
                break;
            }
            arg3 = buffer_size >= arg3 ? arg3 : buffer_size;
            buffer_write_offset += arg3;
            uint8_t* buffer_write = buffer_write_offset - 1;
            for (
                int32_t i = (arg3 + 1) / 2;
                i > 0;

            ) {
                uint8_t val = *input_buffer;
                buffer_write -= 2;
                val ^= xor_mask;
                --i;
                xor_mask += xor_accel;
                buffer_write[2] = val;
                ++input_buffer;
            }
            buffer_write = buffer_write_offset - 2;
            for (
                int32_t i = arg3 / 2;
                i > 0;

            ) {
                uint8_t val = *input_buffer;
                buffer_write -= 2;
                val ^= xor_mask;
                --i;
                xor_mask += xor_accel;
                buffer_write[2] = val;
                ++input_buffer;
            }
            buffer_size -= arg3;
            arg4 -= arg3;
        }
        free(temp_buffer);
    }
    return buffer;
}

extern "C" {
    // 0x51F660
    extern uint8_t DECOMPRESS_BUFFER[0x2000] asm("_DECOMPRESS_BUFFER");
}

// 0x46F5B0
dllexport gnu_noinline void* fastcall __compress_buffer(void* buffer_in, int32_t buffer_size, int32_t* out_buffer_size) asm_symbol_rel(0x46F5B0);
dllexport gnu_noinline void* fastcall __compress_buffer(void* buffer_in, int32_t buffer_size, int32_t* out_buffer_size) {
    use_var(buffer_in);
    use_var(buffer_size);
    *out_buffer_size = rand();
    return (void*)rand();
}

// 0x46F840
// This function looks like handwritten assembly. Compilers don't emit shift instructions that modify flags like this, right?
dllexport gnu_noinline void* fastcall __decompress_buffer(void* buffer_in, int32_t buffer_size, void* out_buffer, int32_t out_buffer_size) asm_symbol_rel(0x46F840);
dllexport gnu_noinline void* fastcall __decompress_buffer(void* buffer_in, int32_t buffer_size, void* out_buffer, int32_t out_buffer_size) {
    codegen_barrier();
    uint32_t uintA = 0; // EBP-8
    uint8_t* buffer = (uint8_t*)buffer_in;
    uint8_t byteA = 0x80;
    if (!out_buffer) {
        if (!(out_buffer = malloc(out_buffer_size))) {
            return NULL;
        }
        uintA = 0; // EBP-8
    }
    uint8_t* buffer_read = buffer; // EBP-1C
    uint8_t* out_buffer_write = (uint8_t*)out_buffer; // EBP-10
    uint32_t decompress_buffer_offset = 1; // EBP-14
    uint32_t uintC = 0x80; // EBP-20
    ptrdiff_t sizeA;

    auto common_loop = [&](uint32_t arg) {
        int32_t ret = 0;
        nounroll do {
            if (byteA == 0x80) {
                uintA = *buffer_read;
                if (sizeA >= buffer_size) {
                    uintA = 0;
                } else {
                    ++buffer_read;
                    ++sizeA;
                }
            }
            // The argument order gets flipped here without the cast
            if ((uint8_t)uintA & byteA) {
                codegen_barrier();
                ret |= arg;
            }
            if (!(byteA >>= 1)) {
                byteA = uintC;
            }
        } while (arg >>= 1);
        return ret;
    };

    for (;;) {
        uint8_t byteB = byteA >> 1; // EBP+F
        codegen_barrier();
        codegen_volatile uint8_t byteC = byteA; // EBP+1
        uint32_t uintB; // this was optimized out, see below
        if (byteA == 0x80) {
            uintA = *buffer_read;
            sizeA = buffer_read - buffer;
            byteA = byteB;
            if (sizeA >= buffer_size) {
                uintA = 0;
                uintB = 0;
                // the compiler figured out that the uintB != 0 branch
                // around loop A is impossible from here and skipped it
            }
            else {
                uintB = byteC;
                ++buffer_read;
                uintB &= uintA;
            }
        }
        else {
            uintB = byteA;
            byteA = byteB;
            uintB &= uintA;
            if (!byteA) {
                byteA = 0x80;
            }
        }
        sizeA = buffer_read - buffer;
        if (uintB) {
            // loop A
            uint32_t val = common_loop(0b10000000); // 0x80
            DECOMPRESS_BUFFER[decompress_buffer_offset++] = val;
            *out_buffer_write++ = val;
            decompress_buffer_offset %= countof(DECOMPRESS_BUFFER);
        }
        else {
            // loop B
            int32_t intD = common_loop(0b1000000000000); // 0x1000
            if (!intD) {
                return out_buffer;
            }
            sizeA = buffer_read - buffer;
            // loop C
            int32_t iters = common_loop(0b1000) + 2; // 0x8
            // loop D
            for (int32_t i = 0; i <= iters; ++i) {
                uint8_t val = DECOMPRESS_BUFFER[(intD + i) % countof(DECOMPRESS_BUFFER)];
                DECOMPRESS_BUFFER[decompress_buffer_offset++] = val;
                *out_buffer_write++ = val;
                decompress_buffer_offset %= countof(DECOMPRESS_BUFFER);
            }
        }
    }
}

// size: 0x10
struct ArcFile {
    ArcFileInner* __pointer_0; // 0x0
    int32_t __int_4; // 0x4
    char* __string_8; // 0x8
    Pbg::File* file; // 0xC
    // 0x10

    // 0x46EC50
    ~ArcFile() {
        if (char* str = this->__string_8) {
            DebugLogger::__debug_log_stub_2("info : %s close arcfile\r\n", str);
            free(this->__string_8);
        }
        this->__string_8 = NULL;
        SAFE_DELETE_ARRAY(this->__pointer_0);
        SAFE_DELETE(this->file);
        this->__int_4 = 0;
    }

    // 0x46EB80
    dllexport static gnu_noinline bool stdcall __sub_46EB80(int32_t = UNUSED_DWORD) asm_symbol_rel(0x46EB80);

    // 0x46EE90
    dllexport static gnu_noinline bool stdcall __sub_46EE90(int32_t = UNUSED_DWORD) asm_symbol_rel(0x46EE90);

    // 0x46ED10
    dllexport gnu_noinline void* thiscall __sub_46ED10(const char* filename, void* file_buffer) asm_symbol_rel(0x46ED10) {
        if (!this->file) {
            return NULL;
        }
        ArcFileInner* ptrA = this->__pointer_0;
        if (ptrA) {
            for (int32_t i = this->__int_4; i > 0; --i, ++ptrA) {
                if (!stricmp(filename, ptrA->__string_0)) {
                    goto found_in_cache;
                }
            }
        }
        DebugLogger::__debug_log_stub_2("info : %s error\r\n", this->__string_8);
        return NULL;
found_in_cache:
        int32_t new_file_size = (intptr_t)(ptrA + 1)->__string_0 - ptrA->__dword_4;
        size_t cached_file_size = ptrA->file_size;
        void* cached_file_buffer;
        if (new_file_size == cached_file_size && file_buffer) {
            cached_file_buffer = file_buffer;
        } else {
            cached_file_buffer = malloc(new_file_size);
        }
        if (!cached_file_buffer) {
            goto error_free;
        }
        if (!this->file->set_file_pointer(this->__int_4, FILE_BEGIN)) {
            goto error_free;
        }
        if (!this->file->read_file_to_buffer(cached_file_buffer, new_file_size)) {
            goto error_free;
        }
        const char* strA = ptrA->__string_0;
        uint8_t string_sum = 0;
        for (
            size_t string_length = byteloop_strlen(strA);
            string_length;
            --string_length
        ) {
            string_sum += *strA++;
        }
        UnknownP& xor_data = UNKNOWN_P[string_sum % countof(UNKNOWN_P)];
        __decrypt_buffer(cached_file_buffer, new_file_size, xor_data.xor_mask, xor_data.xor_accel, xor_data.__int_4, xor_data.__int_8);
        void* ret;
        if (cached_file_size != new_file_size) {
            ret = __decompress_buffer(cached_file_buffer, new_file_size, file_buffer, cached_file_size);
        } else {
            ret = cached_file_buffer;
        }
        if (ret != file_buffer && file_buffer) {
            free(file_buffer);
        }
        return ret;
error_free:
        DebugLogger::__debug_log_stub_2("info : %s error\r\n", this->__string_8);
        if (cached_file_buffer) {
            free(cached_file_buffer);
        }
        return NULL;
    }
};
extern "C" {
    // 0x5217C0
    extern ArcFile THDAT_ARCFILE asm("_THDAT_ARCFILE");
}

// size: 0x10
struct DatFileHeader {
    ZUNMagic magic; // 0x0
    uint32_t decompressed_size; // 0x4
    uint32_t compressed_size; // 0x8
    int __dword_C; // 0xC
    // 0x10
};
#pragma region // DatFileHeader Validation
ValidateFieldOffset32(0x0, DatFileHeader, magic);
ValidateFieldOffset32(0x4, DatFileHeader, decompressed_size);
ValidateFieldOffset32(0x8, DatFileHeader, compressed_size);
ValidateFieldOffset32(0xC, DatFileHeader, __dword_C);
ValidateStructSize32(0x10, DatFileHeader);
#pragma endregion

// 0x46EE90
dllexport gnu_noinline bool stdcall ArcFile::__sub_46EE90(int32_t) {
    if (Pbg::File* pbg_file = THDAT_ARCFILE.file) {
        if (pbg_file->open_file("th18.dat", "r")) {
            DatFileHeader dat_header;
            if (THDAT_ARCFILE.file->read_file_to_buffer(&dat_header, sizeof(DatFileHeader))) {
                __decrypt_buffer(&dat_header, sizeof(DatFileHeader), 0x1B, 0x37, 0x10, 0x10);
                if (dat_header.magic.as_uint == PackUInt('T', 'H', 'A', '1')) {
                    uint32_t uintA = dat_header.__dword_C + 0xF7E7F8AC; // IDK what this value is
                    dat_header.decompressed_size -= 123456789;
                    dat_header.compressed_size -= 987654321;
                    THDAT_ARCFILE.__int_4 = uintA;
                    int32_t data_offset = THDAT_ARCFILE.file->get_file_size() - dat_header.compressed_size;
                    THDAT_ARCFILE.file->set_file_pointer(data_offset, FILE_BEGIN);
                    size_t compressed_size = dat_header.compressed_size;
                    if (void* compressed_buffer = malloc(compressed_size)) {
                        void* buffer = NULL;
                        if (THDAT_ARCFILE.file->read_file_to_buffer(compressed_buffer, compressed_size)) {
                            __decrypt_buffer(compressed_buffer, compressed_size, 0x3E, 0x9B, 0x80, compressed_size);
                            buffer = __decompress_buffer(compressed_buffer, compressed_size, buffer, dat_header.decompressed_size);
                            if (buffer) {
                                int32_t intA = THDAT_ARCFILE.__int_4;
                                ArcFileInner* arcfile_inner_array = new ArcFileInner[intA + 1];
                                if (!arcfile_inner_array) {
                                    THDAT_ARCFILE.__pointer_0 = NULL;
                                    free(compressed_buffer);
                                    goto free_buffer;
                                }
                                char* buffer_read = (char*)buffer;
                                ArcFileInner* arcfile_inner_array_write = arcfile_inner_array;
                                for (int32_t i = intA; i > 0; --i) {
                                    arcfile_inner_array_write->__string_0 = pbg_strdup(buffer_read);
                                    int32_t length = byteloop_strlen(buffer_read) + 1;
                                    if (int32_t temp = length % 4) {
                                        length += 4 - temp;
                                    }
                                    buffer_read += length;
                                    arcfile_inner_array_write->__dword_4 = ((uint32_t*)buffer_read)[0];
                                    arcfile_inner_array_write->file_size = ((uint32_t*)buffer_read)[1];
                                    arcfile_inner_array_write->__dword_C = ((uint32_t*)buffer_read)[2];
                                    buffer_read += sizeof(uint32_t[3]);
                                    ++arcfile_inner_array_write;
                                }
                                arcfile_inner_array[intA].__dword_4 = data_offset;
                                arcfile_inner_array[intA].file_size = 0;
                                THDAT_ARCFILE.__pointer_0 = arcfile_inner_array;
                                free(compressed_buffer);
                                free(buffer);
                                return true;
                            }
                        }
                        free(compressed_buffer);
                        if (buffer) {
free_buffer:
                            free(buffer);
                        }
                    }
                }
            }
        }
        SAFE_DELETE(THDAT_ARCFILE.file);
    }
    return false;
}

// 0x46EB80
dllexport gnu_noinline bool stdcall ArcFile::__sub_46EB80(int32_t) {
    THDAT_ARCFILE.~ArcFile();
    char current_directory[512];
    GetCurrentDirectoryA(countof(current_directory), current_directory);
    DebugLogger::__debug_log_stub_2("info : CurrentDirectory %s \r\n", current_directory);
    Pbg::File* pbg_file = new Pbg::File();
    THDAT_ARCFILE.file = pbg_file;
    if (ArcFile::__sub_46EE90()) {
        char* str;
        clang_noinline str = pbg_strdup("th18.dat");
        THDAT_ARCFILE.__string_8 = str;
        if (str) {
            THDAT_ARCFILE.file->open_file(str, "r");
            return true;
        }
    }
    THDAT_ARCFILE.~ArcFile();
    return false;
}

// size: 0x10
struct ArcFileEx : ArcFile {
    // 0x46EB50
    dllexport gnu_noinline ArcFileEx() {
        this->__pointer_0 = NULL;
        this->__int_4 = 0;
        this->__string_8 = NULL;
        this->file = NULL;
    }

    // 0x46EB70
    dllexport gnu_noinline ~ArcFileEx() asm_symbol_rel(0x46EB70) {}
};

extern "C" {
    // 0x568AF0
    extern ArcFileEx ARCFILE_ARRAY[20] asm("_ARCFILE_ARRAY");
}

// 0x402060
dllexport gnu_noinline void* fastcall read_file_to_buffer(const char* path, int32_t* file_size_out, bool is_not_in_dat) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    DWORD file_size;
    void* ret = NULL;
    if (!is_not_in_dat) {
        const char* filename = strrchr(path, '\\');
        filename = strrchr(filename ? ++filename : path, '/');
        filename = filename ? ++filename : path;
        if (ArcFileInner* ptrA = THDAT_ARCFILE.__pointer_0) {
            for (int32_t i = THDAT_ARCFILE.__int_4; i > 0; --i, ++ptrA) {
                if (!stricmp(filename, ptrA->__string_0)) {
                    file_size = ptrA->file_size;
                    goto decode_file;
                }
            }
        }
        file_size = 0;
decode_file:
        if (file_size_out) {
            *file_size_out = file_size;
        }
        if (file_size) {
            DebugLogger::__debug_log_stub_4("%s Decode ... \r\n", filename);
            if ((ret = malloc(file_size))) {
                THDAT_ARCFILE.__sub_46ED10(filename, ret);
            }
        }
    } else {
        DebugLogger::__debug_log_stub_4("%s Load ... \r\n", path);
        HANDLE file_handle = CreateFileA(
            path,
            GENERIC_READ,
            FILE_SHARE_READ,
            NULL,
            OPEN_EXISTING,
            FILE_ATTRIBUTE_NORMAL | FILE_FLAG_SEQUENTIAL_SCAN,
            NULL
        );
        if (file_handle == INVALID_HANDLE_VALUE) {
            DebugLogger::__debug_log_stub_4("error : %s is not found.\r\n", path);
        }
        else {
            file_size = GetFileSize(file_handle, NULL);
            if (!(ret = malloc(file_size))) {
                DebugLogger::__debug_log_stub_4("error : %s allocation error.\r\n", path);
            }
            else {
                ReadFile(file_handle, ret, file_size, &file_size, NULL);
                if (file_size_out) {
                    *file_size_out = file_size;
                }
            }
            CloseHandle(file_handle);
        }
    }
    CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
    return ret;
}

extern "C" {
    // 0x570EA0
    extern char PATH_BUFFER[MAX_PATH] asm("_PATH_BUFFER");
}
inline void* read_file_from_dat(const char* path) {
    PATH_BUFFER[0] = '\0';
    byteloop_strcat(PATH_BUFFER, path);
    return read_file_to_buffer(PATH_BUFFER, NULL, false);
}

// 0x402220
dllexport gnu_noinline BOOL fastcall zun_file_exists(const char* filename) asm_symbol_rel(0x402220);
dllexport gnu_noinline BOOL fastcall zun_file_exists(const char* filename) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    HANDLE file_handle = CreateFileA(
        filename, // lpFileName
        GENERIC_READ, // dwDesiredAccess
        FILE_SHARE_READ, // dwShareMode
        NULL, // lpSecurityFeatures
        OPEN_EXISTING, // dwCreationDisposition
        FILE_ATTRIBUTE_NORMAL | FILE_FLAG_SEQUENTIAL_SCAN, // dwFlagsAndAttributes
        NULL // hTemplateFile
    );
    if (file_handle != INVALID_HANDLE_VALUE) {
        CloseHandle(file_handle);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return TRUE;
    }
    else {
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return FALSE;
    }
}
// 0x4022A0
dllexport gnu_noinline ZunResult fastcall __zun_create_new_file_from_buffer(const char* filename, void* buffer, size_t buffer_size) asm_symbol_rel(0x4022A0);
dllexport gnu_noinline ZunResult fastcall __zun_create_new_file_from_buffer(const char* filename, void* buffer, size_t buffer_size) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    HANDLE file_handle = CreateFileA(
        filename, // lpFileName
        GENERIC_WRITE, // dwDesiredAccess
        FILE_SHARE_READ, // dwShareMode
        NULL, // lpSecurityFeatures
        CREATE_ALWAYS, // dwCreationDisposition
        FILE_ATTRIBUTE_NORMAL, // dwFlagsAndAttributes
        NULL // hTemplateFile
    );
    if (file_handle == INVALID_HANDLE_VALUE) {
        FormatMessageA(
            FORMAT_MESSAGE_ALLOCATE_BUFFER | FORMAT_MESSAGE_IGNORE_INSERTS | FORMAT_MESSAGE_FROM_SYSTEM, // dwFlags
            NULL, // lpSource
            GetLastError(), // dwMessageId,
            LANG_USER_DEFAULT, // dwLanguageId,
            (LPSTR)&buffer_size, // lpBuffer
            0, // nSize
            NULL // Arguments
        );
        DebugLogger::__debug_log_stub_4("error : %s write error %s\r\n", filename, (char*)buffer_size);
        LocalFree((HLOCAL)buffer_size);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR;
    }
    DWORD bytes_written;
    WriteFile(
        file_handle, // hFile
        buffer, // lpBuffer
        buffer_size, // nNumberOfBytesToWrite
        &bytes_written, // lpNumberOfBytesWritten
        NULL // lpOverlapped
    );
    if (buffer_size != bytes_written) {
        CloseHandle(file_handle);
        DebugLogger::__debug_log_stub_4("error : %s write error\r\n", filename);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR2;
    }
    CloseHandle(file_handle);
    DebugLogger::__debug_log_stub_4("%s write ... \r\n", filename);
    CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
    return ZUN_SUCCESS;
}

extern "C" {
    // 0x4CA96C
    extern HANDLE STATIC_FILE_HANDLE asm("_STATIC_FILE_HANDLE");
}

inline ZunResult __zun_open_file(const char* filename) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    HANDLE file_handle = CreateFileA(
        filename, // lpFileName
        GENERIC_READ, // dwDesiredAccess
        FILE_SHARE_READ, // dwShareMode
        NULL, // lpSecurityFeatures
        OPEN_EXISTING, // dwCreationDisposition
        FILE_ATTRIBUTE_NORMAL | FILE_FLAG_SEQUENTIAL_SCAN, // dwFlagsAndAttributes
        NULL // hTemplateFile
    );
    STATIC_FILE_HANDLE = file_handle;
    if (file_handle == INVALID_HANDLE_VALUE) {
        char* message;
        FormatMessageA(
            FORMAT_MESSAGE_ALLOCATE_BUFFER | FORMAT_MESSAGE_IGNORE_INSERTS | FORMAT_MESSAGE_FROM_SYSTEM, // dwFlags
            NULL, // lpSource
            GetLastError(), // dwMessageId,
            LANG_USER_DEFAULT, // dwLanguageId,
            (LPSTR)&message, // lpBuffer
            0, // nSize
            NULL // Arguments
        );
        DebugLogger::__debug_log_stub_4("error : %s write error %s\r\n", filename, message);
        LocalFree((HLOCAL)message);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR;
    }
    DebugLogger::__debug_log_stub_4("%s open ...\r\n", filename);
    return ZUN_SUCCESS;
}

// 0x4023E0
dllexport gnu_noinline ZunResult fastcall __zun_open_new_file(const char* filename) asm_symbol_rel(0x4023E0);
dllexport gnu_noinline ZunResult fastcall __zun_open_new_file(const char* filename) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    HANDLE file_handle = CreateFileA(
        filename, // lpFileName
        GENERIC_WRITE, // dwDesiredAccess
        FILE_SHARE_READ, // dwShareMode
        NULL, // lpSecurityFeatures
        CREATE_ALWAYS, // dwCreationDisposition
        FILE_ATTRIBUTE_NORMAL, // dwFlagsAndAttributes
        NULL // hTemplateFile
    );
    STATIC_FILE_HANDLE = file_handle;
    if (file_handle == INVALID_HANDLE_VALUE) {
        char* message;
        FormatMessageA(
            FORMAT_MESSAGE_ALLOCATE_BUFFER | FORMAT_MESSAGE_IGNORE_INSERTS | FORMAT_MESSAGE_FROM_SYSTEM, // dwFlags
            NULL, // lpSource
            GetLastError(), // dwMessageId,
            LANG_USER_DEFAULT, // dwLanguageId,
            (LPSTR)&message, // lpBuffer
            0, // nSize
            NULL // Arguments
        );
        DebugLogger::__debug_log_stub_4("error : %s write error %s\r\n", filename, message);
        LocalFree((HLOCAL)message);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR;
    }
    DebugLogger::__debug_log_stub_4("%s open ...\r\n", filename);
    return ZUN_SUCCESS;
}

// 0x4024A0
dllexport gnu_noinline void* fastcall __zun_read_file(size_t bytes) asm_symbol_rel(0x4024A0);
dllexport gnu_noinline void* fastcall __zun_read_file(size_t bytes) {
    if (STATIC_FILE_HANDLE == INVALID_HANDLE_VALUE) {
        return NULL;
    }
    void* buffer = malloc(bytes);
    if (!buffer) {
        CloseHandle(STATIC_FILE_HANDLE);
        return NULL;
    }
    DWORD idgaf;
    ReadFile(
        STATIC_FILE_HANDLE, // hFile
        buffer, // lpBuffer
        bytes, // nNumberOfBytesToRead
        &idgaf, // lpNumberOfBytesRead
        NULL // lpOverlapped
    );
    return buffer;
}

inline ZunResult fastcall __zun_write_file(void* buffer, size_t bytes) {
    if (STATIC_FILE_HANDLE == INVALID_HANDLE_VALUE) {
        return ZUN_ERROR;
    }
    DWORD written;
    WriteFile(
        STATIC_FILE_HANDLE, // hFile
        buffer, // lpBuffer
        bytes, // nNumberOfBytesToRead
        &written, // lpNumberOfBytesRead
        NULL // lpOverlapped
    );
    if (bytes != written) {
        CloseHandle(STATIC_FILE_HANDLE);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR2;
    }
    return ZUN_SUCCESS;
}

// 0x402500
dllexport gnu_noinline ZunResult fastcall __zun_close_file() asm_symbol_rel(0x402500);
dllexport gnu_noinline ZunResult fastcall __zun_close_file() {
    HANDLE file_handle = STATIC_FILE_HANDLE;
    if (file_handle != INVALID_HANDLE_VALUE) {
        CloseHandle(file_handle);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
    }
    return ZUN_SUCCESS;
}

// size: 0x2008
template <size_t buffer_size>
struct LogBuffer {
    char buffer[buffer_size]; // 0x0
    char* buffer_write; // 0x2000
    bool is_error; // 0x2004

    LogBuffer() {
        this->buffer_write = this->buffer;
    }

    // 0x402530
    dllexport gnu_noinline const char* cdecl write(const char* format, ...) asm_symbol_rel(0x402530) {
        char stupid_stack_buffer[buffer_size];

        CRITICAL_SECTION_MANAGER.enter_section(Logging_CS);
        {
            va_list va;
            va_start(va, format);
            vsprintf(stupid_stack_buffer, format, va_use(va));
            size_t written_length = byteloop_strlen(stupid_stack_buffer);
            char* buffer_write = this->buffer_write;
            if (&buffer_write[written_length] < array_end_addr(this->buffer)) {
                byteloop_strcpy(buffer_write, stupid_stack_buffer);
                this->buffer_write += written_length;
                *this->buffer_write = '\0';
            }
        }
        CRITICAL_SECTION_MANAGER.leave_section(Logging_CS);
        return format;
    }

    // 0x402600
    dllexport gnu_noinline const char* cdecl write_error(const char* format, ...) asm_symbol_rel(0x402600) {
        char stupid_stack_buffer[0x200];

        CRITICAL_SECTION_MANAGER.enter_section(Logging_CS);
        {
            va_list va;
            va_start(va, format);
            vsprintf(stupid_stack_buffer, format, va_use(va));
            size_t written_length = byteloop_strlen(stupid_stack_buffer);
            char* buffer_write = this->buffer_write;
            if (&buffer_write[written_length] < array_end_addr(this->buffer)) {
                byteloop_strcpy(buffer_write, stupid_stack_buffer);
                this->buffer_write += written_length;
                *this->buffer_write = '\0';
            }
            this->is_error = true;
        }
        CRITICAL_SECTION_MANAGER.leave_section(Logging_CS);
        return format;
    }
};
extern "C" {
    // 0x4CABE8
    extern LogBuffer<0x2000> LOG_BUFFER asm("_LOG_BUFFER");
}

enum UpdateFuncRet : int32_t {
    UpdateFuncDeleteCurrentThenNext = 0,
    UpdateFuncNext = 1,
    UpdateFuncRepeatCurrent = 2,
    UpdateFuncEnd1 = 3,
    UpdateFuncEnd0 = 4,
    UpdateFuncEndN1 = 5,
    UpdateFuncRestartTick = 6,
    UpdateFuncCleanupThenNext = 7,
    UpdateFuncEnd0Dupe = 8,
};

typedef UpdateFuncRet(fastcall UpdateFunction)(void*);

// size: 0x28
struct UpdateFunc {
    int32_t priority; // 0x0
    union {
        uint32_t flags; // 0x4
        struct {
            uint32_t initialized : 1; // 1
            uint32_t run_on_update : 1; // 2
        };
    };
    UpdateFunction* on_update_func; // 0x8
    UpdateFunction* on_init_func; // 0xC
    UpdateFunction* on_cleanup_func; // 0x10
    ZUNLinkedList<UpdateFunc> list_node; // 0x14
    void* func_arg; // 0x24
    // 0x28

    // 0x401530
    UpdateFunc(UpdateFunction* tick_func) : initialized(false), on_update_func(NULL), on_init_func(NULL), on_cleanup_func(NULL) {
        this->priority = 0;
        this->list_node.initialize_with(this);
        this->initialized = true;
        this->on_update_func = tick_func;
        this->on_init_func = NULL;
        this->on_cleanup_func = NULL;
    }

    inline UpdateFunc(UpdateFunction* tick_func, bool run_on_update, void* arg) : initialized(false), on_update_func(NULL), on_init_func(NULL), on_cleanup_func(NULL) {
        this->priority = 0;
        this->list_node.initialize_with(this);
        this->initialized = true;
        this->run_on_update = run_on_update;
        this->on_update_func = tick_func;
        this->on_init_func = NULL;
        this->on_cleanup_func = NULL;
        this->func_arg = arg;
    }

#define declare_on_func(func_name, func_field, ...) \
    inline int32_t func_name() { \
        if (auto* func = this->func_field) { \
            return func(this->func_arg); \
        } else return 0; \
    }

    declare_on_func(run_update, on_update_func)
    declare_on_func(run_init, on_init_func)
    declare_on_func(run_cleanup, on_cleanup_func)

#undef declare_on_func
};
#pragma region // UpdateFunc Validation
ValidateFieldOffset32(0x0, UpdateFunc, priority);
ValidateFieldOffset32(0x4, UpdateFunc, flags);
ValidateFieldOffset32(0x8, UpdateFunc, on_update_func);
ValidateFieldOffset32(0xC, UpdateFunc, on_init_func);
ValidateFieldOffset32(0x10, UpdateFunc, on_cleanup_func);
ValidateFieldOffset32(0x14, UpdateFunc, list_node);
ValidateFieldOffset32(0x24, UpdateFunc, func_arg);
ValidateStructSize32(0x28, UpdateFunc);
#pragma endregion

typedef struct UpdateFuncRegistry UpdateFuncRegistry;
extern "C" {
    // 0x4CF294
    extern UpdateFuncRegistry* UPDATE_FUNC_REGISTRY_PTR asm("_UPDATE_FUNC_REGISTRY_PTR");
}
// size: 0x58
struct UpdateFuncRegistry {
    UpdateFunc on_tick_funcs; // 0x0
    UpdateFunc on_draw_funcs; // 0x28
    ZUNLinkedList<UpdateFunc>* __head_node_ptr_50; // 0x50
    int __dword_54; // 0x54
    // 0x58


    UpdateFuncRegistry() : on_tick_funcs(NULL), on_draw_funcs(NULL) {
        this->__head_node_ptr_50->data = NULL;
    }

    // 0x401180
    dllexport static gnu_noinline int32_t stdcall register_on_tick(UpdateFunc* update_tick, int32_t new_func_priority) asm_symbol_rel(0x401180) {
        int32_t ret = update_tick->run_init();
        UpdateFuncRegistry* update_func_registry = UPDATE_FUNC_REGISTRY_PTR;
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        {
            update_tick->priority = new_func_priority;
            auto* prev_priority_node = update_func_registry->on_tick_funcs.list_node.next->find_node_before([=](UpdateFunc* update_func) {
                return update_func->priority >= new_func_priority;
            });
            prev_priority_node->append(&update_tick->list_node);
        }
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        return ret;
    }

    // 0x401230
    dllexport static gnu_noinline int32_t stdcall register_on_draw(UpdateFunc* update_draw, int32_t new_func_priority) asm_symbol_rel(0x401230) {
        int32_t ret = update_draw->run_init();
        UpdateFuncRegistry* update_func_registry = UPDATE_FUNC_REGISTRY_PTR;
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        {
            update_draw->priority = new_func_priority;
            auto* prev_priority_node = update_func_registry->on_draw_funcs.list_node.next->find_node_before([=](UpdateFunc* update_func) {
                return update_func->priority >= new_func_priority;
            });
            prev_priority_node->append(&update_draw->list_node);
        }
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        return ret;
    }

    // 0x4015A0
    dllexport gnu_noinline void thiscall delete_func(UpdateFunc* update_func) asm_symbol_rel(0x4015A0) {
        if (update_func) {
            auto data_match = [=](UpdateFunc* data) {
                return data == update_func;
            };
            ZUNLinkedList<UpdateFunc>* update_func_node;
            if (!(update_func_node = this->on_tick_funcs.list_node.find_node_if(data_match)) &&
                !(update_func_node = this->on_draw_funcs.list_node.find_node_if(data_match))
            ) {
                return;
            }
            update_func_node->unlink_from_head(this->__head_node_ptr_50);
            if (update_func_node->prev) { // Don't try to delete the list heads
                update_func_node->unlink();
                update_func->on_update_func = NULL;
                if (update_func->initialized) {
                    update_func->on_init_func = NULL;
                    update_func->on_cleanup_func = NULL;
                    delete update_func;
                }
            }
        }
    }

#if GAME_VERSION == 190
    // 0x401650
    dllexport gnu_noinline void thiscall delete_func_locked(UpdateFunc* update_func) asm_symbol_rel(0x401650) {
        if (update_func) {
            CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
            {
                this->delete_func(update_func);
            }
            CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        }
    }
#endif

    // 0x4012E0
    dllexport gnu_noinline int32_t thiscall run_all_on_tick() asm_symbol_rel(0x4012E0) {
        int32_t ret;
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        {
RestartOnTick:
            ret = 0;
            ZUNLinkedList<UpdateFunc>* node = this->on_tick_funcs.list_node.next;
            while (node) {
                ZUNLinkedList<UpdateFunc>* next_node = node->next;
                this->__head_node_ptr_50 = next_node;
                UpdateFunc* update_tick = node->data;
                node = next_node;
                if (!update_tick->on_update_func) {
                    continue;
                }
                if (update_tick->run_on_update) {
                    do {
                        if (this->__dword_54) {
                            goto CleanupThenNext;
                        }
                        int32_t update_ret;
                        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
                        {
                            update_ret = update_tick->on_update_func(update_tick->func_arg);
                        }
                        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
                        switch (expect_chance(update_ret, UpdateFuncRepeatCurrent, 0.05)) {
                            case UpdateFuncDeleteCurrentThenNext:
                                goto DeleteCurrentThenNext;
                            case UpdateFuncNext: default:
                                goto NextFunc;
                            case UpdateFuncRepeatCurrent:
                                continue;
                            case UpdateFuncEnd0: case UpdateFuncEnd0Dupe:
                                ret = 0;
                                goto EndOnTick;
                            case UpdateFuncEnd1:
                                ret = 1;
                                goto EndOnTick;
                            case UpdateFuncEndN1:
                                ret = -1;
                                goto EndOnTick;
                            case UpdateFuncRestartTick:
                                goto RestartOnTick;
                            case UpdateFuncCleanupThenNext:
                                goto CleanupThenNext;
                        }
                    } while (update_tick->run_on_update);
                    jump_only_block{
DeleteCurrentThenNext:
                        this->delete_func(update_tick);
                    }
                    jump_only_block{
CleanupThenNext:
                        update_tick->run_cleanup();
                    }
                }
NextFunc:
                node = this->__head_node_ptr_50;
                ++ret;
            }
        }
EndOnTick:
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        return ret;
    }

    // 0x401420
    dllexport static gnu_noinline int32_t run_all_on_draw() asm_symbol_rel(0x401420) {
        UpdateFuncRegistry* update_func_registry = UPDATE_FUNC_REGISTRY_PTR;
        int32_t ret;
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        {
//RestartOnTick:
            ret = 0;
            ZUNLinkedList<UpdateFunc>* node = update_func_registry->on_draw_funcs.list_node.next;
            while (expect(node != NULL, true)) {
                ZUNLinkedList<UpdateFunc>* next_node = node->next;
                update_func_registry->__head_node_ptr_50 = next_node;
                UpdateFunc* update_draw = node->data;
                node = next_node;
                if (!update_draw->on_update_func) {
                    continue;
                }
                if (update_draw->run_on_update) {
                    do {
                        /*if (update_func_registry->__dword_54) {
                            goto CleanupThenNext;
                        }*/
                        int32_t update_ret;
                        CRITICAL_SECTION_MANAGER.enter_section_volatile(UpdateFuncRegistry_CS);
                        {
                            update_ret = update_draw->on_update_func(update_draw->func_arg);
                        }
                        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
                        switch (expect_chance(update_ret, UpdateFuncNext, 0.95)) {
                            case UpdateFuncDeleteCurrentThenNext:
                                goto DeleteCurrentThenNext;
                            case UpdateFuncNext: default:
                                goto NextFunc;
                            case UpdateFuncRepeatCurrent:
                                continue;
                            case UpdateFuncEnd0: //case UpdateFuncEnd0Dupe:
                                ret = 0;
                                goto EndOnDraw;
                            case UpdateFuncEnd1:
                                ret = 1;
                                goto EndOnDraw;
                            case UpdateFuncEndN1:
                                ret = -1;
                                goto EndOnDraw;
                            /*case UpdateFuncRestartTick:
                                goto RestartOnTick;
                            case UpdateFuncCleanupThenNext:
                                goto CleanupThenNext;*/
                        }
                    } while (update_draw->run_on_update);
                    jump_only_block{
DeleteCurrentThenNext:
                        update_func_registry->delete_func(update_draw);
                    }
                    /*jump_only_block{
CleanupThenNext:
                        update_tick->run_cleanup();
                    }*/
                }
            NextFunc:
                node = update_func_registry->__head_node_ptr_50;
                ++ret;
            }
        }
EndOnDraw:
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        return ret;
    }
};
#pragma region // UpdateFuncRegistry Validation
ValidateFieldOffset32(0x0, UpdateFuncRegistry, on_tick_funcs);
ValidateFieldOffset32(0x28, UpdateFuncRegistry, on_draw_funcs);
ValidateFieldOffset32(0x50, UpdateFuncRegistry, __head_node_ptr_50);
ValidateFieldOffset32(0x54, UpdateFuncRegistry, __dword_54);
ValidateStructSize32(0x58, UpdateFuncRegistry);
#pragma endregion

// size: 0x8
struct Rng {
    uint16_t value; // 0x0
    uint32_t index; // 0x4
    // 0x8
    
    // 0x4026D0
    dllexport gnu_noinline uint16_t thiscall rand_ushort() asm_symbol_rel(0x4026D0) {
        CRITICAL_SECTION_MANAGER.enter_section(RNG_CS);
        {
            this->index++;
            uint16_t temp = (this->value ^ 0x9630) - 0x6553;
            this->value = ((temp & 0xC000) >> 14) + (temp << 2) & 0xFFFF;
        }
        CRITICAL_SECTION_MANAGER.leave_section(RNG_CS);
        return this->value;
    }
    
    // 0x402740
    dllexport gnu_noinline uint32_t thiscall rand_uint() asm_symbol_rel(0x402740) {
        uint16_t tempA, tempB;
        CRITICAL_SECTION_MANAGER.enter_section(RNG_CS);
        {
            this->index += 2;
            tempA = (this->value ^ 0x9630) - 0x6553;
            tempB = ((tempA & 0xC000) >> 14) + (tempA << 2) & 0xFFFF;
            tempB = (tempB ^ 0x9630) - 0x6553;
            this->value = ((tempB & 0xC000) >> 14) + (tempB << 2) & 0xFFFF;
        }
        CRITICAL_SECTION_MANAGER.leave_section(RNG_CS);
        return (tempA << 16) | tempB;
    }
    
    // 0x4027D0
    dllexport gnu_noinline float thiscall rand_float() asm_symbol_rel(0x4027D0) {
        __asm FINIT;
        float temp = this->rand_uint();
        return temp / (float)UINT32_MAX; // float jank rounds this to UINT32_MAX+1
    }
    // 0x402810
    dllexport gnu_noinline float thiscall rand_float_signed() asm_symbol_rel(0x402810) {
        __asm FINIT;
        float temp = this->rand_uint();
        return temp / (float)INT32_MAX - 1.0f; // float jank rounds this to INT32_MAX+1
    }
    // 0x405B90
    dllexport gnu_noinline float vectorcall rand_angle() asm_symbol_rel(0x405B90) {
        return this->rand_float_signed() * PI_f;
    }
    // 0x402850
    dllexport gnu_noinline float thiscall rand_angle_2() asm_symbol_rel(0x402850) {
        __asm FINIT;
        float temp = this->rand_uint();
        return temp / TWO_PI_f - PI_f;
    }
    
    // 0x406AB0
    dllexport gnu_noinline float vectorcall rand_float_range(float range) asm_symbol_rel(0x406AB0) {
        return this->rand_float() * range;
    }
    
    inline float rand_float_signed_range(float range) {
        return this->rand_float_signed() * range;
    }
    // 0x4615A0
    dllexport gnu_noinline uint32_t thiscall rand_uint_range(uint32_t range) asm_symbol_rel(0x4615A0) {
        if (range != 0) {
            return this->rand_uint() % range;
        } else {
            return 0;
        }
    }
};
#pragma region // Rng Validation
ValidateFieldOffset32(0x0, Rng, value);
ValidateFieldOffset32(0x4, Rng, index);
ValidateStructSize32(0x8, Rng);
#pragma endregion

extern "C" {
    // 0x4CF280
    extern Rng RNG asm("_RNG");
}

extern "C" {
    // 0x4CF288
    extern Rng REPLAY_RNG asm("_REPLAY_RNG");
}

typedef struct Float3 Float3;
typedef struct Enemy Enemy;

// 0x4237F0
dllexport gnu_noinline Enemy* get_boss_by_index(int32_t boss_id) asm_symbol_rel(0x4237F0);

// size: 0x8
struct GameSpeed {
    float value = 1.0f; // 0x0
    int __counter_4; // 0x4
    // 0x8

    // 0x43A200
    dllexport gnu_noinline void vectorcall set(float new_speed) asm_symbol_rel(0x43A200);
};
#pragma region // GameSpeed Validation
ValidateFieldOffset32(0x0, GameSpeed, value);
ValidateFieldOffset32(0x4, GameSpeed, __counter_4);
ValidateStructSize32(0x8, GameSpeed);
#pragma endregion

extern "C" {
    // 0x4CCBF0
    extern GameSpeed GAME_SPEED asm("_GAME_SPEED");
}
// 0x43A200
dllexport gnu_noinline void vectorcall GameSpeed::set(float new_speed) {
    GAME_SPEED.value = new_speed;
}

static const float* TIME_SCALING_TABLE[] = {
    &GAME_SPEED.value
};

// size: 0x14
struct Timer {
    int32_t previous; // 0x0
    int32_t current; // 0x4
    float current_f; // 0x8
    uint32_t scale_table_index; // 0xC
    union {
        uint32_t flags; // 0x10
        struct {
            uint32_t initialized : 1;
        };
    };
    // 0x14

    inline Timer() : initialized(false) {};

    inline void default_values() {
        this->current = 0;
        this->previous = -999999;
        this->current_f = 0.0f;
    }

private:
    inline void initialize_previous_force(int32_t value) volatile {
        this->previous = value;
    }
public:

    inline void initialize() {
        if (!this->initialized) {
            this->initialize_previous_force(-999999);
            this->scale_table_index = 0;
            this->initialized = true;
        }
    }

    inline void initialize_important() {
        if (!this->initialized) {
            this->scale_table_index = 0;
            this->initialized = true;
        }
    }
    inline void set_raw(int32_t time) {
        this->current = time;
        this->current_f = (float)time;
        this->previous = time - 1;
    }
    // 0x405D10
    dllexport inline void thiscall set(int32_t time) asm_symbol_rel(0x405D10) {
        this->initialize_important();
        this->set_raw(time);
    }
    inline void reset() {
        this->set(0);
    }

    inline void initialize_and_reset() {
        this->initialize();
        this->set_raw(0);
    }
    inline void initialize_and_set(int32_t time) {
        this->initialize();
        this->set_raw(time);
    }

    // 0x418C40
    // Yes, this really does copy a whole timer to the stack
    // Possibly an assignment operator...?
    dllexport gnu_noinline void set_from_timer(Timer timer) asm_symbol_rel(0x418C40) {
        this->set(timer.current);
    }

    // Just in case that is an assignment operator, check for warnings in current uses
    Timer& operator=(Timer timer) = delete;

    inline uint32_t get_scaling_index() {
        uint32_t time_scaling_index = this->scale_table_index;
        if (time_scaling_index >= countof(TIME_SCALING_TABLE)) {
            time_scaling_index = this->scale_table_index = 0;
        }
        return time_scaling_index;
    }

    inline float get_scale_unsafe() {
        return *TIME_SCALING_TABLE[this->scale_table_index];
    }

    // 0x402A60
    dllexport int32_t vectorcall add_raw(float value) asm_symbol_rel(0x402A60) {
        this->previous = this->current;
        return this->current = this->current_f += value;
    }

    inline int32_t vectorcall add_float(float amount) {
        const float* time_scale_ptr = TIME_SCALING_TABLE[this->get_scaling_index()];
        this->previous = this->current;
        if (time_scale_ptr) {
            float time_scale = *time_scale_ptr;
            if (!(time_scale > 0.99f) || !(time_scale < 1.01f)) {
                return this->current = this->current_f += time_scale * amount;
            }
        }
        return this->current = this->current_f += amount;
    }

    inline int32_t vectorcall sub_float(float amount) {
        const float* time_scale_ptr = TIME_SCALING_TABLE[this->get_scaling_index()];
        this->previous = this->current;
        if (time_scale_ptr) {
            float time_scale = *time_scale_ptr;
            if (!(time_scale > 0.99f) || !(time_scale < 1.01f)) {
                return this->current = this->current_f -= time_scale * amount;
            }
        }
        return this->current = this->current_f -= amount;
    }

    // 0x452BF0
    dllexport int32_t thiscall sub_int(int32_t amount) asm_symbol_rel(0x452BF0) {
        return this->add_float(-amount);
    }
    
    inline int32_t increment() {
        const float* time_scale_ptr = TIME_SCALING_TABLE[this->get_scaling_index()];
        int32_t current = this->current;
        this->previous = current;
        if (time_scale_ptr) {
            float time_scale = *time_scale_ptr;
            if (!(time_scale > 0.99f) || !(time_scale < 1.01f)) {
                return this->current = this->current_f += time_scale;
            }
        }
        this->current_f += 1.0f;
        return this->current = ++current;
    }

    inline int32_t decrement() {
        return this->sub_float(1.0f);
    }
    
    // 0x405990
    dllexport int32_t thiscall operator++(int) asm_symbol_rel(0x405990) {
        clang_forceinline return this->increment();
    }

    // 0x402A80
    dllexport int32_t thiscall operator++() asm_symbol_rel(0x402A80) {
        clang_forceinline return this->increment();
    }

    // 0x409750
    dllexport int32_t thiscall operator--(int) asm_symbol_rel(0x409750) {
        clang_forceinline return this->decrement();
    }

    dllexport int32_t thiscall operator--() {
        clang_forceinline return this->decrement();
    }

    // 0x4210A0
    dllexport BOOL thiscall __is_multiple_of(int32_t value) asm_symbol_rel(0x4210A0) {
        int32_t current = this->current;
        if (
            current != this->previous &&
            !(current % value)
        ) {
            return TRUE;
        }
        return FALSE;
    }
};
#pragma region // Timer Validation
ValidateFieldOffset32(0x0, Timer, previous);
ValidateFieldOffset32(0x4, Timer, current);
ValidateFieldOffset32(0x8, Timer, current_f);
ValidateFieldOffset32(0xC, Timer, scale_table_index);
ValidateFieldOffset32(0x10, Timer, flags);
ValidateStructSize32(0x14, Timer);
#pragma endregion

// size: 0x14
struct InputMapping {
    int16_t shoot; // 0x0
    int16_t bomb; // 0x2
    int16_t focus; // 0x4
    int16_t pause; // 0x6
    int16_t __button4; // 0x8
    int16_t __button5; // 0xA
    int16_t __button6; // 0xC
    int16_t __button7; // 0xE
    int16_t use_card; // 0x10
    int16_t switch_card; // 0x12
    // 0x14
};
#pragma region // InputMapping Validation
ValidateFieldOffset32(0x0, InputMapping, shoot);
ValidateFieldOffset32(0x2, InputMapping, bomb);
ValidateFieldOffset32(0x4, InputMapping, focus);
ValidateFieldOffset32(0x6, InputMapping, pause);
ValidateFieldOffset32(0x10, InputMapping, use_card);
ValidateFieldOffset32(0x12, InputMapping, switch_card);
ValidateStructSize32(0x14, InputMapping);
#pragma endregion

static inline constexpr size_t BUTTON_COUNT = 32;

static inline constexpr uint32_t BUTTON_SHOOT       = 0x00000001; // 'Z'
static inline constexpr uint32_t BUTTON_BOMB        = 0x00000002; // 'X'

static inline constexpr uint32_t BUTTON_FOCUS       = 0x00000008; // VK_SHIFT
static inline constexpr uint32_t BUTTON_UP          = 0x00000010;
static inline constexpr uint32_t BUTTON_DOWN        = 0x00000020;
static inline constexpr uint32_t BUTTON_LEFT        = 0x00000040;
static inline constexpr uint32_t BUTTON_RIGHT       = 0x00000080;
static inline constexpr uint32_t BUTTON_PAUSE       = 0x00000100; // VK_ESCAPE
static inline constexpr uint32_t BUTTON_SKIP        = 0x00000200;
static inline constexpr uint32_t BUTTON_USE_CARD    = 0x00000400; // 'C'
static inline constexpr uint32_t BUTTON_SWITCH_CARD = 0x00000800; // 'D'

static inline constexpr uint32_t BUTTON_UNKNOWN_A   = 0x00010000;

static inline constexpr uint32_t BUTTON_SCREENSHOT  = 0x00040000; // 'P', VK_HOME
static inline constexpr uint32_t BUTTON_ENTER       = 0x00080000; // VK_RETURN

static inline constexpr uint32_t BUTTON_RESTART     = 0x00200000; // 'R', VK_END

static inline constexpr uint32_t BUTTON_SELECT      = BUTTON_SHOOT | BUTTON_ENTER; // 'Z', VK_RETURN
static inline constexpr uint32_t BUTTON_CANCEL      = BUTTON_BOMB; // 'X'

static inline constexpr uint32_t BUTTON_SHOOT_INDEX = 0;
static inline constexpr uint32_t BUTTON_BOMB_INDEX = 1;
static inline constexpr uint32_t BUTTON_FOCUS_INDEX = 3;
static inline constexpr uint32_t BUTTON_UP_INDEX = 4;
static inline constexpr uint32_t BUTTON_DOWN_INDEX = 5;
static inline constexpr uint32_t BUTTON_LEFT_INDEX = 6;
static inline constexpr uint32_t BUTTON_RIGHT_INDEX = 7;
static inline constexpr uint32_t BUTTON_PAUSE_INDEX = 8;
static inline constexpr uint32_t BUTTON_USE_CARD_INDEX = 10;
static inline constexpr uint32_t BUTTON_SWITCH_CARD_INDEX = 11;
static inline constexpr uint32_t BUTTON_SCREENSHOT_INDEX = 18;
static inline constexpr uint32_t BUTTON_ENTER_INDEX = 19;
static inline constexpr uint32_t BUTTON_RESTART_INDEX = 21;

#define XINPUT_GAMEPAD_LEFT_TRIGGER 0x10000
#define XINPUT_GAMEPAD_RIGHT_TRIGGER 0x20000

// 0x4B4320
// Is this actually an array of 20 with extra blanks?
static inline constexpr uint32_t XINPUT_PAD_MAPPINGS[] = {
    XINPUT_GAMEPAD_A,
    XINPUT_GAMEPAD_B,
    XINPUT_GAMEPAD_X,
    XINPUT_GAMEPAD_Y,
    XINPUT_GAMEPAD_LEFT_SHOULDER,
    XINPUT_GAMEPAD_RIGHT_SHOULDER,
    XINPUT_GAMEPAD_LEFT_TRIGGER,
    XINPUT_GAMEPAD_RIGHT_TRIGGER,
    XINPUT_GAMEPAD_LEFT_THUMB,
    XINPUT_GAMEPAD_RIGHT_THUMB,
    XINPUT_GAMEPAD_START,
    XINPUT_GAMEPAD_BACK
};

enum InputMode : int32_t {
    InputXInput = 0,
    InputJoypad = 1,
    InputKeyboard = 2,
};

// This matches UnknownV in the th19 repo
struct InputState {
    union {
        uint32_t hardware_inputs_current; // 0x0
        struct {

        };
    };
    union {
        uint32_t hardware_inputs_previous; // 0x4
        struct {

        };
    };
    union {
        uint32_t hardware_inputs_held_26_frames; // 0x8
        struct {

        };
    };
    union {
        uint32_t hardware_inputs_rising_edge; // 0xC
        struct {

        };
    };
    union {
        uint32_t hardware_inputs_falling_edge; // 0x10
        struct {

        };
    };
    uint32_t hardware_inputs_held_for_repeat[BUTTON_COUNT]; // 0x14
    uint32_t inputs_held_for_repeat[BUTTON_COUNT]; // 0x94
    uint32_t hardware_inputs_held[BUTTON_COUNT]; // 0x114
    uint32_t inputs_held[BUTTON_COUNT]; // 0x194
    int __dword_214; // 0x214
    union {
        uint32_t inputs_current; // 0x218
        struct {
            
        };
    };
    union {
        uint32_t inputs_previous; // 0x21C
        struct {
            
        };
    };
    union {
        uint32_t inputs_held_26_frames; // 0x220
        struct {
            
        };
    };
    union {
        uint32_t inputs_rising_edge; // 0x224
        struct {
            
        };
    };
    union {
        uint32_t inputs_falling_edge; // 0x228
        struct {
            
        };
    };
    union {
        uint32_t hardware_inputs_held_8_frames; // 0x22C
        struct {

        };
    };
    union {
        uint32_t inputs_held_8_frames; // 0x230
        struct {
            
        };
    };
    InputMode __device_type; // 0x234
    InputMapping joypad_mapping; // 0x238
    InputMapping xinput_mapping; // 0x24C
    InputMapping keyboard_mapping; // 0x260
    // 0x274

    // 0x418CE0
    dllexport gnu_noinline void thiscall __reset_inputs() asm_symbol_rel(0x418CE0) {
        memset(this->inputs_held_for_repeat, 0, sizeof(this->inputs_held_for_repeat));
        memset(this->inputs_held, 0, sizeof(this->inputs_held));
        this->__dword_214 = 0;
        this->inputs_current = 0;
        this->inputs_previous = 0;
        this->inputs_held_26_frames = 0;
        this->inputs_rising_edge = 0;
        this->inputs_falling_edge = 0;
        this->inputs_held_8_frames = 0;
    }

    // 0x404E90
    dllexport gnu_noinline void thiscall __update_hardware_input() asm_symbol_rel(0x404E90) {
        uint32_t current = this->hardware_inputs_current;
        uint32_t mask = 1;

        for (size_t i = 0; i < BUTTON_COUNT; ++i) {
            if (current & 1) {
                ++this->hardware_inputs_held_for_repeat[i];
                ++this->hardware_inputs_held[i];
                if (this->hardware_inputs_held_for_repeat[i] >= 8) {
                    this->hardware_inputs_held_8_frames |= mask;
                }
                if (this->hardware_inputs_held_for_repeat[i] >= 26) {
                    this->hardware_inputs_held_26_frames |= mask;
                    this->hardware_inputs_held_for_repeat[i] -= 8;
                }
            } else {
                this->hardware_inputs_held_for_repeat[i] = 0;
                this->hardware_inputs_held[i] = 0;
            }
            current >>= 1;
            mask <<= 1;
        }
        current = this->hardware_inputs_current;
        uint32_t changed = current ^ this->hardware_inputs_previous;
        this->hardware_inputs_rising_edge = current & changed;
        this->hardware_inputs_falling_edge = ~current & changed;
    }

    inline void __update_input() {
        uint32_t current = this->inputs_current;
        uint32_t mask = 1;

        for (size_t i = 0; i < BUTTON_COUNT; ++i) {
            if (current & 1) {
                ++this->inputs_held_for_repeat[i];
                ++this->inputs_held[i];
                if (this->inputs_held_for_repeat[i] >= 8) {
                    this->inputs_held_8_frames |= mask;
                }
                if (this->inputs_held_for_repeat[i] >= 26) {
                    this->inputs_held_26_frames |= mask;
                    this->inputs_held_for_repeat[i] -= 8;
                }
            } else {
                this->inputs_held_for_repeat[i] = 0;
                this->inputs_held[i] = 0;
            }
            current >>= 1;
            mask <<= 1;
        }
        current = this->inputs_current;
        uint32_t changed = current ^ this->inputs_previous;
        this->inputs_rising_edge = current & changed;
        this->inputs_falling_edge = ~current & changed;
    }

    inline BOOL check_inputs(uint32_t mask) {
        if (!(this->inputs_current & mask)) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_inputs_no_repeat(uint32_t mask) {
        if (!(this->inputs_rising_edge & mask)) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_inputs_repeating(uint32_t mask) {
        if (
            !(this->inputs_rising_edge & mask) &&
            !(this->inputs_held_26_frames & mask)
        ) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_hardware_inputs(uint32_t mask) {
        if (!(this->hardware_inputs_current & mask)) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_hardware_inputs_no_repeat(uint32_t mask) {
        if (!(this->hardware_inputs_rising_edge & mask)) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_hardware_inputs_repeating(uint32_t mask) {
        if (
            !(this->hardware_inputs_rising_edge & mask) &&
            !(this->hardware_inputs_held_26_frames & mask)
        ) {
            return FALSE;
        }
        return TRUE;
    }

    inline uint32_t get_xinput(uint32_t buttons) {
        uint32_t prev_buttons = buttons;

        nounroll for (DWORD i = 0; i < 4; ++i) {
            XINPUT_STATE state = {};
            if (XInputGetState(i, &state) == ERROR_SUCCESS) {
                uint32_t pad_buttons = state.Gamepad.wButtons;
                if (state.Gamepad.bLeftTrigger >= XINPUT_GAMEPAD_TRIGGER_THRESHOLD) {
                    pad_buttons |= XINPUT_GAMEPAD_LEFT_TRIGGER;
                }
                if (state.Gamepad.bRightTrigger >= XINPUT_GAMEPAD_TRIGGER_THRESHOLD) {
                    pad_buttons |= XINPUT_GAMEPAD_RIGHT_TRIGGER;
                }
                if (state.Gamepad.sThumbLY >= XINPUT_GAMEPAD_LEFT_THUMB_DEADZONE) {
                    pad_buttons |= XINPUT_GAMEPAD_DPAD_UP;
                }
                if (state.Gamepad.sThumbLY <= -XINPUT_GAMEPAD_LEFT_THUMB_DEADZONE) {
                    pad_buttons |= XINPUT_GAMEPAD_DPAD_DOWN;
                }
                if (state.Gamepad.sThumbLX >= XINPUT_GAMEPAD_LEFT_THUMB_DEADZONE) {
                    pad_buttons |= XINPUT_GAMEPAD_DPAD_RIGHT;
                }
                if (state.Gamepad.sThumbLX <= -XINPUT_GAMEPAD_LEFT_THUMB_DEADZONE) {
                    pad_buttons |= XINPUT_GAMEPAD_DPAD_LEFT;
                }

                if (pad_buttons & XINPUT_GAMEPAD_DPAD_UP) {
                    buttons |= BUTTON_UP;
                }
                if (pad_buttons & XINPUT_GAMEPAD_DPAD_DOWN) {
                    buttons |= BUTTON_DOWN;
                }
                if (pad_buttons & XINPUT_GAMEPAD_DPAD_LEFT) {
                    buttons |= BUTTON_LEFT;
                }
                if (pad_buttons & XINPUT_GAMEPAD_DPAD_RIGHT) {
                    buttons |= BUTTON_RIGHT;
                }

                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.shoot]) {
                    buttons |= BUTTON_SHOOT;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.bomb]) {
                    buttons |= BUTTON_BOMB;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.focus]) {
                    buttons |= BUTTON_FOCUS;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.use_card]) {
                    buttons |= BUTTON_USE_CARD;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.switch_card]) {
                    buttons |= BUTTON_SWITCH_CARD;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.pause]) {
                    buttons |= BUTTON_PAUSE;
                }
            }
        }

        if (buttons != prev_buttons) {
            this->__device_type = InputXInput;
        }
        return buttons;
    }

    inline uint32_t get_joypad(uint32_t buttons);

    inline uint32_t get_keyboard(uint32_t buttons) {
        uint32_t prev_buttons = buttons;

        BYTE keys[256];
        GetKeyboardState(keys);

        // Again, this original code is *bad*.
        // I'm not going to attempt to match it.

        int32_t bomb = this->keyboard_mapping.bomb;
        int32_t shoot = this->keyboard_mapping.shoot;

        uint32_t pressed = keys[shoot]; // becomes 0x1
        pressed >>= 1;

        pressed |= keys[bomb] & 0x80; // becomes 0x2
        pressed >>= 1;

        // mystery key
        pressed >>= 1;

        int32_t focus = this->keyboard_mapping.focus;
        pressed |= keys[focus] & 0x80; // becomes 0x8
        pressed >>= 1;

        pressed |= (keys[VK_UP] | keys[VK_NUMPAD8]) & 0x80; // becomes 0x10
        pressed >>= 1;
        pressed |= (keys[VK_DOWN] | keys[VK_NUMPAD2]) & 0x80; // becomes 0x20
        pressed >>= 1;
        pressed |= (keys[VK_LEFT] | keys[VK_NUMPAD4]) & 0x80; // becomes 0x40
        pressed >>= 1;

        uint32_t pressed2 = (keys[VK_END] | keys['R']) & 0x80; // becomes 0x200000
        pressed2 <<= 1;

        // mystery key
        pressed2 <<= 1;

        pressed2 |= keys[VK_RETURN] & 0x80; // becomes 0x80000
        pressed2 <<= 1;

        pressed2 |= (keys[VK_HOME] | keys['P']) & 0x80; // becomes 0x40000
        pressed2 <<= 7;

        int32_t switch_card = this->keyboard_mapping.switch_card;
        pressed2 |= keys[switch_card] & 0x80; // becomes 0x800
        pressed2 <<= 1;

        int32_t use_card = this->keyboard_mapping.use_card;
        pressed2 |= keys[use_card] & 0x80; // becomes 0x400
        pressed2 <<= 1;

        // mystery key
        pressed2 <<= 1;

        int32_t pause = this->keyboard_mapping.pause;
        pressed2 |= keys[pause] & 0x80; // becomes 0x100
        pressed2 <<= 1;

        pressed |= pressed2;

        pressed |= (keys[VK_RIGHT] | keys[VK_NUMPAD6]) & 0x80; // becomes 0x80

        pressed |= keys[VK_NUMPAD3] & 0x80 ? BUTTON_DOWN | BUTTON_RIGHT : 0;
        pressed |= keys[VK_NUMPAD9] & 0x80 ? BUTTON_UP | BUTTON_RIGHT : 0;
        pressed |= keys[VK_NUMPAD1] & 0x80 ? BUTTON_DOWN | BUTTON_LEFT : 0;
        pressed |= keys[VK_NUMPAD7] & 0x80 ? BUTTON_UP | BUTTON_LEFT : 0;

        buttons |= pressed;

        if (buttons != prev_buttons) {
            this->__device_type = InputKeyboard;
        }
        return buttons;
    }
};
#pragma region // InputState Validation
ValidateFieldOffset32(0x0, InputState, hardware_inputs_current);
ValidateFieldOffset32(0x4, InputState, hardware_inputs_previous);
ValidateFieldOffset32(0x8, InputState, hardware_inputs_held_26_frames);
ValidateFieldOffset32(0xC, InputState, hardware_inputs_rising_edge);
ValidateFieldOffset32(0x14, InputState, hardware_inputs_held_for_repeat);
ValidateFieldOffset32(0x94, InputState, inputs_held_for_repeat);
ValidateFieldOffset32(0x114, InputState, hardware_inputs_held);
ValidateFieldOffset32(0x194, InputState, inputs_held);
ValidateFieldOffset32(0x214, InputState, __dword_214);
ValidateFieldOffset32(0x218, InputState, inputs_current);
ValidateFieldOffset32(0x21C, InputState, inputs_previous);
ValidateFieldOffset32(0x220, InputState, inputs_held_26_frames);
ValidateFieldOffset32(0x224, InputState, inputs_rising_edge);
ValidateFieldOffset32(0x228, InputState, inputs_falling_edge);
ValidateFieldOffset32(0x22C, InputState, hardware_inputs_held_8_frames);
ValidateFieldOffset32(0x230, InputState, inputs_held_8_frames);
ValidateFieldOffset32(0x234, InputState, __device_type);
ValidateFieldOffset32(0x238, InputState, joypad_mapping);
ValidateFieldOffset32(0x24C, InputState, xinput_mapping);
ValidateFieldOffset32(0x260, InputState, keyboard_mapping);
ValidateStructSize32(0x274, InputState);
#pragma endregion


extern "C" {
    // 0x4CA210
    extern InputState INPUT_STATES[3] asm("_INPUT_STATES");
}

// 0x42ABC0
dllexport gnu_noinline void __update_input0() asm_symbol_rel(0x42ABC0);
dllexport gnu_noinline void __update_input0() {
    INPUT_STATES[0].__update_input();
}

// 0x416B70
dllexport gnu_noinline BOOL stdcall __hardware_input0_pressed_or_held(uint32_t mask) asm_symbol_rel(0x416B70);
dllexport gnu_noinline BOOL stdcall __hardware_input0_pressed_or_held(uint32_t mask) {
    return INPUT_STATES[0].check_hardware_inputs_repeating(mask);
}

// size : 0x88
struct Config {
    int __dword_0; // 0x0
    InputMapping joypad_mapping; // 0x4
    InputMapping xinput_mapping; // 0x18
    InputMapping keyboard_mapping; // 0x2C
    int16_t deadzone_x; // 0x40
    int16_t deadzone_y; // 0x42
    uint8_t __ubyte_44; // 0x44
    uint8_t __ubyte_45; // 0x45
    uint8_t __ubyte_46; // 0x46
    uint8_t __ubyte_47; // 0x47
    uint8_t __ubyte_48; // 0x48
    uint8_t __ubyte_49; // 0x49
    int8_t __sbyte_4A; // 0x4A
    int8_t __sbyte_4B; // 0x4B
    char __byte_4C; // 0x4C
    char __byte_4D; // 0x4D
    uint8_t __ubyte_4E; // 0x4E
    unknown_fields(0x1); // 0x4F
    union {
        int32_t flags; // 0x50
        struct {
            int32_t __unknown_flag_B : 1; // 1
            int32_t reference_rasterizer : 1; // 2
            int32_t disable_fog : 1; // 3
            int32_t disable_direct_input : 1; // 4
            int32_t preload_bgm : 1; // 5
            int32_t disable_vsync : 1; // 6
            int32_t __disable_locale_detection : 1; // 7
            int32_t : 1; // 8
            int32_t __unknown_flag_A : 1; // 9
            int32_t __unknown_flag_C : 1; // 10
        };
    };
    int32_t window_x; // 0x54
    int32_t window_y; // 0x58
    unknown_fields(0x2C); // 0x5C
    
    inline void zero_contents() {
        zero_this();
    }
    
    // 0x444DD0
    dllexport gnu_noinline void initialize() asm_symbol_rel(0x444DD0) {
        this->zero_contents();
        this->__unknown_flag_A = true;
        this->__dword_0 = 0x180002;
        this->deadzone_x = 0x258;
        this->deadzone_y = 0x258;
        this->__ubyte_45 = 1;
        this->__ubyte_46 = 1;
        this->__ubyte_47 = 8;
        this->joypad_mapping = INPUT_STATES[0].joypad_mapping;
        this->xinput_mapping = INPUT_STATES[0].xinput_mapping;
        this->keyboard_mapping = INPUT_STATES[0].keyboard_mapping;
        this->__ubyte_49 = 2;
        this->__sbyte_4A = 0x64;
        this->__byte_4C = 0;
        this->__byte_4D = 2;
        this->__sbyte_4B = 50;
        this->window_x = INT32_MIN;
        this->window_y = INT32_MIN;
    }

    inline Config() {
        this->initialize();
    }
};
#pragma region // Config Validation
ValidateFieldOffset32(0x0, Config, __dword_0);
ValidateFieldOffset32(0x4, Config, joypad_mapping);
ValidateFieldOffset32(0x18, Config, xinput_mapping);
ValidateFieldOffset32(0x2C, Config, keyboard_mapping);
ValidateFieldOffset32(0x40, Config, deadzone_x);
ValidateFieldOffset32(0x42, Config, deadzone_y);
ValidateFieldOffset32(0x44, Config, __ubyte_44);
ValidateFieldOffset32(0x45, Config, __ubyte_45);
ValidateFieldOffset32(0x46, Config, __ubyte_46);
ValidateFieldOffset32(0x47, Config, __ubyte_47);
ValidateFieldOffset32(0x48, Config, __ubyte_48);
ValidateFieldOffset32(0x49, Config, __ubyte_49);
ValidateFieldOffset32(0x4A, Config, __sbyte_4A);
ValidateFieldOffset32(0x4B, Config, __sbyte_4B);
ValidateFieldOffset32(0x4C, Config, __byte_4C);
ValidateFieldOffset32(0x4D, Config, __byte_4D);
ValidateFieldOffset32(0x4E, Config, __ubyte_4E);
ValidateFieldOffset32(0x50, Config, flags);
ValidateFieldOffset32(0x54, Config, window_x);
ValidateFieldOffset32(0x58, Config, window_y);
ValidateStructSize32(0x88, Config);
#pragma endregion


// size: 0x1C
struct StageSky {
    float begin_distance; // 0x0
    float end_distance; // 0x4
    D3DCOLORVALUE color_components; // 0x8
    D3DCOLOR color; // 0x18
};
#pragma region // StageSky Validation
ValidateFieldOffset32(0x0, StageSky, begin_distance);
ValidateFieldOffset32(0x4, StageSky, end_distance);
ValidateFieldOffset32(0x8, StageSky, color_components);
ValidateFieldOffset32(0x18, StageSky, color);
ValidateStructSize32(0x1C, StageSky);
#pragma endregion

// size: 0x164
struct StageCamera {
    Float3 position; // 0x0
    Float3 facing; // 0xC
    Float3 rotation; // 0x18
    Float3 facing_normalized; // 0x24
    Float3 __float3_30; // 0x30
    Float3 __shaking_float3_A; // 0x3C
    Float3 __shaking_float3_B; // 0x48
    float fov; // 0x54
    Int2 window_resolution; // 0x58
    D3DMATRIXZ view_matrix; // 0x60
    D3DMATRIXZ projection_matrix; // 0xA0
    D3DVIEWPORT9 viewport; // 0xE0
    int32_t camera_index; // 0xF8
    Int2 __int2_FC; // 0xFC
    Int2 __int2_104; // 0x104
    D3DVIEWPORT9 __viewport_10C; // 0x10C
    D3DVIEWPORT9 __viewport_124; // 0x124
    Float3 __float3_13C; // 0x13C
    StageSky sky; // 0x148
    // 0x164

    inline void __copy_int2_FC_to_anm_manager();
};
#pragma region // StageCamera Validation
ValidateFieldOffset32(0x0, StageCamera, position);
ValidateFieldOffset32(0xC, StageCamera, facing);
ValidateFieldOffset32(0x18, StageCamera, rotation);
ValidateFieldOffset32(0x24, StageCamera, facing_normalized);
ValidateFieldOffset32(0x30, StageCamera, __float3_30);
ValidateFieldOffset32(0x3C, StageCamera, __shaking_float3_A);
ValidateFieldOffset32(0x48, StageCamera, __shaking_float3_B);
ValidateFieldOffset32(0x54, StageCamera, fov);
ValidateFieldOffset32(0x58, StageCamera, window_resolution);
ValidateFieldOffset32(0x60, StageCamera, view_matrix);
ValidateFieldOffset32(0xA0, StageCamera, projection_matrix);
ValidateFieldOffset32(0xE0, StageCamera, viewport);
ValidateFieldOffset32(0xF8, StageCamera, camera_index);
ValidateFieldOffset32(0xFC, StageCamera, __int2_FC);
ValidateFieldOffset32(0x104, StageCamera, __int2_104);
ValidateFieldOffset32(0x10C, StageCamera, __viewport_10C);
ValidateFieldOffset32(0x124, StageCamera, __viewport_124);
ValidateFieldOffset32(0x13C, StageCamera, __float3_13C);
ValidateFieldOffset32(0x148, StageCamera, sky);
ValidateStructSize32(0x164, StageCamera);
#pragma endregion

// size: 0x124
struct ScreenshotManager {
    BITMAPFILEHEADER bmp_header; // 0x0
    padding_bytes(0x2); // 0xE
    LPBITMAPINFOHEADER info_header; // 0x10
    unknown_fields(0x8); // 0x14
    int32_t __int_1C; // 0x1C
    char filename[MAX_PATH]; // 0x20
};
#pragma region // ScreenshotManager Validation
ValidateFieldOffset32(0x0, ScreenshotManager, bmp_header);
ValidateFieldOffset32(0x10, ScreenshotManager, info_header);
ValidateFieldOffset32(0x1C, ScreenshotManager, __int_1C);
ValidateFieldOffset32(0x20, ScreenshotManager, filename);
ValidateStructSize32(0x124, ScreenshotManager);
#pragma endregion

typedef struct AnmVM AnmVM;
typedef struct AnmLoaded AnmLoaded;

// size: 0x1C
struct ZUNThread {
    //void* vtable; // 0x0
    HANDLE thread; // 0x4
    uint32_t tid; // 0x8
    BOOL __bool_C; // 0xC
    BOOL __bool_10; // 0x10
    HMODULE* phModule; // 0x14
    _beginthreadex_proc_type start_func; // 0x18
    // 0x1C

    // 0x402B30
    // Might be destructor?
    dllexport gnu_noinline void stop_and_cleanup() asm_symbol_rel(0x402B30) {
        if (HANDLE thread_handle = this->thread) {
            this->__bool_C = true;
            this->__bool_10 = false;
            if (WaitForSingleObject(thread_handle, 200) == WAIT_TIMEOUT) {
                do {
                    this->__bool_C = true;
                    this->__bool_10 = false;
                    Sleep(1);
                } while (WaitForSingleObject(this->thread, 200) == WAIT_TIMEOUT);
            }
            CloseHandle(this->thread);
            this->thread = NULL;
            this->start_func = NULL;
        }
    }

    // 0x402BB0
    dllexport gnu_noinline void start(_beginthreadex_proc_type func, void* arg_list) asm_symbol_rel(0x402BB0) {
        this->stop_and_cleanup();
        this->start_func = func;
        this->__bool_10 = true;
        this->__bool_C = false;
        this->thread = (HANDLE)_beginthreadex(NULL, 0, func, arg_list, 0, &this->tid);
    }

    virtual ~ZUNThread() {
        this->stop_and_cleanup();
    }
};
#pragma region // ZUNThread Validation
//ValidateVirtualFieldOffset32(0x0, ZUNThread, vtable);
ValidateVirtualFieldOffset32(0x4, ZUNThread, thread);
ValidateVirtualFieldOffset32(0x8, ZUNThread, tid);
ValidateVirtualFieldOffset32(0xC, ZUNThread, __bool_C);
ValidateVirtualFieldOffset32(0x10, ZUNThread, __bool_10);
ValidateVirtualFieldOffset32(0x14, ZUNThread, phModule);
ValidateVirtualFieldOffset32(0x18, ZUNThread, start_func);
ValidateStructSize32(0x1C, ZUNThread);
#pragma endregion

// Couldn't figure out how to get the constructor right otherwise...
struct ZUNThreadB : ZUNThread {
    inline ZUNThreadB() {
        this->thread = NULL;
        this->tid = 0;
        this->__bool_C = FALSE;
        this->__bool_10 = FALSE;
    }
};

// size: 0x58
struct D3DThread : ZUNThread {
    unknown_fields(0x3C); // 0x1C
    // 0x58

    // 0x46FDD0
    virtual ~D3DThread() {

    }
};
#pragma region // D3DThread Validation
ValidateStructSize32(0x58, D3DThread);
#pragma endregion

extern "C" {
    // 0x4CD950
    extern D3DThread D3D_THREAD_A asm("_D3D_THREAD_A");
    // 0x4CDAE0
    extern ZUNThread UNKNOWN_THREAD_A asm("_UNKNOWN_THREAD_A");
}

// size: 0xC
struct ZUNTask {
    union {
        uint32_t task_flags; // 0x0
        struct {
            uint32_t : 1;
            uint32_t __unknown_task_flag_A : 1;
        };
    };
    UpdateFunc* on_tick_func; // 0x4
    UpdateFunc* on_draw_func; // 0x8
    // 0xC

    // 0x42A9A0
    dllexport void enable_funcs() {
        if (UpdateFunc* on_tick = this->on_tick_func) {
            on_tick->run_on_update = true;
        }
        if (UpdateFunc* on_draw = this->on_draw_func) {
            on_draw->run_on_update = true;
        }
    }

    inline BOOL on_tick_enabled() {
        UpdateFunc* on_tick = this->on_tick_func;
        if (on_tick && on_tick->run_on_update) {
            return TRUE;
        }
        return FALSE;
    }

    inline BOOL on_draw_enabled() {
        UpdateFunc* on_draw = this->on_draw_func;
        if (on_draw && on_draw->run_on_update) {
            return TRUE;
        }
        return FALSE;
    }
};

extern "C" {
    // 0x57095C
    extern size_t JOYPAD_INDEX asm("_JOYPAD_INDEX");
}

static constexpr LONG JOYPAD_MIN_RANGE = -1000;
static constexpr LONG JOYPAD_MAX_RANGE = 1000;

// size: 0x38
struct FpsCounter : ZUNTask {
    //ZUNTask base; // 0x0
    int __dword_C; // 0xC
    unknown_fields(0x10); // 0x10
    double __double_20; // 0x20
    double __double_28; // 0x28
    float __float_30; // 0x30
    unknown_fields(0x4); // 0x34
    // 0x38

    inline void zero_contents() {
        zero_this();
    }

    inline FpsCounter() {
        this->zero_contents();
        this->__unknown_task_flag_A = true;

    }

    inline float calc_slowdown_rate() {
        return 100.0f - (float)(this->__double_20 / this->__double_28) * 100.0f;
    }

    // 0x43A2D0
    dllexport gnu_noinline FpsCounter* stdcall destroy() asm_symbol_rel(0x43A2D0);
};

extern "C" {
    // 0x4CF2DC
    extern FpsCounter* FPS_COUNTER_PTR asm("_FPS_COUNTER_PTR");
    // 0x507644
}

// 0x43A2D0
dllexport gnu_noinline FpsCounter* stdcall FpsCounter::destroy() {
    UpdateFuncRegistry* update_func_registry = UPDATE_FUNC_REGISTRY_PTR;
    if (UpdateFunc* update_func = this->on_draw_func) {
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        update_func_registry->delete_func(update_func);
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
    }
    FPS_COUNTER_PTR = NULL;
    delete this;
    return this;
}

static inline constexpr size_t msg_variant_count = 4;

// size: 0xD4
struct StageData {
    int32_t stage_number; // 0x0
    const char* std_filename; // 0x4
    const char* ecl_filename; // 0x8
    const char* __str_C; // 0xC
    const char* __str_10; // 0x10
    const char* msg_filenames[msg_variant_count]; // 0x14
    const char* logo_anm_filename; // 0x24

};

extern "C" {
    // 0x4CF428
    extern StageData* STAGE_DATA_PTR asm("_STAGE_DATA_PTR");
}

// size: 0xB60
struct Supervisor {
    HINSTANCE current_instance; // 0x0
    LPDIRECT3D9 d3d; // 0x4
    LPDIRECT3DDEVICE9 d3d_device; // 0x8
    LPDIRECTINPUT8 dinput; // 0xC
    RECT window_rect; // 0x10
    LPDIRECTINPUTDEVICE8 keyboard_device; // 0x20;
    LPDIRECTINPUTDEVICE8 joypad_devices[1]; // 0x24;
    unknown_fields(0x4); // 0x28
    DIDEVCAPS __joypad_caps; // 0x2C
    HWND main_window_handle; // 0x58
    D3DMATRIXZ __view_matrix_5C; // 0x5C
    D3DMATRIXZ __projection_matrix_9C; // 0x9C
    D3DVIEWPORT9 __viewport_DC; // 0xDC
    D3DPRESENT_PARAMETERS present_parameters; // 0xF4
    unknown_fields(0x70); // 0x12C
    D3DDISPLAYMODE display_mode; // 0x19C
    LPDIRECT3DSURFACE9 __surface_1AC; // 0x1AC
    LPDIRECT3DSURFACE9 __surface_1B0; // 0x1B0
    LPDIRECT3DSURFACE9 back_buffer; // 0x1B4
    unknown_fields(0x4); // 0x1B8
    AnmVM* __arcade_vm_ptr_A; // 0x1BC
    AnmVM* __arcade_vm_ptr_B; // 0x1C0
    AnmVM* __arcade_vm_ptr_C; // 0x1C4
    AnmVM* __arcade_vm_ptr_D; // 0x1C8
    unknown_fields(0x8); // 0x1CC
    Config config; // 0x1D4
    StageCamera cameras[4]; // 0x25C
    StageCamera* current_camera_ptr; // 0x7EC
    int32_t current_camera_index; // 0x7F0
    int32_t gamemode_current; // 0x7F4
    int32_t gamemode_switch; // 0x7F8
    int32_t gamemode_previous; // 0x7FC
    int __dword_800; // 0x800
    int32_t __int_804; // 0x804
    unknown_fields(0x10); // 0x808
    int __dword_818; // 0x818
    unknown_fields(0x4); // 0x81C
    BOOL disable_vsync; // 0x820
    int __dword_824; // 0x824
    int __dword_828; // 0x828
    AnmLoaded* text_anm_loaded_ptr; // 0x82C
    unknown_fields(0x4); // 0x830
    union {
        uint32_t flags; // 0x834
        struct {
            uint32_t __unknown_flag_D : 1; // 1
            uint32_t __unknown_flag_C : 1; // 2
            uint32_t __unknown_flag_E : 1; // 3
            uint32_t : 3; // 4-6
            uint32_t __unknown_flag_A : 1; // 7
            uint32_t __unknown_bitfield_A : 2; // 8-9
            uint32_t : 4; // 10-13
            uint32_t __unknown_flag_B : 1; // 14
        };
    };
    uint32_t initial_rng_seed; // 0x838
    unknown_fields(0x4); // 0x83C
    D3DCAPS9 d3dcaps; // 0x840
    ScreenshotManager screenshot_manager; // 0x970
    ZUNThread __thread_A94; // 0xA94
    ZUNThread __thread_AB0; // 0xAB0
    unknown_fields(0x4); // 0xACC
    int32_t __int_AD0; // 0xAD0
    unknown_fields(0x54); // 0xAD4
    BOOL fog_enabled; // 0xB28
    BOOL zwrite_enabled; // 0xB2C
    int32_t game_exe_checksum; // 0xB30
    int32_t game_exe_file_size; // 0xB34
    int32_t ver_file_size; // 0xB38
    void* ver_file_buffer; // 0xB3C
    unknown_fields(0x10); // 0xB40
    double __double_B50; // 0xB50
    D3DCOLOR background_color; // 0xB58
    probably_padding_bytes(0x4); // 0xB5C
    // 0xB60

    // 0x453460
    dllexport static gnu_noinline UpdateFuncRet fastcall __INPUT_STATESn_tick_A(void* self) asm_symbol_rel(0x453460) {

    }

    // 0x4553B0
    dllexport static gnu_noinline UpdateFuncRet fastcall __INPUT_STATESn_draw_A(void* self) asm_symbol_rel(0x4553B0) {

    }

    // 0x455610
    dllexport static gnu_noinline UpdateFuncRet fastcall __INPUT_STATESn_draw_B(void* self) asm_symbol_rel(0x455610) {

    }

    // 0x453640
    dllexport static gnu_noinline UpdateFuncRet fastcall on_registration(void* self) asm_symbol_rel(0x453640);
    
    // 0x453DB0
    dllexport static gnu_noinline void initialize() asm_symbol_rel(0x453DB0);

    // 0x4543A0
    dllexport gnu_noinline ZunResult thiscall load_config_file(int) asm_symbol_rel(0x4543A0);

    // 0x454760
    dllexport HRESULT thiscall d3d_enable_fog() asm_symbol_rel(0x454760);

    // 0x4547A0
    dllexport HRESULT thiscall d3d_disable_fog() asm_symbol_rel(0x4547A0);

    // 0x4547E0
    dllexport HRESULT thiscall d3d_enable_zwrite() asm_symbol_rel(0x4547E0);

    // 0x454820
    dllexport HRESULT thiscall d3d_disable_zwrite() asm_symbol_rel(0x454820);

    // 0x454860
    dllexport static gnu_noinline int32_t stdcall __start_thread_A94(_beginthreadex_proc_type func, int) asm_symbol_rel(0x454860);

    // 0x4548E0
    dllexport static gnu_noinline void stdcall __sub_4548E0(StageCamera* camera) asm_symbol_rel(0x4548E0);

    // 0x454950
    dllexport static gnu_noinline void stdcall __sub_454950(StageCamera* camera) asm_symbol_rel(0x454950) {
        uint32_t height = camera->viewport.Height;
        float x = (float)camera->viewport.X + (float)camera->viewport.Width * 0.5f;
        float viewport_height = (float)height;
        height /= 2;
        float y = (float)camera->viewport.Y + viewport_height * 0.5f;
        float eye_z = (float)height / ztanf(camera->fov * 0.5f);
        D3DXVECTOR3 eye;
        D3DXVECTOR3 at;
        D3DXVECTOR3 up;
        up.x = 0.0f;
        up.y = -1.0f;
        up.z = 0.0f;
        eye.z = eye_z;
        eye.x = x;
        eye.y = y;
        at.x = x;
        at.y = y;
        at.z = 0.0f;
        D3DXMatrixLookAtLH((D3DXMATRIX*)&camera->view_matrix, &eye, &at, &up);
        float aspect = (float)camera->viewport.Width / (float)camera->viewport.Height;
        D3DXMatrixPerspectiveFovLH((D3DXMATRIX*)&camera->projection_matrix, camera->fov, aspect, 1.0f, 10000.0f);
    }

    // 0x454B20
    dllexport gnu_noinline void thiscall __initialize_cameras() asm_symbol_rel(0x454B20);

    // 0x454F50
    dllexport static gnu_noinline void __camera2_sub_454F50() asm_symbol_rel(0x454F50);

    // 0x41B330
    dllexport void thiscall set_camera_by_index(uint32_t index) asm_symbol_rel(0x41B330);
    // 0x41B3B0
    dllexport static gnu_noinline void stdcall set_camera2_alt(uint32_t = UNUSED_DWORD) asm_symbol_rel(0x41B3B0);

    inline void thiscall set_camera_by_index_disable_fog(uint32_t index);
    inline void thiscall set_camera_by_index_disable_zwrite(uint32_t index);
};
#pragma region // Supervisor Validation
ValidateFieldOffset32(0x0, Supervisor, current_instance);
ValidateFieldOffset32(0x4, Supervisor, d3d);
ValidateFieldOffset32(0x8, Supervisor, d3d_device);
ValidateFieldOffset32(0xC, Supervisor, dinput);
ValidateFieldOffset32(0x10, Supervisor, window_rect);
ValidateFieldOffset32(0x20, Supervisor, keyboard_device);
ValidateFieldOffset32(0x24, Supervisor, joypad_devices);
ValidateFieldOffset32(0x2C, Supervisor, __joypad_caps);
ValidateFieldOffset32(0x58, Supervisor, main_window_handle);
ValidateFieldOffset32(0x5C, Supervisor, __view_matrix_5C);
ValidateFieldOffset32(0x9C, Supervisor, __projection_matrix_9C);
ValidateFieldOffset32(0xDC, Supervisor, __viewport_DC);
ValidateFieldOffset32(0xF4, Supervisor, present_parameters);
ValidateFieldOffset32(0x19C, Supervisor, display_mode);
ValidateFieldOffset32(0x1AC, Supervisor, __surface_1AC);
ValidateFieldOffset32(0x1B0, Supervisor, __surface_1B0);
ValidateFieldOffset32(0x1B4, Supervisor, back_buffer);
ValidateFieldOffset32(0x1BC, Supervisor, __arcade_vm_ptr_A);
ValidateFieldOffset32(0x1C0, Supervisor, __arcade_vm_ptr_B);
ValidateFieldOffset32(0x1C4, Supervisor, __arcade_vm_ptr_C);
ValidateFieldOffset32(0x1C8, Supervisor, __arcade_vm_ptr_D);
ValidateFieldOffset32(0x1D4, Supervisor, config);
ValidateFieldOffset32(0x25C, Supervisor, cameras);
ValidateFieldOffset32(0x7EC, Supervisor, current_camera_ptr);
ValidateFieldOffset32(0x7F0, Supervisor, current_camera_index);
ValidateFieldOffset32(0x7F4, Supervisor, gamemode_current);
ValidateFieldOffset32(0x7F8, Supervisor, gamemode_switch);
ValidateFieldOffset32(0x7FC, Supervisor, gamemode_previous);
ValidateFieldOffset32(0x800, Supervisor, __dword_800);
ValidateFieldOffset32(0x804, Supervisor, __int_804);
ValidateFieldOffset32(0x818, Supervisor, __dword_818);
ValidateFieldOffset32(0x820, Supervisor, disable_vsync);
ValidateFieldOffset32(0x824, Supervisor, __dword_824);
ValidateFieldOffset32(0x828, Supervisor, __dword_828);
ValidateFieldOffset32(0x82C, Supervisor, text_anm_loaded_ptr);
ValidateFieldOffset32(0x834, Supervisor, flags);
ValidateFieldOffset32(0x838, Supervisor, initial_rng_seed);
ValidateFieldOffset32(0x840, Supervisor, d3dcaps);
ValidateFieldOffset32(0x970, Supervisor, screenshot_manager);
ValidateFieldOffset32(0xA94, Supervisor, __thread_A94);
ValidateFieldOffset32(0xAB0, Supervisor, __thread_AB0);
ValidateFieldOffset32(0xAD0, Supervisor, __int_AD0);
ValidateFieldOffset32(0xB28, Supervisor, fog_enabled);
ValidateFieldOffset32(0xB2C, Supervisor, zwrite_enabled);
ValidateFieldOffset32(0xB30, Supervisor, game_exe_checksum);
ValidateFieldOffset32(0xB34, Supervisor, game_exe_file_size);
ValidateFieldOffset32(0xB38, Supervisor, ver_file_size);
ValidateFieldOffset32(0xB3C, Supervisor, ver_file_buffer);
ValidateFieldOffset32(0xB50, Supervisor, __double_B50);
ValidateFieldOffset32(0xB58, Supervisor, background_color);
ValidateStructSize32(0xB60, Supervisor);
#pragma endregion

extern "C" {
    // 0x4CCDF0
    extern Supervisor SUPERVISOR asm("_SUPERVISOR");
}

// 0x453DB0
dllexport gnu_noinline void Supervisor::initialize() {
    SUPERVISOR.gamemode_current = -2;
    SUPERVISOR.gamemode_switch = 0;
    SUPERVISOR.__dword_800 = 0;
    UpdateFunc* update_func = new UpdateFunc(&Supervisor::__INPUT_STATESn_tick_A, true, &SUPERVISOR);
    update_func->on_init_func = &Supervisor::on_registration;
    if (!UpdateFuncRegistry::register_on_tick(update_func, 1)) {
        UpdateFuncRegistry::register_on_draw(new UpdateFunc(&Supervisor::__INPUT_STATESn_draw_A, true, &SUPERVISOR), 1);
    }
}

// 0x454860
dllexport gnu_noinline int32_t Supervisor::__start_thread_A94(_beginthreadex_proc_type func, int) {
    CRITICAL_SECTION_MANAGER.enter_section(__supervisor_thread_cs_1);
    {
        clang_forceinline SUPERVISOR.__thread_A94.start(func, NULL);
    }
    CRITICAL_SECTION_MANAGER.leave_section(__supervisor_thread_cs_1);
    return 0;
}

inline uint32_t InputState::get_joypad(uint32_t buttons) {
    uint32_t prev_buttons = buttons;
    if (SUPERVISOR.joypad_devices[0]) {
        if (FAILED(SUPERVISOR.joypad_devices[0]->Poll())) {
            for (size_t i = 0; i < 400; ++i) {
                // This isn't even listed as a valid return value in the docs?
                if (SUPERVISOR.joypad_devices[0]->Acquire() != DIERR_INPUTLOST) {
                    break;
                }
            }
        }
        else {
            DIJOYSTATE2 state = {};
            if (SUCCEEDED(SUPERVISOR.joypad_devices[0]->GetDeviceState(sizeof(state), &state))) {
                // This code is mangled AF to the point that no sane compiler will ever
                // output it, so I'm not even going to attempt to match the codegen.

                int32_t mapping;

                mapping = this->joypad_mapping.shoot;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_SHOOT;
                }

                mapping = this->joypad_mapping.bomb;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_BOMB;
                }

                mapping = this->joypad_mapping.pause;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_PAUSE;
                }

                mapping = this->joypad_mapping.focus;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_FOCUS;
                }

                mapping = this->joypad_mapping.use_card;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_USE_CARD;
                }

                mapping = this->joypad_mapping.switch_card;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_SWITCH_CARD;
                }

                uint32_t axes = 0;

                int32_t deadzone_x = SUPERVISOR.config.deadzone_x;
                int32_t deadzone_y = SUPERVISOR.config.deadzone_y;

                if (state.lX < -deadzone_x) {
                    axes |= BUTTON_LEFT;
                }
                if (state.lY < -deadzone_y) {
                    axes |= BUTTON_UP;
                }
                if (state.lX > deadzone_x) {
                    axes |= BUTTON_RIGHT;
                }
                if (state.lY > SUPERVISOR.config.deadzone_y) {
                    axes |= BUTTON_DOWN;
                }

                buttons |= axes;

                if (buttons != prev_buttons) {
                    this->__device_type = InputJoypad;
                }
            }
        }
    }
    return buttons;
}

static inline constexpr size_t SHOTTYPES_PER_CHARACTER = 1;

// size: 0xFC
struct Globals {
    int32_t current_stage; // 0x0
    int32_t __stage_number_related_4; // 0x4
    int32_t chapter; // 0x8
    int32_t __counter_C; // 0xC (Sound related?)
    int32_t __counter_10; // 0x10 (Sound related?)
    int32_t __counter_14; // 0x14 (Sound related?)
    int32_t character; // 0x18
    int32_t shottype; // 0x1C
    int32_t score; // 0x20
    int32_t difficulty; // 0x24
    int32_t __counter_28; // 0x28
    int32_t rank; // 0x2C
    int32_t graze_in_stage; // 0x30
    int32_t graze; // 0x34
    int32_t __ecl_var_9907; // 0x38
    int32_t miss_count_in_game; // 0x3C
    int __dword_40; // 0x40 (Maybe point_items_collected_in_stage?)
    int32_t point_items_collected_in_game; // 0x44
    int32_t point_item_value; // 0x48
    int32_t min_point_item_value; // 0x4C
    int32_t max_point_item_value; // 0x50
    int32_t money_collected_in_game; // 0x54
    int32_t current_money; // 0x58
    int32_t current_power; // 0x5C
    int32_t max_power; // 0x60
    int32_t __power_related_64; // 0x64 (Power related)
    int __dword_68; // 0x68
    int32_t life_stocks; // 0x6C
    int32_t life_fragments; // 0x70
    int32_t lives_added; // 0x74
    int32_t life_stock_max; // 0x78
    int32_t bomb_stocks; // 0x7C
    int32_t bomb_fragments; // 0x80
    int32_t bomb_stocks_for_new_life; // 0x84
    int32_t bomb_stock_max; // 0x88
    int32_t __int_8C; // 0x8C
    int32_t __int_90; // 0x90
    int __dword_94; // 0x94
    int __dword_98; // 0x98
    int __dword_9C; // 0x9C
    int __dword_A0; // 0xA0
    int __dword_A4; // 0xA4
    int __dword_A8; // 0xA8
    int __dword_AC; // 0xAC
    int __dword_B0; // 0xB0
    int __dword_B4; // 0xB4
    int __dword_B8; // 0xB8
    int __dword_BC; // 0xBC
    int __dword_C0; // 0xC0
    Timer __timer_C4; // 0xC4
    Timer __timer_D8; // 0xD8
    int __dword_EC; // 0xEC
    int __dword_F0; // 0xF0
    int __dword_F4; // 0xF4
    union {
        uint32_t flags; // 0xF8
        struct {
            uint32_t : 4; // 1-4
            uint32_t __unknown_field_A : 2; // 5-6
            uint32_t : 5; // 7-11
            uint32_t __unknown_flag_A : 1; // 12
        };
    };
    // 0xFC

    inline int32_t shottype_index() const {
        return this->character + this->shottype * SHOTTYPES_PER_CHARACTER;
    }

    // 0x417A60
    dllexport gnu_noinline Globals& thiscall operator=(const Globals& rhs) {
        this->current_stage = rhs.current_stage;
        this->__stage_number_related_4 = rhs.__stage_number_related_4;
        this->chapter = rhs.chapter;
        this->__counter_C = rhs.__counter_C;
        this->__counter_10 = rhs.__counter_10;
        this->__counter_14 = rhs.__counter_14;
        this->character = rhs.character;
        this->shottype = rhs.shottype;
        this->score = rhs.score;
        this->difficulty = rhs.difficulty;
        this->__counter_28 = rhs.__counter_28;
        this->rank = rhs.rank;
        this->graze_in_stage = rhs.graze_in_stage;
        this->graze = rhs.graze;
        this->__ecl_var_9907 = rhs.__ecl_var_9907;
        this->miss_count_in_game = rhs.miss_count_in_game;
        this->__dword_40 = rhs.__dword_40;
        this->point_items_collected_in_game = rhs.point_items_collected_in_game;
        this->point_item_value = rhs.point_item_value;
        this->min_point_item_value = rhs.min_point_item_value;
        this->max_point_item_value = rhs.max_point_item_value;
        this->money_collected_in_game = rhs.money_collected_in_game;
        this->current_money = rhs.current_money;
        this->current_power = rhs.current_power;
        this->max_power = rhs.max_power;
        this->__power_related_64 = rhs.__power_related_64;
        this->__dword_68 = rhs.__dword_68;
        this->life_stocks = rhs.life_stocks;
        this->life_fragments = rhs.life_fragments;
        this->lives_added = rhs.lives_added;
        this->life_stock_max = rhs.life_stock_max;
        this->bomb_stocks = rhs.bomb_stocks;
        this->bomb_fragments = rhs.bomb_fragments;
        this->bomb_stocks_for_new_life = rhs.bomb_stocks_for_new_life;
        this->bomb_stock_max = rhs.bomb_stock_max;
        this->__int_8C = rhs.__int_8C;
        this->__int_90 = rhs.__int_90;
        this->__dword_94 = rhs.__dword_94;
        this->__dword_98 = rhs.__dword_98;
        this->__dword_9C = rhs.__dword_9C;
        this->__dword_A0 = rhs.__dword_A0;
        this->__dword_A4 = rhs.__dword_A4;
        this->__dword_A8 = rhs.__dword_A8;
        this->__dword_AC = rhs.__dword_AC;
        this->__dword_B0 = rhs.__dword_B0;
        this->__dword_B4 = rhs.__dword_B4;
        this->__dword_B8 = rhs.__dword_B8;
        this->__dword_BC = rhs.__dword_BC;
        this->__dword_C0 = rhs.__dword_C0;
        this->__timer_C4.set_from_timer(rhs.__timer_C4);
        this->__timer_D8.set_from_timer(rhs.__timer_D8);
        this->__dword_EC = rhs.__dword_EC;
        this->__dword_F0 = rhs.__dword_F0;
        this->__dword_F4 = rhs.__dword_F4;
        this->flags = rhs.flags;
        return *this;
    }

    // 0x412FA0
    dllexport gnu_noinline void thiscall __set_unknown_value_A(int32_t value) asm_symbol_rel(0x412FA0) {
        this->current_power = value;
        int32_t A = this->max_power;
        if (value <= A) {
            A = value < this->__power_related_64 ? this->__power_related_64 : value;
        }
        this->current_power = A;
    }

    // 0x42A970
    dllexport gnu_noinline void thiscall __set_unknown_flag_A(int32_t value) asm_symbol_rel(0x42A970) {
        this->__unknown_flag_A = value;
    }

    // 0x439EA0
    dllexport gnu_noinline int32_t thiscall get_rank() asm_symbol_rel(0x439EA0) {
        return this->rank;
    }

    // 0x439EB0
    dllexport gnu_noinline void thiscall __add_to_int_90(int32_t value) asm_symbol_rel(0x439EB0) {
        this->__int_90 += value;
    }

    // 00439EC0
    dllexport gnu_noinline void thiscall __add_to_int_8C(int32_t value) asm_symbol_rel(0x439EC0) {
        this->__int_8C += value;
    }

    // 0x4573F0
    dllexport gnu_noinline BOOL thiscall __sub_4573F0(int32_t value) asm_symbol_rel(0x4573F0);

    // 0x457480
    dllexport gnu_noinline BOOL thiscall __sub_457480(int32_t value) asm_symbol_rel(0x457480) {
        int32_t& A = this->current_power;
        int32_t B = this->__power_related_64;
        if (A <= B) {
            return false;
        }
        A -= value;
        if (A < B) {
            A = B;
        }
        int32_t C = (A + value) / this->__power_related_64;
        int32_t D = A / this->__power_related_64;
        return C != D;
    }

    // 0x4574D0
    dllexport gnu_noinline void thiscall __sub_4574D0() asm_symbol_rel(0x4574D0) {
        // TODO
    }
};

// 0x130
struct GameManager {
    int32_t __int_0; // 0x0
    int32_t __int_4; // 0x4
    union {
        uint32_t flags; // 0x8
        struct {
            uint32_t __unknown_flag_A : 1; // 1
            uint32_t __unknown_flag_B : 1; // 2
            uint32_t __unknown_flag_C : 1; // 3
            uint32_t __unknown_flag_D : 1; // 4
            uint32_t __unknown_field_A : 2; // 5-6
            uint32_t __unknown_flag_E : 1; // 7
        };
    };
    int32_t __int_C; // 0xC
    int32_t continue_credits; // 0x10
    int32_t __int_14; // 0x14
    int32_t __int_18; // 0x18
    Globals globals; // 0x1C
    int32_t __int_118; // 0x118
    probably_padding_bytes(0x4); // 0x11C
    double game_time_double; // 0x120
    int __dword_128; // 0x128
    probably_padding_bytes(0x4); // 0x12C
    // 0x130

    // 0x406AA0
    dllexport gnu_noinline int32_t thiscall get_chapter() asm_symbol_rel(0x406AA0) {
        return this->globals.chapter;
    }

    // 0x418D60
    dllexport gnu_noinline int32_t thiscall get_current_stage() asm_symbol_rel(0x418D60) {
        return this->globals.current_stage;
    }

    // 0x42A990
    dllexport bool thiscall __unknown_field_A_is_2() asm_symbol_rel(0x42A990) {
        return this->__unknown_field_A == 2;
    }

    // 0x42AA20
    dllexport gnu_noinline int32_t thiscall get_difficulty() asm_symbol_rel(0x42AA20) {
        return this->globals.difficulty;
    }

    // 0x4630B0
    dllexport gnu_noinline void __set_unknown_field_A(int32_t value) asm_symbol_rel(0x4630B0) {
        if (this->__unknown_field_A != 2) {
            this->globals.__ecl_var_9907 = -1;
        }
        this->__unknown_field_A = value;
    }
};

extern "C" {
    // 0x4CCCC0
    extern GameManager GAME_MANAGER asm("_GAME_MANAGER");
}

enum MotionMode : int32_t {
    AxisVelocityMovement = 0,
    NoMovement = 1,
    OrbitMovement = 2,
    EllipseMovement = 3,
    UnknownMovement = 4
};

// size: 0x44
struct MotionData {
    Float3 position; // 0x0
    Float3 position2; // 0xC
    float speed; // 0x18
    ZUNAngle angle; // 0x1C
    float orbit_radius; // 0x20
    float orbit_velocity; // 0x24
    ZUNAngle ellipse_angle; // 0x28
    float ellipse_ratio; // 0x2C
    float __angle_30; // 0x30
    union {
        Float3 misc_float3; // 0x34
        Float3 axis_velocity; // 0x34
        Float3 orbit_origin; // 0x34
    };
    union {
        uint32_t flags; // 0x40
        struct {
            uint32_t mode : 4; // 1-4
        };
    };

    inline void zero_contents() {
        zero_this();
    }
    
    // 0x402CC0
    dllexport gnu_noinline void update() asm_symbol_rel(0x402CC0) {
        Float3 float3B; // EBP-20, EBP-1C, EBP-18
        Float3 float3A; // EBP-14, EBP-10, EBP-C
        float floatA; // EBP-8
        float floatB; // EBP-4
        float floatC;
        switch (this->mode) {
            case AxisVelocityMovement:
                this->position += this->axis_velocity;
                break;
            case OrbitMovement:
                float3A.make_from_vector(this->angle, this->orbit_radius);
                this->position = this->orbit_origin + float3A.as2();
                break;
            case EllipseMovement: {
                ZUNAngle angle_temp = this->ellipse_angle;
                float3A.make_from_vector(reduce_angle<NoInline>(this->angle - angle_temp), this->orbit_radius);
                floatB = this->ellipse_ratio * float3A.x;
                floatA = zsinf(angle_temp);
                floatC = zcosf(angle_temp);
                Float2 float2A = { floatB, float3A.y };
                Float2 float2B = float2A;
                float2B *= floatA;
                float2A *= floatC;
                float2A.x -= float2B.y;
                float2A.y += float2B.x;
                this->position = this->orbit_origin + float2A;
                break;
            }
            case UnknownMovement: {
                float3A.as2() = this->position.as2();
                this->position2 += this->axis_velocity;
                floatB = this->ellipse_angle + HALF_PI_f;
                float3B.make_from_vector(reduce_angle<NoInline>(floatB), this->orbit_radius * zsinf(this->__angle_30) * GAME_SPEED.value);
                this->position = this->position2 + float3B.as2();
                float angle_temp = this->position.angle_to(float3A.as2());
                clang_noinline this->angle = angle_temp;
                break;
            }
        }
        this->position.x = zfloorf(this->position.x * 100.0f) / 100.0f;
        this->position.y = zfloorf(this->position.y * 100.0f) / 100.0f;
    }

    // This function doesn't exist, I merely wanted to write a simplified version
    inline void update_readable() {
        switch (this->mode) {
            case AxisVelocityMovement:
                this->position.x += this->axis_velocity.x;
                this->position.y += this->axis_velocity.y;
                this->position.z += this->axis_velocity.z;
                break;
            case OrbitMovement: {
                Float2 circle_pos;
                circle_pos.make_from_vector(this->angle, this->orbit_radius);
                this->position.x = this->orbit_origin.x + circle_pos.x;
                this->position.y = this->orbit_origin.y + circle_pos.y;
                this->position.z = this->orbit_origin.z;
                break;
            }
            case EllipseMovement: {
                Float2 ellipse_pos;
                ellipse_pos.make_from_vector(reduce_angle(this->angle - this->ellipse_angle), this->orbit_radius);
                ellipse_pos.x *= this->ellipse_ratio;
                Float2 temp_pos = ellipse_pos;
                ellipse_pos.x *= cosf(this->ellipse_angle);
                ellipse_pos.y *= cosf(this->ellipse_angle);
                temp_pos.x *= sinf(this->ellipse_angle);
                temp_pos.y *= sinf(this->ellipse_angle);
                ellipse_pos.x -= temp_pos.y;
                ellipse_pos.y += temp_pos.x;
                this->position.x = this->orbit_origin.x + ellipse_pos.x;
                this->position.y = this->orbit_origin.y + ellipse_pos.y;
                this->position.z = this->orbit_origin.z;
                break;
            }
            case UnknownMovement: {
                Float2 prev_position = this->position;
                this->position2.x += this->axis_velocity.x;
                this->position2.y += this->axis_velocity.y;
                this->position2.z += this->axis_velocity.z;
                Float2 offset;
                offset.make_from_vector(reduce_angle(this->ellipse_angle + HALF_PI_f), this->orbit_radius * sinf(this->__angle_30) * GAME_SPEED.value);
                this->position.x = this->position2.x + offset.x;
                this->position.y = this->position2.y + offset.y;
                this->position.z = this->position2.z;
                this->angle = this->position.angle_to(prev_position); // wrapper function for atan2
                break;
            }
        }
        this->position.x = floorf(this->position.x * 100.0f) / 100.0f;
        this->position.y = floorf(this->position.y * 100.0f) / 100.0f;
    }

    // 0x402F90
    dllexport gnu_noinline void update2() asm_symbol_rel(0x402F90) {
        if (this->mode == UnknownMovement) {
            this->position2 = this->position;
        }
        this->update();
    }
    
    // 0x412F60
    dllexport gnu_noinline void set_position(Float3* coord) asm_symbol_rel(0x412F60) {
        this->position = *coord;
    }
    // 0x43A290
    dllexport gnu_noinline void set_positionB(Float3* coord) asm_symbol_rel(0x43A290) {
        this->position = *coord;
    }
    
    // 0x412FD0
    dllexport gnu_noinline void vectorcall set_speed(float value) asm_symbol_rel(0x412FD0) {
        this->speed = value;
    }
    
    // 0x413280
    dllexport gnu_noinline Float3& thiscall get_position() asm_symbol_rel(0x413280) {
        return this->position;
    }
    
    // 0x422530
    dllexport gnu_noinline void vectorcall set_orbit_velocity(float value) asm_symbol_rel(0x422530) {
        this->orbit_velocity = value;
    }
    
    // 0x422540
    dllexport gnu_noinline void vectorcall set_orbit_radius(float value) asm_symbol_rel(0x422540) {
        this->orbit_radius = value;
    }
    
    // 0x422550
    dllexport gnu_noinline void set_orbit_mode() asm_symbol_rel(0x422550) {
        this->mode = OrbitMovement;
    }
    
    // 0x422560
    dllexport gnu_noinline void set_misc_float3(const Float3& value) asm_symbol_rel(0x422560) {
        this->misc_float3 = value;
    }

    forceinline void set_axis_velocity(const Float3& value) {
        this->set_misc_float3(value);
    }

    forceinline void set_orbit_origin(const Float3& value) {
        this->set_misc_float3(value);
    }

    // 0x422580
    dllexport gnu_noinline float vectorcall get_speed() asm_symbol_rel(0x422580) {
        return this->speed;
    }
    
    // 0x422590
    dllexport gnu_noinline ZUNAngle& get_angle() asm_symbol_rel(0x422590) {
        return this->angle;
    }
    
    // 0x4225A0
    dllexport gnu_noinline void vectorcall set_angle(float angle) asm_symbol_rel(0x4225A0) {
        this->angle = angle;
    }
    
    // 0x4225F0
    dllexport gnu_noinline void set_axis_velocity_mode() asm_symbol_rel(0x4225F0) {
        this->mode = AxisVelocityMovement;
    }
    
    // 0x43A210
    dllexport gnu_noinline void vectorcall set_position_y(float value) asm_symbol_rel(0x43A210) {
        this->position.y = value;
    }
    
    // 0x43A220
    dllexport gnu_noinline void vectorcall set_position_x(float value) asm_symbol_rel(0x43A220) {
        this->position.x = value;
    }
    
    // 0x43A230
    dllexport gnu_noinline float vectorcall get_position_y() asm_symbol_rel(0x43A230) {
        return this->position.y;
    }
    
    // 0x43A240
    dllexport gnu_noinline float vectorcall get_position_x() asm_symbol_rel(0x43A240) {
        return this->position.x;
    }

    // 0x439ED0
    dllexport gnu_noinline float vectorcall get_ellipse_angle() asm_symbol_rel(0x439ED0) {
        return this->ellipse_angle;
    }

    // 0x439EE0
    dllexport gnu_noinline float vectorcall get_ellipse_ratio() asm_symbol_rel(0x439EE0) {
        return this->ellipse_ratio;
    }
    
    // 0x439EF0
    dllexport gnu_noinline void set_ellipse_mode() asm_symbol_rel(0x439EF0) {
        this->mode = EllipseMovement;
    }
    
    // 0x439F00
    dllexport gnu_noinline void vectorcall set_ellipse_ratio(float ratio) asm_symbol_rel(0x439F00) {
        this->ellipse_ratio = ratio;
    }
    
    // 0x439F10
    dllexport gnu_noinline void vectorcall set_ellipse_angle(float angle) asm_symbol_rel(0x439F10) {
        this->ellipse_angle = angle;
    }

    // 0x439FA0
    dllexport gnu_noinline void vectorcall set_misc_float3_y(float value) asm_symbol_rel(0x439FA0) {
        this->misc_float3.y = value;
    }

    forceinline void vectorcall set_axis_velocity_y(float value) {
        this->set_misc_float3_y(value);
    }

    forceinline void vectorcall set_orbit_origin_y(float value) {
        this->set_misc_float3_y(value);
    }

    // 0x439FB0
    dllexport gnu_noinline void vectorcall set_misc_float3_x(float value) asm_symbol_rel(0x439FB0) {
        this->misc_float3.x = value;
    }

    forceinline void vectorcall set_axis_velocity_x(float value) {
        this->set_misc_float3_x(value);
    }

    forceinline void vectorcall set_orbit_origin_x(float value) {
        this->set_misc_float3_x(value);
    }
    
    // 0x439FC0
    dllexport gnu_noinline float vectorcall get_orbit_radius() asm_symbol_rel(0x439FD0) {
        return this->orbit_radius;
    }
    
    // 0x439FD0
    dllexport gnu_noinline float vectorcall get_orbit_velocity() asm_symbol_rel(0x439FD0) {
        return this->orbit_velocity;
    }
    
    // 0x43A270
    dllexport gnu_noinline bool mode_is_orbit() asm_symbol_rel(0x43A270) {
        return this->mode == OrbitMovement;
    }

    inline MotionData() {};
};
#pragma region // MotionData Validation
ValidateFieldOffset32(0x0, MotionData, position);
ValidateFieldOffset32(0xC, MotionData, position2);
ValidateFieldOffset32(0x18, MotionData, speed);
ValidateFieldOffset32(0x1C, MotionData, angle);
ValidateFieldOffset32(0x20, MotionData, orbit_radius);
ValidateFieldOffset32(0x24, MotionData, orbit_velocity);
ValidateFieldOffset32(0x28, MotionData, ellipse_angle);
ValidateFieldOffset32(0x2C, MotionData, ellipse_ratio);
ValidateFieldOffset32(0x30, MotionData, __angle_30);
ValidateFieldOffset32(0x34, MotionData, misc_float3);
ValidateFieldOffset32(0x40, MotionData, flags);
ValidateStructSize32(0x44, MotionData);
#pragma endregion

template <typename T>
struct ZUNAbsRel {
    T absolute;
    T relative;
};
/*
enum InterpMode {
    Linear = 0,
    AccelerateSlow = 1,
    Accelerate = 2,
    AccelerateFast = 3,
    DecelerateSlow = 4,
    Decelerate = 5,
    DecelerateFast = 6,
    ConstantVelocity = 7,
    Bezier = 8,
    AccelDecelSlow = 9,
    AccelDecel = 10,
    AccelDecelFast = 11,
    DecelAccelSlow = 12,
    DecelAccel = 13,
    DecelAccelFast = 14,
};
*/

// 0x402FB0
dllexport gnu_noinline float vectorcall __interp_inner_thing(int32_t mode, float current_time, float end_time) asm_symbol_rel(0x402FB0);
dllexport gnu_noinline float vectorcall __interp_inner_thing(int32_t mode, float current_time, float end_time) {
    float value = current_time;
    if (end_time == 0.0f) {
        goto interp_final;
    }
    value /= end_time;
    switch (mode) {
        case AccelerateSlow: // 1
            value = value * value;
        default: // linear
            return value;
        case DecelerateSlow: // 4
            value = 1.0f - value;
            value = value * value;
            value = 1.0f - value;
            return value;
        case Accelerate: // 2
            value = value * value * value;
            return value;
        case Decelerate: // 5
            value = 1.0f - value;
            value = value * value * value;
            value = 1.0f - value;
            return value;
        case AccelerateFast: // 3
            value = value * value * value * value;
            return value;
        case DecelerateFast: // 6
            value = 1.0f - value;
            value = value * value * value * value;
            value = 1.0f - value;
            return value;
        case AccelDecelSlow: // 9
            value += value;
            if (value < 1.0f) {
                value = value * value;
                return value * 0.5f;
            } else {
                value = 2.0f - value;
                value = value * value;
                value = 2.0f - value;
                return value * 0.5f;
            }
        case DecelAccelSlow: // 12
            value += value;
            if (value < 1.0f) {
                value = 1.0f - value;
                value = value * value;
                return 0.5f - value * 0.5f;
            } else {
                value = value - 1.0f;
                value = value * value;
                return 0.5f + value * 0.5f;
            }
        case AccelDecel: // 10
            value += value;
            if (value < 1.0f) {
                value = value * value * value;
                return value * 0.5f;
            } else {
                value = 2.0f - value;
                value = value * value * value;
                value = 2.0f - value;
                return value * 0.5f;
            }
        case DecelAccel: // 13
            value += value;
            if (value < 1.0f) {
                value = 1.0f - value;
                value = value * value * value;
                return 0.5f - value * 0.5f;
            } else {
                value = value - 1.0f;
                value = value * value * value;
                return 0.5f + value * 0.5f;
            }
        case AccelDecelFast: // 11
            value += value;
            if (value < 1.0f) {
                value = value * value * value * value;
                return value * 0.5f;
            } else {
                value = 2.0f - value;
                value = value * value * value * value;
                value = 2.0f - value;
                return value * 0.5f;
            }
        case DecelAccelFast: // 14
            value += value;
            if (value < 1.0f) {
                value = 1.0f - value;
                value = value * value * value * value;
                return 0.5f - value * 0.5f;
            } else {
                value = value - 1.0f;
                value = value * value * value * value;
                return 0.5f + value * 0.5f;
            }
        case DecelerateSine: // 18
            return zsinf(value * PI_f * 0.5f);
        case AccelerateSine: // 19
            return 1.0f - zsinf(value * PI_f * 0.5f + HALF_PI_f);
        case DecelAccelSine: // 20
            value += value;
            if (1.0f > value) {
                return zsinf(value * PI_f * 0.5f) * 0.5f;
            } else {
                return (1.0f - zsinf(value * PI_f * 0.5f)) * 0.5f + 0.5f;
            }
        case AccelDecelSine: // 21
            value += value;
            if (1.0f > value) {
                return (1.0f - zsinf(value * PI_f * 0.5f + HALF_PI_f)) * 0.5f;
            } else {
                value = value - 1.0f;
                return zsinf(value * PI_f * 0.5f) * 0.5f + 0.5f;
            }
        case AccelParabolaA: // 22
            value = value - 0.25f;
            value = (value * value / (9.0f / 16.0f) - 1.0f / 9.0f) / (8.0f / 9.0f);
            return value;
        case AccelParabolaB: // 23
            value = value - 0.3f;
            value = (value * value / 0.49f - 9.0f / 49.0f) / (40.0f / 49.0f);
            return value;
        case AccelParabolaC: // 24
            value = value - 0.35f;
            value = (value * value / 0.4225f - 49.0f / 169.0f) / (120.0f / 169.0f);
            return value;
        case AccelParabolaD: // 25
            value = value - 0.38f;
            value = (value * value / 0.3844f - 361.0f / 961.0f) / (600.0f / 961.0f);
            return value;
        case AccelParabolaE: // 26
            value = value - 0.4f;
            value = (value * value / 0.36f - 4.0f / 9.0f) / (5.0f / 9.0f);
            return value;
        case DecelParabolaA: // 27
            value = 1.0f - value;
            value = value - 0.25f;
            value = (value * value / (9.0f / 16.0f) - 1.0f / 9.0f) / (8.0f / 9.0f);
            value = 1.0f - value;
            return value;
        case DecelParabolaB: // 28
            value = 1.0f - value;
            value = value - 0.3f;
            value = (value * value / 0.49f - 9.0f / 49.0f) / (40.0f / 49.0f);
            value = 1.0f - value;
            return value;
        case DecelParabolaC: // 29
            value = 1.0f - value;
            value = value - 0.35f;
            value = (value * value / 0.4225f - 49.0f / 169.0f) / (120.0f / 169.0f);
            value = 1.0f - value;
            return value;
        case DecelParabolaD: // 30
            value = 1.0f - value;
            value = value - 0.38f;
            value = (value * value / 0.3844f - 361.0f / 961.0f) / (600.0f / 961.0f);
            value = 1.0f - value;
            return value;
        case DecelParabolaE: // 31
            value = 1.0f - value;
            value = value - 0.4f;
            value = (value * value / 0.36f - 4.0f / 9.0f) / (5.0f / 9.0f);
            value = 1.0f - value;
            return value;
        case ForceFinal: interp_final: // 16
            return 1.0f;
        case ForceInitial: // 15
            return 0.0f;
    }
}

template <typename T, size_t modes = 1>
struct ZUNInterp { //       0x58    0x44    0x30
    //                      T3      T2      T1
    T initial_value; //     0x0     0x0     0x0
    T final_value; //       0xC     0x8     0x4
    T bezier1; //           0x18    0x10    0x8
    T bezier2; //           0x24    0x18    0xC
    T current; //           0x30    0x20    0x10
    Timer time; //          0x3C    0x28    0x14
    int32_t end_time; //    0x50    0x3C    0x28
    int32_t mode[modes]; // 0x54    0x40    0x2C

    inline ZUNInterp<T, modes>() : end_time(0) {}

    // float: 0x41F600
    // Float2: 0x439600
    // Float3: 0x405A00
    // Float3Ex: 0x439940
    // ZUNAngle: 0x47CBF0
    dllexport gnu_noinline void set_end_time(int32_t time) {
        this->end_time = time;
    }
    
    // Float3Ex: 0x439950
    dllexport gnu_noinline void set_current(const T& value) {
        this->current = value;
    }
    
    // float: 0x41B790
    // Float2: 0x4395C0
    // Float3Ex: 0x439900
    dllexport gnu_noinline void reset_end_time() {
        this->end_time = 0;
    }

    // float: 0x41F630
    // Float2: 0x439690
    // Float3: 0x405A10
    // ZUNAngle: 0x47CC40
    dllexport gnu_noinline void set_mode(int32_t mode) {
        this->mode[0] = mode;
    }

    // float: 0x41F620
    // Float2: 0x439670
    // Float3: 0x405A20
    // ZUNAngle: 0x47CC30
    dllexport gnu_noinline void set_initial_value(const T& value) {
        this->initial_value = value;
    }

    // float: 0x41F610
    // Float2: 0x439650
    // Float3: 0x405A40
    // Float3Ex: 0x4399B0
    // ZUNAngle: 0x47CC20
    dllexport gnu_noinline void set_final_value(const T& value) {
        this->final_value = value;
    }

    // float: 0x429A70
    // Float3: 0x405A60
    // Float3Ex: 0x439990
    // ZUNAngle: 0x47CC10
    dllexport gnu_noinline void set_bezier1(const T& value) {
        this->bezier1 = value;
    }

    // float: 0x429A60
    // Float3: 0x405A80
    // Float3Ex: 0x439970
    // ZUNAngle: 0x47CC00
    dllexport gnu_noinline void set_bezier2(const T& value) {
        this->bezier2 = value;
    }

    // float: 0x41F5D0
    // Float2: 0x4395D0
    // Float3: 0x405AA0
    // Float3Ex: 0x439910
    // ZUNAngle: 0x47CBC0
    dllexport gnu_noinline void reset_timer() {
        this->time.reset();
    }
    
    // int: 0x47CF40
    // float: 0x41F640
    // Float2: 0x4396A0
    // Float3Ex: 0x439A10
    // ZUNAngle: 0x47CC50
    dllexport T vectorcall step() {
        int32_t end_time = this->end_time;
        if (end_time > 0) {
            this->time.increment();
            end_time = this->end_time;
            if (this->time.current >= end_time) {
                this->time.set(end_time);
                goto TimeEnd;
            }
        } else if (end_time == 0) {
TimeEnd:
            int32_t mode = this->mode[0];
            if (mode != ConstantVelocity && mode != ConstantAccel) {
                return this->final_value;
            } else {
                return this->initial_value;
            }
        }
        T initial = this->initial_value;
        int32_t mode = this->mode[0];
        if (mode == ConstantVelocity) { // 7
            return this->current = this->initial_value = initial + this->final_value;
        }
        if (mode == ConstantAccel) { // 17
            T temp = this->bezier2;
            this->bezier2 = temp + this->final_value;
            return this->current = this->initial_value = initial + temp;
        }
        float current_time = this->time.current_f;
        float end_time_f = end_time;
        if (mode == Bezier) { // 8
            current_time /= end_time_f;
            float XMM3 = 1.0f - current_time;
            float XMM2 = current_time + current_time;
            float XMM5 = current_time - 1.0f;
            XMM3 *= XMM3;
            initial *= XMM5 * XMM5 * (XMM2 + 1.0f);
            initial += (3.0f - XMM2) * this->final_value * current_time * current_time;
            initial += XMM3 * this->bezier1 * current_time;
            initial += XMM5 * this->bezier2 * current_time * current_time;
            return this->current = initial;
        }
        else {
            float interp_value = __interp_inner_thing(mode, current_time, end_time_f);
            return this->current = lerp(initial, this->final_value, interp_value);
        }
    }

    forceinline void initialize(int32_t end_time, int32_t mode, const T& initial_value, const T& final_value) {
        this->set_end_time(end_time);
        this->set_mode(mode);
        this->set_bezier1({});
        this->set_bezier2({});
        this->set_initial_value(initial_value);
        this->set_final_value(final_value);
        this->reset_timer();
    }

    forceinline void initialize_bezier(int32_t end_time, int32_t mode, const T& initial_value, const T& final_value, const T& bezier1_value, const T& bezier2_value) {
        this->set_end_time(end_time);
        this->set_mode(Bezier); // ignores mode argument
        
    }
};
#pragma region // ZUNInterp Validation
ValidateFieldOffset32(0x0, ZUNInterp<float>, initial_value);
ValidateFieldOffset32(0x4, ZUNInterp<float>, final_value);
ValidateFieldOffset32(0x8, ZUNInterp<float>, bezier1);
ValidateFieldOffset32(0xC, ZUNInterp<float>, bezier2);
ValidateFieldOffset32(0x10, ZUNInterp<float>, current);
ValidateFieldOffset32(0x14, ZUNInterp<float>, time);
ValidateFieldOffset32(0x28, ZUNInterp<float>, end_time);
ValidateFieldOffset32(0x2C, ZUNInterp<float>, mode);
ValidateStructSize32(0x30, ZUNInterp<float>);
ValidateFieldOffset32(0x0, ZUNInterp<Float2>, initial_value);
ValidateFieldOffset32(0x8, ZUNInterp<Float2>, final_value);
ValidateFieldOffset32(0x10, ZUNInterp<Float2>, bezier1);
ValidateFieldOffset32(0x18, ZUNInterp<Float2>, bezier2);
ValidateFieldOffset32(0x20, ZUNInterp<Float2>, current);
ValidateFieldOffset32(0x28, ZUNInterp<Float2>, time);
ValidateFieldOffset32(0x3C, ZUNInterp<Float2>, end_time);
ValidateFieldOffset32(0x40, ZUNInterp<Float2>, mode);
ValidateStructSize32(0x44, ZUNInterp<Float2>);
ValidateFieldOffset32(0x0, ZUNInterp<Float3>, initial_value);
ValidateFieldOffset32(0xC, ZUNInterp<Float3>, final_value);
ValidateFieldOffset32(0x18, ZUNInterp<Float3>, bezier1);
ValidateFieldOffset32(0x24, ZUNInterp<Float3>, bezier2);
ValidateFieldOffset32(0x30, ZUNInterp<Float3>, current);
ValidateFieldOffset32(0x3C, ZUNInterp<Float3>, time);
ValidateFieldOffset32(0x50, ZUNInterp<Float3>, end_time);
ValidateFieldOffset32(0x54, ZUNInterp<Float3>, mode);
ValidateStructSize32(0x58, ZUNInterp<Float3>);
#pragma endregion

template <typename T, size_t size = 4>
struct ZUNInterpEx : ZUNInterp<T, size> { //     0x68    0x54    0x40
    //                      T3      T2      T1
    //int __dword_A; //     0x58    0x44    0x30
    //int __dword_B; //     0x5C    0x48    0x34
    //int32_t mode_3D; //   0x60    0x4C    0x38
    union {
        uint32_t flags; //  0x64    0x50    0x3C
        struct {
            uint32_t __unknown_flag_A : 1; // 1
        };
    };

    //inline ZUNInterpEx<T>() : end_time(0) {}
    
    // Float3Ex: 0x4399D0
    dllexport gnu_noinline void set_indexed_mode(int32_t index, int32_t mode) {
        this->__unknown_flag_A = true;
        this->mode[index] = mode;
    }
    
    // Float3Ex: 0x4399F0
    dllexport gnu_noinline void set_mode_3(int32_t mode) {
        this->__unknown_flag_A = false;
        this->mode[3] = mode;
    }
};
#pragma region // ZUNInterpEx Validation
ValidateFieldOffset32(0x0, ZUNInterpEx<float>, initial_value);
ValidateFieldOffset32(0x4, ZUNInterpEx<float>, final_value);
ValidateFieldOffset32(0x8, ZUNInterpEx<float>, bezier1);
ValidateFieldOffset32(0xC, ZUNInterpEx<float>, bezier2);
ValidateFieldOffset32(0x10, ZUNInterpEx<float>, current);
ValidateFieldOffset32(0x14, ZUNInterpEx<float>, time);
ValidateFieldOffset32(0x28, ZUNInterpEx<float>, end_time);
ValidateFieldOffset32(0x2C, ZUNInterpEx<float>, mode[0]);
ValidateFieldOffset32(0x3C, ZUNInterpEx<float>, flags);
ValidateFieldOffset32(0x0, ZUNInterpEx<Float2>, initial_value);
ValidateFieldOffset32(0x8, ZUNInterpEx<Float2>, final_value);
ValidateFieldOffset32(0x10, ZUNInterpEx<Float2>, bezier1);
ValidateFieldOffset32(0x18, ZUNInterpEx<Float2>, bezier2);
ValidateFieldOffset32(0x20, ZUNInterpEx<Float2>, current);
ValidateFieldOffset32(0x28, ZUNInterpEx<Float2>, time);
ValidateFieldOffset32(0x3C, ZUNInterpEx<Float2>, end_time);
ValidateFieldOffset32(0x40, ZUNInterpEx<Float2>, mode[0]);
ValidateFieldOffset32(0x50, ZUNInterpEx<Float2>, flags);
ValidateFieldOffset32(0x0, ZUNInterpEx<Float3>, initial_value);
ValidateFieldOffset32(0xC, ZUNInterpEx<Float3>, final_value);
ValidateFieldOffset32(0x18, ZUNInterpEx<Float3>, bezier1);
ValidateFieldOffset32(0x24, ZUNInterpEx<Float3>, bezier2);
ValidateFieldOffset32(0x30, ZUNInterpEx<Float3>, current);
ValidateFieldOffset32(0x3C, ZUNInterpEx<Float3>, time);
ValidateFieldOffset32(0x50, ZUNInterpEx<Float3>, end_time);
ValidateFieldOffset32(0x54, ZUNInterpEx<Float3>, mode[0]);
ValidateFieldOffset32(0x64, ZUNInterpEx<Float3>, flags);
#pragma endregion

#define SetInstr(value) \
current_instruction = (decltype(current_instruction))(value)

#define IndexInstr(offset) \
SetInstr((intptr_t)current_instruction + (offset))

#define ByteArg(number) \
(((uint8_t*)current_instruction->args)[(number)])

#define OneBitArg(number) \
(ByteArg(number) & 0b1)

#define ShortArg(number) \
(((int16_t*)current_instruction->args)[(number)])

#define RawArg(number) \
(((EclArg*)current_instruction->args)[(number)])

#define IntArg(number) \
(((int32_t*)current_instruction->args)[(number)])

#define UIntArg(number) \
(((uint32_t*)current_instruction->args)[(number)])

#define FloatArg(number) \
(((float*)current_instruction->args)[(number)])

#define Float2Arg(number) \
(((Float2*)current_instruction->args)[(number)])

#define Float3Arg(number) \
(((Float3*)current_instruction->args)[(number)])

#define StringArg(offset) \
((const char*)(current_instruction->args + (offset)))

#define TypeArg(type, number) \
(((type*)current_instruction->args)[(number)])

typedef struct EclVM EclVM;

// size: 0x54
struct EnemyInitData {
    Float3 position; // 0x0
    int32_t score; // 0xC
    int32_t item_drop; // 0x10
    int32_t life; // 0x14
    int32_t mirrored; // 0x18
    int32_t __basic_anm_update; // 0x1C
    int32_t int_vars[4]; // 0x20
    float float_vars[8]; // 0x30
    int32_t parent_id; // 0x50
};
#pragma region // EnemyInitData Validation
ValidateFieldOffset32(0x0, EnemyInitData, position);
ValidateFieldOffset32(0xC, EnemyInitData, score);
ValidateFieldOffset32(0x10, EnemyInitData, item_drop);
ValidateFieldOffset32(0x14, EnemyInitData, life);
ValidateFieldOffset32(0x18, EnemyInitData, mirrored);
ValidateFieldOffset32(0x1C, EnemyInitData, __basic_anm_update);
ValidateFieldOffset32(0x20, EnemyInitData, int_vars);
ValidateFieldOffset32(0x30, EnemyInitData, float_vars);
ValidateFieldOffset32(0x50, EnemyInitData, parent_id);
ValidateStructSize32(0x54, EnemyInitData);
#pragma endregion

// size: 0x10
struct EclInstruction {
    int32_t time; // 0x0
    int16_t opcode; // 0x4
    uint16_t offset_to_next; // 0x6
    uint16_t param_mask; // 0x8
    uint8_t difficulty_mask; // 0xA
    uint8_t param_count; // 0xB
    uint8_t stack_adjust; // 0xC
    padding_bytes(0x3); // 0xD
    unsigned char args[]; // 0x10
};
#pragma region // EclInstruction Validation
ValidateFieldOffset32(0x0, EclInstruction, time);
ValidateFieldOffset32(0x4, EclInstruction, opcode);
ValidateFieldOffset32(0x6, EclInstruction, offset_to_next);
ValidateFieldOffset32(0x8, EclInstruction, param_mask);
ValidateFieldOffset32(0xA, EclInstruction, difficulty_mask);
ValidateFieldOffset32(0xB, EclInstruction, param_count);
ValidateFieldOffset32(0xC, EclInstruction, stack_adjust);
ValidateFieldOffset32(0x10, EclInstruction, args);
ValidateStructSize32(0x10, EclInstruction);
#pragma endregion

#define EclStackCount 0x400
#define EclStackSize sizeof(EclStackItem[EclStackCount])

// size: 0x8
struct EclLocation {
    int32_t sub_index; // 0x0
    int32_t instruction_offset; // 0x4

    inline void reset() {
        this->instruction_offset = -1;
        this->sub_index = -1;
    }
};
#pragma region // EclLocation Validation
ValidateFieldOffset32(0x0, EclLocation, sub_index);
ValidateFieldOffset32(0x4, EclLocation, instruction_offset);
ValidateStructSize32(0x8, EclLocation);
#pragma endregion

// size: 0x40
struct EclSubName {
    char name[64]; // 0x0
};
#pragma region // EclSubName Validation
ValidateFieldOffset32(0x0, EclSubName, name);
ValidateStructSize32(0x40, EclSubName);
#pragma endregion

union EclRawValue {
    int32_t integer;
    float real;
    struct {
        char type;
        char type2;
    };
};

struct EclValue {
    char type;
    char type2;
    EclRawValue value;

    template<typename T>
    static forceinline T cast_to(const int32_t& value, const char& type) {
        if constexpr (std::is_same_v<T, int32_t>) {
            if (type == 'f') {
                return bitcast<int32_t>((float)value);
            } else {
                return value;
            }
        } else if constexpr (std::is_same_v<T, float>) {
            if (type != 'f' && type == 'i') {
                return (float)value;
            } else {
                return bitcast<float>(value);
            }
        }
    }

    template<typename T>
    forceinline T read() {
        return this->cast_to<T>(this->value.integer, this->type);
    }
};

using EclStackItem = EclRawValue;

// size: 0x1008
struct EclStack {

    union { // 0x0
        EclStackItem data[EclStackCount];
        uint8_t raw[EclStackSize];
    };
    int32_t pointer; // 0x1000
    int32_t base; // 0x1004

    template<typename T>
    forceinline T read_offset(int32_t offset) {
        return *based_pointer<T>(this->raw, offset);
    }
    template<typename T>
    forceinline T read_typed_offset(int32_t offset) {
        return based_pointer<EclValue>(this->raw, offset)->read<T>();
    }
    template<typename T>
    forceinline T read_local(int32_t offset, int32_t base_offset) {
        return this->read_offset<T>(base_offset + offset);
    }
    template<typename T>
    forceinline T read_local(T offset) {
        return this->read_local<T>((int32_t)offset, this->base);
    }
    /*
    template<typename T>
    forceinline T read_temp(int32_t offset, int32_t top_offset) {
        return this->read_offset<T>(top_offset - offset);
    }
    template<typename T>
    forceinline T read_temp(int32_t offset) {
        return this->read_temp<T>(offset, this->pointer);
    }
    */
    template<typename T>
    forceinline T read_temp(T index, int32_t top_offset);
    template<>
    forceinline int32_t read_temp<int32_t>(int32_t index, int32_t top_offset) {
        return this->read_typed_offset<int32_t>(top_offset + index * sizeof(EclValue));
    }
    template<>
    forceinline float read_temp<float>(float index, int32_t top_offset) {
        index *= -(float)sizeof(EclValue);
        return this->read_typed_offset<float>(top_offset - (int32_t)index);
    }

    template<typename T>
    forceinline T read_temp(T index) {
        return this->read_temp<T>(index, this->pointer);
    }

    template<typename T>
    forceinline void write_offset(int32_t offset, const T& value) {
        *based_pointer<T>(this->raw, offset) = value;
    }
    template<typename T>
    forceinline void write_local(int32_t offset, const T& value, int32_t base_offset) {
        this->write_offset<T>(base_offset + offset, value);
    }
    template<typename T>
    forceinline void write_local(T offset, const T& value) {
        this->write_local<T>((int32_t)offset, value, this->base);
    }
    
    template<typename T>
    forceinline void write_temp(int32_t index, const T& value, int32_t top_offset) {
        this->write_offset<T>(top_offset - index * sizeof(int32_t), value);
    }
    template<typename T>
    forceinline void write_temp(int32_t index, const T& value) {
        this->write_temp<T>(index, value, this->pointer);
    }
    

    template<typename T>
    forceinline T& ref_offset(int32_t offset) {
        return *based_pointer<T>(this->raw, offset);
    }
    template<typename T>
    forceinline T& ref_local(int32_t offset, int32_t base_offset) {
        return this->ref_offset<T>(base_offset + offset);
    }
    template<typename T>
    forceinline T& ref_local(T offset) {
        return this->ref_local<T>((int32_t)offset, this->base);
    }
    
    template<typename T>
    forceinline T& ref_temp(int32_t index, int32_t top_offset) {
        return this->ref_offset<T>(top_offset - index * sizeof(int32_t));
    }
    template<typename T>
    forceinline T& ref_temp(int32_t index) {
        return this->ref_temp<T>(index, this->pointer);
    }
    

    template<typename T>
    forceinline void push(int32_t& starting_offset, const T& value) {
        this->write_offset(starting_offset, value);
        starting_offset += sizeof(int32_t);
    }

    template<typename T>
    forceinline void push(const T& value) {
        this->push(this->pointer, value);
    }

    template<typename T>
    forceinline T pop(int32_t& starting_offset) {
        starting_offset -= sizeof(int32_t);
        return this->read_offset<T>(starting_offset);
    }
    template<typename T>
    forceinline T pop() {
        return this->pop<T>(this->pointer);
    }

    template<typename T>
    forceinline T pop_cast(int32_t& starting_offset) {
        return EclValue::cast_to<T>(this->pop<int32_t>(), this->pop<char>());
    }
    template<typename T>
    forceinline T pop_cast() {
        return this->pop_cast<T>(this->pointer);
    }
    
    template<typename L> requires(FunctionTraitsType<L>::arg_count == 1)
    void unary_op(const L& func) {
        using T = typename FunctionTraitsType<L>::template nth_arg_type<0>;
        using P = typename FunctionTraitsType<L>::ret_type;
        this->push<P>(func(this->pop_cast<T>()));
    }

    template<typename L> requires(FunctionTraitsType<L>::arg_count == 2 && std::is_same_v<typename FunctionTraitsType<L>::template nth_arg_type<0>, typename FunctionTraitsType<L>::template nth_arg_type<1>>)
    void binary_op(const L& func) {
        using T = typename FunctionTraitsType<L>::template nth_arg_type<0>;
        using P = typename FunctionTraitsType<L>::ret_type;
        T right = this->pop_cast<T>();
        T left = this->pop_cast<T>();
        this->push<P>(func(left, right));
    }

    inline void zero_contents() {
        zero_this();
    }

    inline EclStack() {
        this->zero_contents();
    }
};
#pragma region // EclStack Validation
ValidateFieldOffset32(0x0, EclStack, data);
ValidateFieldOffset32(0x1000, EclStack, pointer);
ValidateFieldOffset32(0x1004, EclStack, base);
ValidateStructSize32(0x1008, EclStack);
#pragma endregion

// size: 0x1208
struct EclContext {
    float time; // 0x0
    EclLocation location; // 0x4
    EclStack stack; // 0xC
    int32_t async_id; // 0x1014
    EclVM* vm; // 0x1018
    int32_t __int_101C; // 0x101C
    uint8_t difficulty_mask; // 0x1020
    padding_bytes(3);
    ZUNInterp<float> float_interps[8]; // 0x1024
    int32_t float_interp_stack_offsets[8]; // 0x11A4
    EclLocation float_interp_locations[8]; // 0x11C4
    union {
        uint32_t flags; // 0x1204
        struct {
            uint32_t __unknown_flag_A : 1;
        };
    };
    // 0x1208

    inline void set_float_interp_times(int32_t value) {
        this->float_interps[0].end_time = value;
        this->float_interps[1].end_time = value;
        this->float_interps[2].end_time = value;
        this->float_interps[3].end_time = value;
        this->float_interps[4].end_time = value;
        this->float_interps[5].end_time = value;
        this->float_interps[6].end_time = value;
        this->float_interps[7].end_time = value;
    }

    inline EclInstruction* get_instruction(int32_t sub_index, int32_t instruction_offset);

    // 0x48DBE0
    dllexport EclInstruction* thiscall EclContext::get_current_instruction() asm_symbol_rel(0x48DBE0) {
        int32_t instr_offset = this->location.instruction_offset;
        if (instr_offset != -1) {
            int32_t sub_index = this->location.sub_index;
            if (sub_index != -1) {
                return this->get_instruction(sub_index, instr_offset);
            }
        }
        return NULL;
    }

    inline void step_float_interps();

    forceinline int32_t thiscall get_int_arg(int32_t index, EclInstruction* current_instruction);

    // 0x48D4F0
    dllexport gnu_noinline int32_t thiscall get_int_arg(int32_t index) asm_symbol_rel(0x48D4F0);

    forceinline float vectorcall get_float_arg(int32_t index, EclInstruction* current_instruction);

private:
    // 0x48D5A0
    dllexport gnu_noinline float vectorcall get_float_arg(int32_t, int32_t index) asm_symbol_rel(0x48D5A0);

public:
    forceinline float get_float_arg(int32_t index) {
        return this->get_float_arg(UNUSED_DWORD, index);
    }

    forceinline int32_t thiscall parse_int_as_arg_pop(int32_t index, int32_t value, EclInstruction* current_instruction);

    // 0x48D690
    dllexport gnu_noinline int32_t thiscall parse_int_as_arg_pop(int32_t index, int32_t value) asm_symbol_rel(0x48D690);

    forceinline float vectorcall parse_float_as_arg_pop(int32_t index, float value, EclInstruction* current_instruction);

    inline float vectorcall parse_float_as_arg_pop(int32_t index, float value);

    forceinline int32_t* thiscall get_int_ptr_arg(int32_t index, EclInstruction* current_instruction);

    // 0x48D750
    dllexport gnu_noinline int32_t* thiscall get_int_ptr_arg(int32_t index = UNUSED_DWORD) asm_symbol_rel(0x48D750);

    forceinline float* thiscall get_float_ptr_arg(int32_t index, EclInstruction* current_instruction);

    // 0x48D7C0
    dllexport gnu_noinline float* thiscall get_float_ptr_arg(int32_t index) asm_symbol_rel(0x48D7C0);

    forceinline int32_t thiscall parse_int_as_arg(int32_t index, int32_t value, EclInstruction* current_instruction);

    forceinline int32_t thiscall parse_int_as_arg(int32_t index, int32_t value);

    forceinline float parse_float_as_arg(int32_t index, float value, EclInstruction* current_instruction);

    forceinline float parse_float_as_arg(int32_t index, float value);

    // 0x42CCC0
    dllexport gnu_noinline EclContext() noexcept(true) {}

    // 0x48B030
    dllexport gnu_noinline ZunResult thiscall call(EclContext* new_context, int32_t va_index, int32_t = UNUSED_DWORD) asm_symbol_rel(0x48B030);

private:
    // 0x48B3A0
    dllexport gnu_noinline ZunResult vectorcall low_ecl_run(float, float current_gamespeed) asm_symbol_rel(0x48B3A0);

public:
    forceinline ZunResult low_ecl_run(float current_gamespeed) {
        return this->low_ecl_run(UNUSED_FLOAT, current_gamespeed);
    }
};
#pragma region // EclContext Validation
ValidateFieldOffset32(0x0, EclContext, time);
ValidateFieldOffset32(0x4, EclContext, location);
ValidateFieldOffset32(0xC, EclContext, stack);
ValidateFieldOffset32(0x1014, EclContext, async_id);
ValidateFieldOffset32(0x1018, EclContext, vm);
ValidateFieldOffset32(0x101C, EclContext, __int_101C);
ValidateFieldOffset32(0x1024, EclContext, float_interps);
ValidateFieldOffset32(0x11A4, EclContext, float_interp_stack_offsets);
ValidateFieldOffset32(0x11C4, EclContext, float_interp_locations);
ValidateFieldOffset32(0x1204, EclContext, flags);
ValidateStructSize32(0x1208, EclContext);
#pragma endregion

using BulletEffectType = enum BulletEffectType : uint32_t;

// size: 0x2C
struct BulletEffectArgs {
    float float_values[4]; // 0x0
    int32_t int_values[4]; // 0x10
    BulletEffectType type; // 0x20
    int32_t async; // 0x24
    char* string; // 0x28
    // 0x2C
};
#pragma region // BulletEffectArgs Validation
ValidateFieldOffset32(0x0, BulletEffectArgs, float_values);
ValidateFieldOffset32(0x10, BulletEffectArgs, int_values);
ValidateFieldOffset32(0x20, BulletEffectArgs, type);
ValidateFieldOffset32(0x24, BulletEffectArgs, async);
ValidateFieldOffset32(0x28, BulletEffectArgs, string);
ValidateStructSize32(0x2C, BulletEffectArgs);
#pragma endregion

// size: 0x488
struct ShooterData {
    int32_t type; // 0x0
    int32_t color; // 0x4
    Float3 position; // 0x8
    float angle1; // 0x14
    float angle2; // 0x18
    float speed1; // 0x1C
    float speed2; // 0x20
    float distance; // 0x24
    BulletEffectArgs effects[24]; // 0x28
    unknown_fields(0x10); // 0x448
    int32_t start_time; // 0x458
    int32_t __transform_A; // 0x45C
    int32_t duration; // 0x460
    int32_t __transform_B; // 0x464
    int32_t stop_time; // 0x468
    int16_t count1; // 0x46C
    int16_t count2; // 0x46E
    int32_t aim_mode; // 0x470
    union {
        uint32_t flags; // 0x474
        struct {
            uint32_t : 5;
            uint32_t play_sound_on_spawn : 1;
        };
    };
    int32_t shoot_sound; // 0x478
    int32_t transform_sound; // 0x47C
    int32_t start_transform; // 0x480
    int __dword_484; // 0x484
    // 0x488

    inline void zero_contents() {
        zero_this();
    }

    inline ShooterData() {
        this->zero_contents();
        this->transform_sound = -1;
    }

    inline ShooterData(int) {}
};
#pragma region // ShooterData Validation
ValidateFieldOffset32(0x0, ShooterData, type);
ValidateFieldOffset32(0x4, ShooterData, color);
ValidateFieldOffset32(0x8, ShooterData, position);
ValidateFieldOffset32(0x14, ShooterData, angle1);
ValidateFieldOffset32(0x18, ShooterData, angle2);
ValidateFieldOffset32(0x1C, ShooterData, speed1);
ValidateFieldOffset32(0x20, ShooterData, speed2);
ValidateFieldOffset32(0x24, ShooterData, distance);
ValidateFieldOffset32(0x28, ShooterData, effects);
ValidateFieldOffset32(0x458, ShooterData, start_time);
ValidateFieldOffset32(0x45C, ShooterData, __transform_A);
ValidateFieldOffset32(0x460, ShooterData, duration);
ValidateFieldOffset32(0x464, ShooterData, __transform_B);
ValidateFieldOffset32(0x468, ShooterData, stop_time);
ValidateFieldOffset32(0x46C, ShooterData, count1);
ValidateFieldOffset32(0x46E, ShooterData, count2);
ValidateFieldOffset32(0x470, ShooterData, aim_mode);
ValidateFieldOffset32(0x474, ShooterData, flags);
ValidateFieldOffset32(0x478, ShooterData, shoot_sound);
ValidateFieldOffset32(0x47C, ShooterData, transform_sound);
ValidateFieldOffset32(0x480, ShooterData, start_transform);
ValidateFieldOffset32(0x484, ShooterData, __dword_484);
ValidateStructSize32(0x488, ShooterData);
#pragma endregion

typedef struct AnmManager AnmManager;

#define ANM_FULL_ID_BITS (32)
#define ANM_FAST_ID_BITS (15)
#define ANM_SLOW_ID_BITS (ANM_FULL_ID_BITS - ANM_FAST_ID_BITS)
#define INVALID_FAST_ID uint_width_max(ANM_FAST_ID_BITS)

// size: 0x4
union AnmID {
    uint32_t full;
    struct {
        uint32_t fast_id : ANM_FAST_ID_BITS;
        uint32_t slow_id : ANM_SLOW_ID_BITS;
    };

    inline constexpr AnmID() : full(0) {}

    inline constexpr AnmID(const AnmID& id) : full(id.full) {}

    template<typename T> requires(std::is_integral_v<T>)
    inline constexpr AnmID(const T& raw) : full(raw) {}

    // 0x488E30
    dllexport AnmVM* get_vm_ptr() asm_symbol_rel(0x488E30);

    // 0x488E50
    dllexport void interrupt_tree(int32_t interrupt_index) asm_symbol_rel(0x488E50);

    // 0x488E70
    dllexport void __unknown_tree_set_J() asm_symbol_rel(0x488E70);

    inline void __unknown_tree_set_J(AnmManager* anm_manager);

    // 0x488EB0
    dllexport void __unknown_tree_clear_J() asm_symbol_rel(0x488EB0);

    // 0x488F50
    dllexport void mark_tree_for_delete() asm_symbol_rel(0x488F50);

    inline void mark_tree_for_delete(AnmManager* anm_manager);

    // 0x488F70
    dllexport void thiscall set_controller_position(Float3* position) asm_symbol_rel(0x488F70);

    // 0x488FD0
    dllexport void thiscall __sub_488FD0(int32_t script) asm_symbol_rel(0x488FD0);

    // 0x4892F0
    dllexport void thiscall set_color1(D3DCOLOR color) asm_symbol_rel(0x4892F0);

    inline constexpr operator uint32_t() const {
        return this->full;
    }
    template<typename T> requires(std::is_integral_v<T>)
    inline constexpr AnmID& operator=(const T& raw) {
        this->full = raw;
        return *this;
    }

    AnmID thiscall __sub_489140();
};
#pragma region // AnmID Validation
ValidateFieldOffset32(0x0, AnmID, full);
ValidateStructSize32(0x4, AnmID);
#pragma endregion
/*
// size: 0x4
union AnmVMRef {
    AnmID* id; // 0x0
    AnmVM* vm; // 0x0

    inline AnmVMRef() : id(NULL) {}
    
    inline AnmVMRef(AnmID& id_ref) : id(&id_ref) {}

    // 0x488E30
    dllexport AnmVM* get_vm_ptr() asm_symbol_rel(0x488E30);

    // 0x488E50
    dllexport void interrupt_tree(int32_t interrupt_index) asm_symbol_rel(0x488E50);

    // 0x488E70
    dllexport void __unknown_tree_set_J() asm_symbol_rel(0x488E70);

    inline void __unknown_tree_set_J(AnmManager* anm_manager);

    // 0x488EB0
    dllexport void __unknown_tree_clear_J() asm_symbol_rel(0x488EB0);

    // 0x488F50
    dllexport void mark_tree_for_delete() asm_symbol_rel(0x488F50);

    inline void mark_tree_for_delete(AnmManager* anm_manager);

    // 0x488F70
    dllexport void thiscall set_controller_position(Float3* position) asm_symbol_rel(0x488F70);

    // 0x4892F0
    dllexport void thiscall set_color1(D3DCOLOR color) asm_symbol_rel(0x4892F0);
};
#pragma region // AnmVMRef Validation
ValidateFieldOffset32(0x0, AnmVMRef, id);
ValidateFieldOffset32(0x0, AnmVMRef, vm);
ValidateStructSize32(0x4, AnmVMRef);
#pragma endregion
*/

using EnemyID = uint32_t;

// size: 0x88
struct EnemyCallback {
    int32_t life; // 0x0
    int32_t time; // 0x4
    EclSubName __sub_A; // 0x8
    EclSubName __sub_B; // 0x48

    inline void initialize() {
        this->life = -1;
        this->time = -1;
        this->__sub_A.name[0] = '\0';
    }
};

// WEIRD CALLING CONVENTION
struct HitboxManager {
private:
    // 0x45F0F0
    static dllexport gnu_noinline int32_t vectorcall enm_compute_damage_sources(int32_t, int32_t, Float3* position, Float2* sizeA, float, float, float, float rotation, float sizeB, int32_t& arg5, Float3* hit_position_out, BOOL arg7, int32_t enemy_id) asm_symbol_rel(0x45F0F0) {
        
    }
public:
    static forceinline int32_t enm_compute_damage_sources(Float3* position, Float2* sizeA, float sizeB, float rotation, int32_t& arg5, Float3* hit_position_out, BOOL arg7, int32_t enemy_id) {
        return enm_compute_damage_sources(UNUSED_DWORD, UNUSED_DWORD, position, sizeA, UNUSED_FLOAT, UNUSED_FLOAT, UNUSED_FLOAT, rotation, sizeB, arg5, hit_position_out, arg7, enemy_id);
    }
};

struct Bomb : ZUNTask {
    // ZUNTask base; // 0x0
    unknown_fields(0x24); // 0xC
    BOOL bomb_active; // 0x30
};

extern "C" {
    extern Bomb* BOMB_PTR asm("_BOMB_PTR");
}

// size: 0x5600
struct EnemyData {

    // size: 0x1C
    struct EnemyLife {
        int32_t current; // 0x0
        int32_t maximum; // 0x4
        int32_t remaining_current_attack; // 0x8
        int32_t current_scaled_by_seven; // 0xC
        int32_t starting_value_for_next_attack; // 0x10
        int32_t total_damage_including_ignored; // 0x14
        union {
            uint32_t flags; // 0x18
            struct {
                uint32_t is_spell : 1; // 1
                uint32_t __unknown_flag_A : 1; // 2
            };
        };

        inline void initialize() {
            this->__unknown_flag_A = false;
            this->current = 0;
            this->maximum = 0;
            this->remaining_current_attack = 0;
            this->total_damage_including_ignored = 0;
        }

        // 0x42CF80
        dllexport gnu_noinline int32_t get_current() asm_symbol_rel(0x42CF80) {
            return this->current;
        }

        // 0x42CF90
        dllexport gnu_noinline void set_current_scaled(int32_t value) asm_symbol_rel(0x42CF90) {
            this->current_scaled_by_seven = value * 7;
        }

        // 0x42CFB0
        dllexport gnu_noinline void set_spell(bool value) asm_symbol_rel(0x42CFB0) {
            this->is_spell = value;
        }

        // 0x42CFD0
        dllexport gnu_noinline int32_t get_maximum() asm_symbol_rel(0x42CFD0) {
            return this->maximum;
        }

        // 0x42CFE0
        dllexport gnu_noinline void set_maximum(int32_t value) asm_symbol_rel(0x42CFE0) {
            this->maximum = value;
        }

        // 0x42CFF0
        dllexport gnu_noinline void set_current_remaining(int32_t value) asm_symbol_rel(0x42CFF0) {
            this->remaining_current_attack = value;
        }

        // 0x42D000
        dllexport gnu_noinline void set_current(int32_t value) asm_symbol_rel(0x42D000) {
            this->current = value;
        }
    };
    // size: 0xC4
    struct EnemyDrops {
        int32_t main_id; // 0x0
        int32_t extra_ids[20]; // 0x4
        int32_t limited_extra_ids[20]; // 0x54
        int32_t limited_end_time; // 0xA4
        Timer limited_timer; // 0xA8
        float width; // 0xBC
        float height; // 0xC0

        // 0x42D010
        dllexport gnu_noinline void set_extra_drop(int32_t index, int32_t id) asm_symbol_rel(0x42D010) {
            this->extra_ids[index - 1] = id;
        }

        // 0x42D020
        dllexport gnu_noinline void set_limited_extra_drop(int32_t index, int32_t id) asm_symbol_rel(0x42D020) {
            this->limited_extra_ids[index - 1] = id;
        }

        // 0x42D040
        dllexport gnu_noinline void set_limited_drop_time(int32_t time) asm_symbol_rel(0x42D040) {
            this->limited_end_time = time;
            this->limited_timer.reset();
        }

        // 0x42D090
        dllexport gnu_noinline void vectorcall set_area(float width, float height) asm_symbol_rel(0x42D090) {
            this->width = width;
            this->height = height;
        }

        // 0x42D0B0
        dllexport gnu_noinline void set_main_drop(int32_t id) asm_symbol_rel(0x42D0B0) {
            this->main_id = id;
        }

        // 0x42D0C0
        dllexport gnu_noinline void spawn_items() asm_symbol_rel(0x42D0C0);

        // 0x42D110
        dllexport gnu_noinline void initialize() asm_symbol_rel(0x42D110) {
            //memset(this, 0, sizeof(*this));
            zero_this();
            this->height = 32.0f;
            this->width = 32.0f;
            this->limited_timer.reset();
        }

        // 0x42D180
        dllexport gnu_noinline void reset_extra_drops() asm_symbol_rel(0x42D180) {
            memset(this->extra_ids, 0, sizeof(this->extra_ids) + sizeof(this->limited_extra_ids));
            this->limited_end_time = 0;
            this->limited_timer.reset();
        }
    };
    // size: 0x1C
    struct EnemyFog {
        void* fog_ptr; // 0x0
        unknown_fields(0x4); // 0x4
        float radius; // 0x8
        float __float_C; // 0xC
        D3DCOLOR color; // 0x10
        float __angle_14; // 0x14
        float __angle_18; // 0x18
    };

    MotionData previous_motion; // 0x0, 0x122C
    MotionData current_motion; // 0x44, 0x1270
    ZUNAbsRel<MotionData> motion; // 0x88, 0x12B4
    Float2 hurtbox_size; // 0x110, 0x133C
    Float2 hitbox_size; // 0x118, 0x1344
    float hurtbox_rotation; // 0x120, 0x134C
    AnmID anm_vms[16]; // 0x124, 0x1350
    Float3 anm_positions[16]; // 0x164, 0x1390
    int32_t anm_vm_indices[16]; // 0x224, 0x1450
    int32_t anm_source_index; // 0x264, 0x1490
    int32_t anm_slot_0_source_index; // 0x268, 0x1494
    int32_t anm_slot_0_script; // 0x26C, 0x1498
    int32_t current_anm_script; // 0x270, 0x149C
    int32_t current_anm_pose; // 0x274, 0x14A0
    int32_t kill_id; // 0x278, 0x14A4
    int32_t anm_base_layer; // 0x27C, 0x14A8
    Float3 position_of_last_damage_source_to_hit; // 0x280, 0x14AC
    int32_t int_vars[4]; // 0x28C, 0x14B8
    float float_vars[8]; // 0x29C, 0x14C8
    Timer ecl_time; // 0x2BC, 0x14E8
    Timer boss_timer; // 0x2D0, 0x14FC
    float slowdown; // 0x2E4, 0x1510
    ZUNLinkedList<Enemy> global_list_node; // 0x2E8, 0x1514
    ZUNAbsRel<ZUNInterpEx<Float3>> position_interp; // 0x2F8, 0x1524
    ZUNInterp<float> angle_interp_absolute; // 0x3C8, 0x15F4
    ZUNInterp<float> speed_interp_absolute; // 0x3F8, 0x1624
    ZUNInterp<float> angle_interp_relative; // 0x428, 0x1654
    ZUNInterp<float> speed_interp_relative; // 0x458, 0x1684
    ZUNAbsRel<ZUNInterp<Float2>> orbit_radius_interp; // 0x488, 0x16B4
    ZUNAbsRel<ZUNInterp<Float2>> ellipse_interp; // 0x510, 0x173C
    ShooterData shooters[16]; // 0x598, 0x17C4
    int32_t bullet_effect_indices[16]; // 0x4E18, 0x6044
    Float3 shooter_offsets[16]; // 0x4E58, 0x6084
    Float3 shooter_origins[16]; // 0x4F18, 0x6144
    Float2 final_sprite_size; // 0x4FD8, 0x6204
    Float2 move_bounds_center; // 0x4FE0, 0x620C
    Float2 move_bounds_size; // 0x4FE8, 0x6214
    int32_t score; // 0x4FF0, 0x621C
    EnemyLife life; // 0x4FF4, 0x6220
    EnemyDrops drops; // 0x5010, 0x623C
    int32_t __int_50D4; // 0x50D4, 0x6300
    int32_t death_sound; // 0x50D8, 0x6304
    int32_t death_anm_script; // 0x50DC, 0x6308
    int32_t death_anm_index; // 0x50E0, 0x630C
    int32_t __int_50E4; // 0x50E4, 0x6310
    int __dword_50E8; // 0x50E8, 0x6314
    int32_t hit_sound; // 0x50EC, 0x6318
    Timer invulnerable_timer; // 0x50F0, 0x631C
    Timer no_hitbox_timer; // 0x5104, 0x6330
    Timer __timer_5118; // 0x5118, 0x6344
    float bomb_damage_multiplier; // 0x512C, 0x6358
    union {
        uint32_t flags_low; // 0x5130, 0x635C
        struct {
            uint32_t disable_hurtbox : 1; // 1
            uint32_t disable_hitbox : 1; // 2
            uint32_t offscreen_immune_horizontal : 1; // 3
            uint32_t offscreen_immune_vertical : 1; // 4
            uint32_t invincible : 1; // 5
            uint32_t intangible : 1; // 6
            uint32_t __is_midboss : 1; // 7
            uint32_t no_delete : 1; // 8
            uint32_t always_delete : 1; // 9
            uint32_t grazable : 1; // 10
            uint32_t only_dialogue_delete : 1; // 11
            uint32_t delete_as_bullet : 1; // 12
            uint32_t rectangular_hitbox : 1; // 13
            uint32_t slowdown_immune : 1; // 14
            uint32_t __unknown_flag_E : 1; // 15
            uint32_t __unknown_flag_F : 1; // 16
            uint32_t __unknown_flag_G : 1; // 17
            uint32_t move_bounds_enable : 1; // 18
            uint32_t __unknown_flag_A : 1; // 19
            uint32_t mirrored : 1; // 20
            uint32_t __unknown_flag_I : 1; // 21
            uint32_t __alive : 1; // 22
            uint32_t __delete_related : 1; // 23 like is_boss, but skips something in the GUI code
            uint32_t is_boss : 1; // 24
            uint32_t __unknown_flag_L : 1; // 25
            uint32_t __unknown_flag_B : 1; // 26
            uint32_t __basic_anm_update : 1; // 27
            uint32_t homing_disable : 1; // 28
            uint32_t bomb_shield : 1; // 29
            uint32_t bomb_shield_active : 1; // 30
            uint32_t __unknown_flag_O : 1; // 31
            uint32_t __anm_related_A : 1; // 32
        };
    };
    union {
        uint32_t flags_high; // 0x5134, 0x6360
        struct {
            uint32_t __anm_slowdown_immune : 1; // 1
            uint32_t : 1; // 2
            uint32_t __unknown_flag_P : 1; // 3
        };
    };
    int32_t bombshield_on_anm; // 0x5138, 0x6364
    int32_t bombshield_off_anm; // 0x513C, 0x6368
    int32_t boss_id; // 0x5140, 0x636C
    float player_protect_radius; // 0x5144, 0x6370
    EnemyCallback callbacks[8]; // 0x5148, 0x6374
    EclVM* vm; // 0x5588, 0x67B4
    EnemyFog fog; // 0x558C, 0x67B8
    EclSubName death_callback_sub; // 0x55A8, 0x67D4
    ZunResult(thiscall *func_set_func)(EnemyData*); // 0x55E8, 0x6814
    uint32_t __is_func_set_2; // 0x55EC, 0x6818
    void* extra_damage_func; // 0x55F0, 0x681C
    void* extra_hitbox_func; // 0x55F4, 0x6820
    int32_t chapter; // 0x55F8, 0x6824
    int32_t chapter_spawn_weight; // 0x55FC, 0x6828
    // 0x5600, 0x682C

    inline EnemyData() {
        zero_this();
    }

    inline void initialize_callbacks() {
        this->callbacks[0].initialize();
        this->callbacks[1].initialize();
        this->callbacks[2].initialize();
        this->callbacks[3].initialize();
        this->callbacks[4].initialize();
        this->callbacks[5].initialize();
        this->callbacks[6].initialize();
        this->callbacks[7].initialize();
    }

    inline void initialize_anm_vm_ids() {
        this->anm_vm_indices[0] = -1;
        this->anm_vm_indices[1] = -1;
        this->anm_vm_indices[2] = -1;
        this->anm_vm_indices[3] = -1;
        this->anm_vm_indices[4] = -1;
        this->anm_vm_indices[5] = -1;
        this->anm_vm_indices[6] = -1;
        this->anm_vm_indices[7] = -1;
        this->anm_vm_indices[8] = -1;
        this->anm_vm_indices[9] = -1;
        this->anm_vm_indices[10] = -1;
        this->anm_vm_indices[11] = -1;
        this->anm_vm_indices[12] = -1;
        this->anm_vm_indices[13] = -1;
        this->anm_vm_indices[14] = -1;
        this->anm_vm_indices[15] = -1;
    }

    inline void set_anm_vm_slowdowns(const float& slowdown_value);

    inline void initialize(Enemy* enemy);

    // 0x42D1E0
    dllexport gnu_noinline MotionData& get_current_motion() asm_symbol_rel(0x42D1E0) {
        return this->current_motion;
    }

    // 0x42D1F0
    dllexport gnu_noinline EnemyLife& get_life_data() asm_symbol_rel(0x42D1F0) {
        return this->life;
    }

    forceinline bool get_mirror_flag() {
        return this->mirrored;
    }

    inline void enforce_move_bounds() {
        if (this->move_bounds_enable) {
            float x_limit_size = this->move_bounds_size.x * 0.5f;
            float x_limit_pos = this->move_bounds_center.x;
            float x_pos = this->current_motion.position.x;
            {
                float temp = x_limit_pos - x_limit_size;
                if (temp > x_pos) {
                    this->current_motion.position.x = temp;
                } else {
                    temp = x_limit_pos + x_limit_size;
                    if (x_pos > temp) {
                        this->current_motion.position.x = temp;
                    }
                }
            }
            float y_limit_size = this->move_bounds_size.y * 0.5f;
            float y_limit_pos = this->move_bounds_center.y;
            float y_pos = this->current_motion.position.y;
            {
                float temp = y_limit_pos - y_limit_size;
                if (temp > y_pos) {
                    this->current_motion.position.y = temp;
                } else {
                    temp = y_limit_pos + y_limit_size;
                    if (y_pos > temp) {
                        this->current_motion.position.y = temp;
                    }
                }
            }
            this->motion.absolute.position = this->current_motion.position - this->motion.relative.position;
        }
    }

    // 0x42EC00
    dllexport gnu_noinline void update_current_motion() asm_symbol_rel(0x42EC00) {
        this->current_motion.axis_velocity = this->motion.relative.position + this->motion.absolute.position - this->current_motion.position;
        this->current_motion.update();
        this->enforce_move_bounds();
    }

    // 0x430D40
    dllexport gnu_noinline int32_t thiscall high_ecl_run() asm_symbol_rel(0x430D40);

    // 0x438AA0
    dllexport gnu_noinline int32_t thiscall get_int_arg(int32_t index) asm_symbol_rel(0x438AA0);

    // 0x438AC0
    dllexport gnu_noinline int32_t* thiscall get_int_ptr_arg(int32_t index = UNUSED_DWORD) asm_symbol_rel(0x438AC0);

private:
    // 0x438AD0
    dllexport gnu_noinline float vectorcall get_float_arg(int32_t, int32_t index) asm_symbol_rel(0x438AD0);

public:
    forceinline float get_float_arg(int32_t index) {
        return this->get_float_arg(UNUSED_DWORD, index);
    }

    // 0x438AF0
    dllexport gnu_noinline float* thiscall get_float_ptr_arg(int32_t index) asm_symbol_rel(0x438AF0);

    // 0x438B10
    dllexport gnu_noinline int32_t thiscall parse_int_as_arg(int32_t index, int32_t value) asm_symbol_rel(0x438B10);

private:
    // 0x438BC0
    dllexport gnu_noinline float vectorcall parse_float_as_arg(int32_t, int32_t index, float, float, float value) asm_symbol_rel(0x438BC0);

public:
    forceinline float parse_float_as_arg(int32_t index, float value) {
        return this->parse_float_as_arg(UNUSED_DWORD, index, UNUSED_FLOAT, UNUSED_FLOAT, value);
    }

    // 0x4369E0
    dllexport gnu_noinline int32_t thiscall ecl_enm_create() asm_symbol_rel(0x4369E0);

    // 0x42E5A0
    dllexport gnu_noinline ZunResult thiscall __move() asm_symbol_rel(0x42E5A0) {
        clang_noinline this->previous_motion = this->current_motion;
        // TODO: Finish this function and all the giga-jank in it

        return ZUN_SUCCESS;
    }

    forceinline ZunResult thiscall update();

    // 0x42ED40
    dllexport gnu_noinline ZunResult thiscall __update_state() asm_symbol_rel(0x42ED40) {
        Bomb* bomb_ptr = BOMB_PTR;
        if (this->bomb_shield) {
            if (bomb_ptr->bomb_active && !this->bomb_shield_active) {
                this->anm_vms[0].__sub_488FD0(this->current_anm_script = this->bombshield_on_anm);
                this->disable_hurtbox = true;
                this->bomb_shield_active = true;
            } else if (this->bomb_shield_active) {
                this->anm_vms[0].__sub_488FD0(this->current_anm_script = this->bombshield_off_anm);
                this->disable_hurtbox = false;
                this->bomb_shield_active = false;
            }
        } else if (this->bomb_shield_active) {
            this->anm_vms[0].__sub_488FD0(this->current_anm_script = this->bombshield_off_anm);
            this->disable_hurtbox = false;
            this->bomb_shield_active = false;
        }
        if (this->delete_as_bullet) {
            // more BS
        }
    }

    // 0x42F890
    dllexport gnu_noinline void thiscall __update_fog() asm_symbol_rel(0x42F890) {

    }

    // 0x42FF80
    dllexport gnu_noinline ZunResult thiscall on_tick() asm_symbol_rel(0x42FF80);
    
    // 0x439480
    dllexport gnu_noinline int32_t fastcall extra_damage_func1(int32_t prev_damage) asm_symbol_rel(0x439480) {
        int32_t new_damage = this->int_vars[3];
        if (new_damage > 0) {
            new_damage += prev_damage;
            this->int_vars[3] = 0;
            return new_damage;
        } else {
            return prev_damage;
        }
    }
    
    // 0x4394A0
    dllexport gnu_noinline int32_t fastcall extra_damage_func2(int32_t prev_damage) asm_symbol_rel(0x4394A0);
};
#pragma region // EnemyData Field Validation
ValidateFieldOffset32(0x0, EnemyData, previous_motion);
ValidateFieldOffset32(0x44, EnemyData, current_motion);
ValidateFieldOffset32(0x88, EnemyData, motion);
ValidateFieldOffset32(0x110, EnemyData, hurtbox_size);
ValidateFieldOffset32(0x118, EnemyData, hitbox_size);
ValidateFieldOffset32(0x120, EnemyData, hurtbox_rotation);
ValidateFieldOffset32(0x124, EnemyData, anm_vms);
ValidateFieldOffset32(0x164, EnemyData, anm_positions);
ValidateFieldOffset32(0x224, EnemyData, anm_vm_indices);
ValidateFieldOffset32(0x264, EnemyData, anm_source_index);
ValidateFieldOffset32(0x268, EnemyData, anm_slot_0_source_index);
ValidateFieldOffset32(0x26C, EnemyData, anm_slot_0_script);
ValidateFieldOffset32(0x270, EnemyData, current_anm_script);
ValidateFieldOffset32(0x274, EnemyData, current_anm_pose);
ValidateFieldOffset32(0x278, EnemyData, kill_id);
ValidateFieldOffset32(0x27C, EnemyData, anm_base_layer);
ValidateFieldOffset32(0x280, EnemyData, position_of_last_damage_source_to_hit);
ValidateFieldOffset32(0x28C, EnemyData, int_vars);
ValidateFieldOffset32(0x29C, EnemyData, float_vars);
ValidateFieldOffset32(0x2BC, EnemyData, ecl_time);
ValidateFieldOffset32(0x2D0, EnemyData, boss_timer);
ValidateFieldOffset32(0x2E4, EnemyData, slowdown);
ValidateFieldOffset32(0x2E8, EnemyData, global_list_node);
ValidateFieldOffset32(0x2F8, EnemyData, position_interp);
ValidateFieldOffset32(0x3C8, EnemyData, angle_interp_absolute);
ValidateFieldOffset32(0x3F8, EnemyData, speed_interp_absolute);
ValidateFieldOffset32(0x428, EnemyData, angle_interp_relative);
ValidateFieldOffset32(0x458, EnemyData, speed_interp_relative);
ValidateFieldOffset32(0x488, EnemyData, orbit_radius_interp);
ValidateFieldOffset32(0x510, EnemyData, ellipse_interp);
ValidateFieldOffset32(0x598, EnemyData, shooters);
ValidateFieldOffset32(0x4E18, EnemyData, bullet_effect_indices);
ValidateFieldOffset32(0x4E58, EnemyData, shooter_offsets);
ValidateFieldOffset32(0x4F18, EnemyData, shooter_origins);
ValidateFieldOffset32(0x4FD8, EnemyData, final_sprite_size);
ValidateFieldOffset32(0x4FE0, EnemyData, move_bounds_center);
ValidateFieldOffset32(0x4FE8, EnemyData, move_bounds_size);
ValidateFieldOffset32(0x4FF0, EnemyData, score);
ValidateFieldOffset32(0x4FF4, EnemyData, life);
ValidateFieldOffset32(0x5010, EnemyData, drops);
ValidateFieldOffset32(0x50D4, EnemyData, __int_50D4);
ValidateFieldOffset32(0x50E8, EnemyData, __dword_50E8);
ValidateFieldOffset32(0x50EC, EnemyData, hit_sound);
ValidateFieldOffset32(0x50F0, EnemyData, invulnerable_timer);
ValidateFieldOffset32(0x5104, EnemyData, no_hitbox_timer);
ValidateFieldOffset32(0x5118, EnemyData, __timer_5118);
ValidateFieldOffset32(0x512C, EnemyData, bomb_damage_multiplier);
ValidateFieldOffset32(0x5130, EnemyData, flags_low);
ValidateFieldOffset32(0x5134, EnemyData, flags_high);
ValidateFieldOffset32(0x5138, EnemyData, bombshield_on_anm);
ValidateFieldOffset32(0x513C, EnemyData, bombshield_off_anm);
ValidateFieldOffset32(0x5140, EnemyData, boss_id);
ValidateFieldOffset32(0x5144, EnemyData, player_protect_radius);
ValidateFieldOffset32(0x5148, EnemyData, callbacks);
ValidateFieldOffset32(0x5588, EnemyData, vm);
ValidateFieldOffset32(0x558C, EnemyData, fog);
ValidateFieldOffset32(0x55A8, EnemyData, death_callback_sub);
ValidateFieldOffset32(0x55E8, EnemyData, func_set_func);
ValidateFieldOffset32(0x55EC, EnemyData, __is_func_set_2);
ValidateFieldOffset32(0x55F0, EnemyData, extra_damage_func);
ValidateFieldOffset32(0x55F4, EnemyData, extra_hitbox_func);
ValidateFieldOffset32(0x55F8, EnemyData, chapter);
ValidateFieldOffset32(0x55FC, EnemyData, chapter_spawn_weight);
ValidateStructSize32(0x5600, EnemyData);
#pragma endregion

#pragma region // IMPORTED_FROM_MOF_DATA_NEEDS_VALIDATION

// size: 0x10
struct EclSub {
    ZUNMagic magic; // 0x0
    uint32_t data_offset; // 0x4
    unknown_fields(0x8); // 0x8
    EclInstruction instructions[]; // 0x10
};

// size: 0x8
struct EclSubHeader {
    char* name; // 0x0
    EclSub* data; // 0x4
};

// size: 0x24
struct EclFileHeader {
    ZUNMagic magic; // 0x0
    uint16_t version; // 0x4
    uint16_t include_length; // 0x6 include_offset + ANIM+ECLI length
    uint32_t include_offset; // 0x8
    int __dword_C; // 0xC
    uint16_t sub_count; // 0x10

    int __dword_14; // 0x14
    int __dword_18; // 0x18
    int __dword_1C; // 0x1C
    int __dword_20; // 0x20
    // 0x24
};

struct EclFile {
    EclFileHeader header; // 0x0
    unsigned char data[]; // 0x24
};
#pragma endregion

struct SptResource {
    //void* vtable; // 0x0
    int32_t file_count; // 0x4
    int32_t sub_count; // 0x8
    EclFile* files[32]; // 0xC
    EclSubHeader(*subs)[]; // 0x8C

    // 0x48D9D0
    dllexport virtual gnu_noinline ZunResult __method_0(const char* file_buffer) asm_symbol_rel(0x48D9D0) {
        this->files[this->file_count] = (EclFile*)file_buffer;
        EclFile* ecl_file = this->files[this->file_count];
        if (
            ecl_file->header.magic.as_uint == PackUInt('S', 'C', 'P', 'T') &&
            ecl_file->header.version == 1
        ) {
            char* includes = based_pointer<char>(ecl_file, ecl_file->header.include_length);
            this->sub_count += ecl_file->header.sub_count;
            EclSubHeader(*old_sub_array)[] = this->subs;
            void* file_data = ecl_file->data;

        }
        else {
            this->files[this->file_count] = NULL;
            return ZUN_ERROR;
        }
    }
};

// size: 0x1098
struct EnemyController {
    void* vtable; // 0x0
    int32_t file_count; // 0x4
    int32_t sub_count; // 0x8
    EclFile* files[32]; // 0xC
    EclSubHeader(*subs)[]; // 0x8C
    EclStack __wtf_stack_maybe; // 0x90
    // 0x1098

    inline void zero_contents() {
        zero_this();
    }

    inline EnemyController() {
        this->zero_contents();
    }
};

// size: 0x122C
struct EclVM {
    //void* vtable; // 0x0
    EclContext* next_context; // 0x4
    EclContext* prev_context; // 0x8
    EclContext* current_context; // 0xC
    EclContext context; // 0x10
    EnemyController* controller; // 0x1218
    ZUNLinkedList<EclContext> context_list; // 0x121C
    // 0x122C

    // 0x42CDC0
    dllexport gnu_noinline void vectorcall subtract_time_float(float amount) asm_symbol_rel(0x42CDC0) {
        this->current_context->time -= amount;
    }

    // 0x42CE10
    dllexport gnu_noinline EclVM() {
        this->context.set_float_interp_times(0);
    }

    // 0x42CE80
    dllexport gnu_noinline void initialize_vm() asm_symbol_rel(0x42CE80) {
        this->context.__unknown_flag_A = false;
        this->context.time = 0.0f;
        this->context.location.reset();
        this->context.async_id = -1;
        this->context.vm = this;
        this->context.__int_101C = 0;
        this->context.set_float_interp_times(0);
        this->current_context = &this->context;
        this->context.stack.pointer = 0;
        this->context.stack.base = 0;
        this->context_list.initialize_with(&this->context);
    }

    // 0x42CD70
    dllexport gnu_noinline virtual int32_t high_ecl_run() asm_symbol_rel(0x42CD70) {
        return 0;
    }

    // 0x42CD80
    dllexport gnu_noinline virtual int32_t get_int_var(int32_t index) asm_symbol_rel(0x42CD80) {
        return 0;
    }

    // 0x42CD90
    dllexport gnu_noinline virtual int32_t* get_int_ptr(int32_t index) asm_symbol_rel(0x42CD90) {
        return NULL;
    }

    // 0x42CDA0
    dllexport gnu_noinline virtual float get_float_var(int32_t index) asm_symbol_rel(0x42CDA0) {
        return 0.0f;
    }

    // 0x42CDB0
    dllexport gnu_noinline virtual float* get_float_ptr(int32_t index) asm_symbol_rel(0x42CDB0) {
        return NULL;
    }

    // 0x42CDD0
    dllexport gnu_noinline void cleanup() asm_symbol_rel(0x42CDD0) {
        this->context_list.delete_each();
    }

    // 0x42CF50
    dllexport inline virtual ~EclVM() asm_symbol_rel(0x42CF50) {
        clang_forceinline this->cleanup();
    }

private:
    // 0x48D420
    dllexport gnu_noinline ZunResult vectorcall run_ecl(float, float current_gamespeed) asm_symbol_rel(0x48D420) {
        BOOL is_primary_context = true;
        if (this->context_list.do_whileB([=, &is_primary_context](EclContext* context, ZUNLinkedList<EclContext>* node) {
            this->current_context = context;
            if (is_primary_context) {
                if (ZUN_FAILED(context->low_ecl_run(current_gamespeed))) {
                    return false;
                }
                is_primary_context = false;
            } else {
                if (ZUN_FAILED(context->low_ecl_run(current_gamespeed))) {
                    delete context;
                    node->unlink();
                    delete node;
                }
            }
            return true;
        })) {
            this->current_context = &this->context;
            return ZUN_SUCCESS;
        } else {
            return ZUN_ERROR;
        }
    }

public:
    forceinline ZunResult run_ecl(float time) {
        return this->run_ecl(UNUSED_FLOAT, time);
    }

    // 0x48D850
    dllexport gnu_noinline ZunResult thiscall new_async(int32_t async_id, int32_t args_index) asm_symbol_rel(0x48D850) {
        EclContext* context = new EclContext();
        ZUNLinkedList<EclContext>* list_node = new ZUNLinkedList<EclContext>();
        context->async_id = async_id;
        context->vm = this;
        context->time = 0.0f;
        context->location.reset();
        context->difficulty_mask = this->current_context->difficulty_mask;
        list_node->initialize_with(context);
        this->context_list.append(list_node);
        return this->current_context->call(context, args_index);
    }

    // 0x48D920
    dllexport gnu_noinline void thiscall locate_sub(const char* sub_name) asm_symbol_rel(0x48D920) {
        EnemyController* enemy_controller = this->controller;
        int32_t left_index = 0;
        assume(sub_name[0] != '\0');
        int32_t right_index = enemy_controller->sub_count - 1;
        if (expect(right_index >= 0, true)) {
            EclSubHeader* subs = *enemy_controller->subs;
            do {
                int32_t index = right_index - left_index;
                const char* name = sub_name;
                index /= 2;
                index += left_index;
                int32_t cmp_value = strcmp_asm(name, subs[index].name);
                if (!cmp_value) {
                    this->current_context->location.sub_index = index;
                    return;
                } else if (cmp_value < 0) {
                    right_index = index - 1;
                } else {
                    left_index = index + 1;
                }
            } while (left_index <= right_index);
        }
        this->current_context->location.sub_index = -1;
    }

    // 0x48DC20
    dllexport gnu_noinline int32_t thiscall set_context_to_sub(const char* sub_name) asm_symbol_rel(0x48DC20) {
        this->locate_sub(sub_name);
        this->current_context->location.instruction_offset = 0;
        this->current_context->time = 0.0f;
        return 0;
    }
};
#pragma region // EclVM Validation
ValidateVirtualFieldOffset32(0x4, EclVM, next_context);
ValidateVirtualFieldOffset32(0x8, EclVM, prev_context);
ValidateVirtualFieldOffset32(0xC, EclVM, current_context);
ValidateVirtualFieldOffset32(0x10, EclVM, context);
ValidateVirtualFieldOffset32(0x1218, EclVM, controller);
ValidateVirtualFieldOffset32(0x121C, EclVM, context_list);
ValidateStructSize32(0x122C, EclVM);
#pragma endregion

inline EclInstruction* EclContext::get_instruction(int32_t sub_index, int32_t instr_offset) {
    return based_pointer((*this->vm->controller->subs)[sub_index].data->instructions, instr_offset);
}

forceinline int32_t thiscall EclContext::get_int_arg(int32_t index, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        int32_t value = IntArg(index);
        if (value >= 0) {
            return this->stack.read_local(value);
        } else if (value <= -1 && value >= -100) {
            return this->stack.read_temp(value);
        } else {
            return this->vm->get_int_var(value);
        }
    } else {
        return IntArg(index);
    }
}

// 0x48D4F0
dllexport gnu_noinline int32_t thiscall EclContext::get_int_arg(int32_t index) {
    return this->get_int_arg(index, this->get_current_instruction());
}

forceinline float vectorcall EclContext::get_float_arg(int32_t index, EclInstruction* current_instruction) {
    float value = FloatArg(index);
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0.0f) {
            return this->stack.read_local(value);
        } else if (value <= -1.0f && value >= -100.0f) {
            return this->stack.read_temp(value);
        } else {
            return this->vm->get_float_var((int32_t)value);
        }
    } else {
        return value;
    }
}

// 0x48D5A0
dllexport gnu_noinline float vectorcall EclContext::get_float_arg(int32_t, int32_t index) {
    return this->get_float_arg(index, this->get_current_instruction());
}

forceinline int32_t thiscall EclContext::parse_int_as_arg_pop(int32_t index, int32_t value, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0) {
            return this->stack.read_local(value);
        } else if (value <= -1 && value >= -100) {
            return this->stack.pop_cast<int32_t>();
        } else {
            return this->vm->get_int_var(value);
        }
    } else {
        return value;
    }
}

// 0x48D690
dllexport gnu_noinline int32_t thiscall EclContext::parse_int_as_arg_pop(int32_t index, int32_t value) {
    return this->parse_int_as_arg_pop(index, value, this->get_current_instruction());
}

forceinline float vectorcall EclContext::parse_float_as_arg_pop(int32_t index, float value, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0.0f) {
            return this->stack.read_local(value);
        } else if (value <= -1.0f && value >= -100.0f) {
            return this->stack.pop_cast<float>();
        } else {
            return this->vm->get_float_var(value);
        }
    } else {
        return value;
    }
}

inline float vectorcall EclContext::parse_float_as_arg_pop(int32_t index, float value) {
    return this->parse_float_as_arg_pop(index, value, this->get_current_instruction());
}

forceinline int32_t* thiscall EclContext::get_int_ptr_arg(int32_t index, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        int32_t value = IntArg(index);
        if (value >= 0) {
            return &this->stack.ref_local(value);
        } else {
            return this->vm->get_int_ptr(value);
        }
    } else {
        return NULL;
    }
}

// 0x48D750
dllexport gnu_noinline int32_t* thiscall EclContext::get_int_ptr_arg(int32_t index) {
    return this->get_int_ptr_arg(index, this->get_current_instruction());
}

forceinline float* thiscall EclContext::get_float_ptr_arg(int32_t index, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        float value = FloatArg(index);
        if (value >= 0.0f) {
            return &this->stack.ref_local(value);
        } else {
            return this->vm->get_float_ptr((int32_t)value);
        }
    } else {
        return NULL;
    }
}

// 0x48D7C0
dllexport gnu_noinline float* thiscall EclContext::get_float_ptr_arg(int32_t index) {
    return this->get_float_ptr_arg(index, this->get_current_instruction());
}

forceinline int32_t thiscall EclContext::parse_int_as_arg(int32_t index, int32_t value, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0) {
            return this->stack.read_local(value);
        } else if (value <= -1 && value >= -100) {
            return this->stack.read_temp(value);
        } else {
            return this->vm->get_int_var(value);
        }
    } else {
        return IntArg(index);
    }
}

forceinline int32_t thiscall EclContext::parse_int_as_arg(int32_t index, int32_t value) {
    return this->parse_int_as_arg(index, value, this->get_current_instruction());
}

forceinline float EclContext::parse_float_as_arg(int32_t index, float value, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0.0f) {
            return this->stack.read_local(value);
        } else if (value <= -1.0f && value >= -100.0f) {
            return this->stack.read_temp(value);
        } else {
            return this->vm->get_float_var((int32_t)value);
        }
    } else {
        return value;
    }
}

forceinline float EclContext::parse_float_as_arg(int32_t index, float value) {
    return this->parse_float_as_arg(index, value, this->get_current_instruction());
}

// 0x438AA0
dllexport gnu_noinline int32_t thiscall EnemyData::get_int_arg(int32_t index) {
    return this->vm->current_context->get_int_arg(index);
}

// 0x438AC0
dllexport gnu_noinline int32_t* thiscall EnemyData::get_int_ptr_arg(int32_t index) {
    return this->vm->current_context->get_int_ptr_arg(index);
}

// 0x438AD0
dllexport gnu_noinline float vectorcall EnemyData::get_float_arg(int32_t, int32_t index) {
    return this->vm->current_context->get_float_arg(index);
}

// 0x438AF0
dllexport gnu_noinline float* thiscall EnemyData::get_float_ptr_arg(int32_t index) {
    return this->vm->current_context->get_float_ptr_arg(index);
}

// 0x438B10
dllexport gnu_noinline int32_t thiscall EnemyData::parse_int_as_arg(int32_t index, int32_t value) {
    return this->vm->current_context->parse_int_as_arg(index, value);
}

// 0x438BC0
dllexport gnu_noinline float vectorcall EnemyData::parse_float_as_arg(int32_t, int32_t index, float, float, float value) {
    return this->vm->current_context->parse_float_as_arg(index, value);
}

namespace Ecl {
enum Var : int32_t {
    RAND_INT = -10000,
    RAND_FLOAT = -9999,
    RAND_ANGLE = -9998,
    SELF_X = -9997,
    SELF_Y = -9996,
    SELF_X_ABS = -9995,
    SELF_Y_ABS = -9994,
    SELF_X_REL = -9993,
    SELF_Y_REL = -9992,

    SELF_X2 = -9977,
    SELF_Y2 = -9976,
    SELF_X2_ABS = -9975,
    SELF_Y2_ABS = -9974,
    SELF_X2_REL = -9973,
    SELF_Y2_REL = -9972
};
enum Opcode : uint16_t {
    // Section A
    nop = 0,
    enemy_delete,
    ret = 10,
    call,
    jump,
    jump_equ,
    jump_neq,
    async_call,
    async_call_id,
    async_stop_id,
    __async_unknown_flag_aet,
    __async_unknown_flag_clear,
    __async_unknown_value,
    async_stop_all,
    __debug_unknown_A,
    ecl_time_sub,
    ecl_time_sub_float,
    debug_print = 30,
    __debug_unknown_B,
    frame_enter = 40,
    frame_leave,
    push_int,
    pop_int,
    push_float,
    pop_float,
    math_int_add = 50,
    math_float_add,
    math_int_sub,
    math_float_sub,
    math_int_mul,
    math_float_mul,
    math_int_div,
    math_float_div,
    math_int_mod,
    cmp_int_equ,
    cmp_float_equ,
    cmp_int_neq,
    cmp_float_neq,
    cmp_int_les,
    cmp_float_les,
    cmp_int_leq,
    cmp_float_leq,
    cmp_int_gre,
    cmp_float_gre,
    cmp_int_geq,
    cmp_float_geq,
    cmp_int_not,
    cmp_float_not,
    cmp_or,
    cmp_and,
    math_bit_xor,
    math_bit_or,
    math_bit_and,
    math_post_dec,
    math_sin,
    math_cos,
    math_circle_pos,
    math_reduce_angle,
    math_int_neg,
    math_float_neg,
    math_hypot_squared,
    math_hypot,
    math_line_angle,
    math_sqrt,
    math_angle_diff,
    __math_point_rotate,
    math_float_interp,
    math_float_interp_bezier,
    math_circle_pos_rand,
    math_ellipse_pos,
    __math_angle_95,
    __math_angle_96,
    __math_angle_97,

    // Section B
    enemy_create_rel = 300,
    enemy_create_abs,
    anm_source,
    anm_set_slot,
    enemy_create_rel_mirror,
    enemy_create_abs_mirror,
    anm_set_slot_main,
    anm_create_front,
    anm_create_zero_front,
    enemy_create_rel_stage,
    enemy_create_abs_stage,
    enemy_create_rel_stage_mirror,
    enemy_create_abs_stage_mirror,
    anm_play_attack,
    anm_create_back,
    anm_create_front_rotated,
    anm_play_attack_ex,
    anm_interrupt_slot,
    anm_play_main,
    anm_rotate_slot,
    anm_move_position_slot,
    __enemy_create_rel_2,
    __anm_set_slot_indirect,
    __anm_death_effects,
    enemy_id_get_position,
    anm_color_slot,
    anm_color_slot_interp,
    anm_alpha_slot,
    anm_alpha_slot_interp,
    anm_scale_slot,
    anm_scale_slot_interp,
    anm_alpha2_slot,
    anm_alpha2_slot_interp,
    anm_move_position_slot_interp,
    __effect_create_special,
    anm_scale2_slot,
    __anm_layer_slot,
    __anm_blend_mode_slot,
    anm_create_rel_front_rotated,
    effect_create,
    __enemy_flag_unknown,

    // Section C
    move_position_abs = 400,
    move_position_abs_interp,
    move_position_rel,
    move_position_rel_interp,
    move_velocity_abs,
    move_velocity_abs_interp,
    move_velocity_rel,
    move_velocity_rel_interp,
    move_orbit_abs,
    move_orbit_abs_interp,
    move_orbit_rel,
    move_orbit_rel_interp,
    move_rand_interp_abs,
    move_rand_interp_rel,
    move_to_boss0_abs,
    move_to_boss0_rel,
    move_position_add_abs,
    move_position_add_rel,
    move_origin_abs,
    move_origin_rel,
    move_ellipse_abs,
    move_ellipse_abs_interp,
    move_ellipse_rel,
    move_ellipse_rel_interp,
    enemy_flag_mirror,
    move_bezier_abs,
    move_bezier_rel,
    move_stop,
    move_velocity_no_mirror_abs,
    move_velocity_no_mirror_abs_interp,
    move_velocity_no_mirror_rel,
    move_velocity_no_mirror_rel_interp,
    move_to_enemy_id_abs,
    move_to_enemy_id_rel,
    __move_curve_abs,
    __move_curve_rel,
    __move_position_offset_abs_interp,
    __move_position_offset_rel_interp,
    __move_curve_offset_abs,
    __move_curve_offset_rel,
    move_angle_abs,
    move_angle_abs_interp,
    move_angle_rel,
    move_angle_rel_interp,
    move_speed_abs,
    move_speed_abs_interp,
    move_speed_rel,
    move_speed_rel_interp,

    // Section D
    enemy_set_hitbox = 500,
    enemy_set_collision,
    enemy_flags_set,
    enemy_flags_clear,
    move_bounds_set,
    move_bounds_disable,
    item_bonus_slots_reset,
    item_bonus_slot_set,
    item_drop_area,
    drop_item_rewards,
    item_reward_set,
    enemy_life_set,
    boss_set,
    boss_timer_clear,
    callback_ex,
    enemy_invincible_timer,
    effect_sound,
    effect_screen_shake,
    msg_read,
    msg_wait,
    boss_wait,
    timer_callback_sub,
    spellcard_start,
    spellcard_end,
    chapter_set,
    enemy_kill_all,
    player_protect_range,
    enemy_lifebar_color,
    spellcard_start_2,
    set_float_rank_3,
    set_float_rank_5,
    math_float_rank_lerp,
    set_int_rank_3,
    set_int_rank_5,
    math_int_rank_lerp,
    set_int_difficulty,
    set_float_difficulty,
    spellcard_start_difficulty,
    spellcard_start_difficulty_1,
    spellcard_start_difficulty_2,
    boss_set_life_count,
    enemy_no_collision_timer,
    spellcard_flag_timeout_set,
    __spellcard_flag_anm_unknown,
    enemy_flag_homing_disable,
    laser_clear_all,
    enemy_bomb_shield,
    game_speed_set,
    ecl_time_sub_difficulty,
    __enemy_flag_unknown_A,
    enemy_set_kill_id,
    enemy_kill_all_id,
    anm_layer_base,
    __enemy_damage_sound,
    __stage_logo,
    __enemy_id_exists,
    death_callback_sub,
    std_fog_interp,
    enemy_flag_mirror2,
    enemy_limit_set,
    __bullet_bounce_bounds_set,
    __enemy_kill_effect_create,
    drop_item_rewards_force,
    enemy_flag_hitbox_shape,
    enemy_set_hitbox_rotation,
    __enemy_bomb_shield_amount,
    enemy_kill,
    __spellcard_flag_unknown_A,
    __enemy_flag_armored,
    __enemy_set_chapter_spawn_weight,
    __enemy_add_spawn_weight_to_destroy,
    enemy_kill_all_no_callbacks,
    __enemy_life_set_current,
    item_timed_bonus_slot_set,
    item_timed_bonus_duration,

    // Section E
    shooter_reset = 600,
    shoot_now,
    bullet_sprite,
    shoot_offset,
    shoot_angle,
    bullet_speed,
    bullet_count,
    shoot_aim_mode,
    bullet_sound,
    bullet_effects,
    bullet_effects_ex,
    bullet_effects_add,
    bullet_effects_add_ex,
    bullet_cancel,
    shooter_copy,
    bullet_cancel_radius,
    bullet_clear_radius,
    bullet_speed_rank_3,
    bullet_speed_rank_5,
    bullet_speed_rank_lerp,
    bullet_count_rank_3,
    bullet_count_rank_5,
    bullet_count_rank_lerp,
    set_float_angle_to_player_from_point,
    bullet_speed_difficulty,
    bullet_count_difficulty,
    shoot_offset_circle,
    shoot_spawn_distance,
    __shoot_unknown_A,
    enemy_fog_spawn,
    std_interrupt,
    __enemy_manager_flag_unknown_A,
    ex_ins_repeat,
    __enemy_damage_ex,
    __enemy_hitbox_ex,
    bullet_cancel_weak_radius,
    bullet_clear_weak_radius,
    ex_ins_call,
    score_add,
    __ex_ins_repeat2,
    bullet_effects_set_string,
    __bullet_effects_prev,

    // Section F
    laser_size_data = 700,
    laser_timing_data,
    laser_line_create,
    laser_infinite_create,
    laser_offset,
    laser_target,
    laser_speed,
    laser_width,
    laser_angle,
    laser_rotate,
    laser_clear,
    laser_curve_create,
    __bullet_cancel_weak_rectangle,
    laser_beam_create,
    __laser_unknown_A,

    // Section G
    enemy_id_change_sub = 800,
    enemy_id_get_position_crash,
    boss_callback,

    // Section H
    // IIRC there are debugging instructions here...?

    // Section I
    Ecl1001 = 1001
};
}

// size: 0x683C
struct Enemy : EclVM {
    //EclVM vm; // 0x0
    EnemyData data; // 0x122C
    void* __on_kill_func; // 0x682C
    int32_t id; // 0x6830
    int32_t parent_id; // 0x6834
    int __dword_6838; // 0x6838
    // 0x683C

    // 0x42E100
    dllexport gnu_noinline Enemy(const char* sub_name);

    // 0x42D200
    dllexport gnu_noinline void __set_unknown_flag_B() asm_symbol_rel(0x42D200) {
        this->data.__unknown_flag_B = true;
    }

    // 0x42D210
    dllexport gnu_noinline EnemyData& get_data() asm_symbol_rel(0x42D210) {
        return this->data;
    }

    // 0x42D220
    dllexport gnu_noinline ~Enemy() asm_symbol_rel(0x42D220);

    // 0x42FE80
    dllexport gnu_noinline void thiscall on_tick() asm_symbol_rel(0x42FE80) {
        float enemy_slowdown = this->data.slowdown;
        if (enemy_slowdown <= 0.0f) {
            if (this->data.__anm_slowdown_immune) {
                this->data.set_anm_vm_slowdowns(0.0f);
            }
            this->data.on_tick();
        } else {
            float previous_gamespeed = GAME_SPEED.value;
            GAME_SPEED.value = confine_to_range(0.0f, previous_gamespeed - enemy_slowdown * previous_gamespeed, 1.0f);
            this->data.set_anm_vm_slowdowns(this->data.slowdown);
            this->data.on_tick();
            GAME_SPEED.value = previous_gamespeed;
            this->data.__anm_slowdown_immune = true; // Why?
        }
    }

    // 0x4389F0
    dllexport gnu_noinline void thiscall set_callback(int32_t index, int32_t life, int32_t time, const char* sub_name) asm_symbol_rel(0x4389F0) {
        EnemyCallback& callback = this->data.callbacks[index];
        callback.life = life;
        if (life >= 0) {
            callback.time = time;
            if (sub_name) {
                byteloop_strcpy(callback.__sub_A.name, sub_name);
                byteloop_strcpy(callback.__sub_B.name, sub_name);
            } else {
                callback.__sub_A.name[0] = '\0';
                callback.__sub_B.name[0] = '\0';
            }
        }
    }

    // 0x438A60
    dllexport gnu_noinline void thiscall set_callback_subB_name(int32_t index, const char* sub_name) asm_symbol_rel(0x438A60) {
        EnemyCallback& callback = this->data.callbacks[index];
        if (sub_name) {
            byteloop_strcpy(callback.__sub_B.name, sub_name);
        } else {
            callback.__sub_B.name[0] = '\0';
        }
    }

    // 0x409980
    dllexport gnu_noinline MotionData* thiscall get_current_motion() {
        return &this->data.current_motion;
    }

    // 0x430D30
    dllexport gnu_noinline virtual int32_t high_ecl_run() asm_symbol_rel(0x430D30) {
        return this->data.high_ecl_run();
    }

    // 0x437360
    dllexport gnu_noinline virtual int32_t get_int_var(int32_t index) asm_symbol_rel(0x437360) {
        switch (index) {

            default:
                return 0;
        }
    }

    // 0x437B20
    dllexport gnu_noinline virtual int32_t* get_int_ptr(int32_t index) asm_symbol_rel(0x437B20) {
        switch (index) {

            default:
                return NULL;
        }
    }

    // 0x437C90
    dllexport gnu_noinline virtual float get_float_var(int32_t index) asm_symbol_rel(0x437C90) {
        switch (index) {

            default:
                return 0.0f;
        }
    }

    // 0x4387E0
    dllexport gnu_noinline virtual float* get_float_ptr(int32_t index) asm_symbol_rel(0x4387E0) {
        switch (index) {

            default:
                return NULL;
        }
    }
};
#pragma region // Enemy Validation
//ValidateFieldOffset32(0x0, Enemy, vm);
ValidateFieldOffset32(0x122C, Enemy, data);
ValidateFieldOffset32(0x682C, Enemy, __on_kill_func);
ValidateFieldOffset32(0x6830, Enemy, id);
ValidateFieldOffset32(0x6834, Enemy, parent_id);
ValidateFieldOffset32(0x6838, Enemy, __dword_6838);
ValidateStructSize32(0x683C, Enemy);
#pragma endregion

// size: 0x2108
struct WindowData {
    HWND window; // 0x0
    HWND resolution_dialogue; // 0x4
    int __dword_8; // 0x8
    HINSTANCE current_instance; // 0xC
    BOOL window_active; // 0x10
    int __dword_14; // 0x14
    int __dword_18; // 0x18
    int8_t __sbyte_1C; // 0x1C
    probably_padding_bytes(0x3); // 0x1D
    LARGE_INTEGER performance_counter_frequency; // 0x20
    LARGE_INTEGER startup_qpc_value; // 0x28
    bool __bool_30; // 0x30
    char appdata_path[0x1000]; // 0x31
    char exe_path[0x1000]; // 0x1031
    probably_padding_bytes(0x3); // 0x2031
    BOOL screen_saver_active; // 0x2034
    BOOL screen_saver_low_power_active; // 0x2038
    BOOL screen_saver_power_off_active; // 0x203C
    union {
        uint32_t flags; // 0x2040
        struct {
            uint32_t __unknown_flag_A : 1; // 1
            uint32_t __unknown_flag_B : 1; // 2
            uint32_t __unknown_bitfield_A : 5; // 3-7
            uint32_t __unknown_flag_C : 1; // 8
            uint32_t __unknown_bitfield_B : 2; // 9-10
        };
    };
    uint32_t __counter_2044; // 0x2044
    unknown_fields(0x8); // 0x2048
    int32_t __int_2050; // 0x2050 scaled_width
    int32_t __int_2054; // 0x2054 scaled_height
    int32_t window_width; // 0x2058
    int32_t window_height; // 0x205C
    int __dword_2060; // 0x2060 display_width
    int __dword_2064; // 0x2064 display_height
    int32_t __int_2068; // 0x2068 backbuffer_width
    int32_t __int_206C; // 0x206C backbuffer_height
    float __float_2070; // 0x2070 game_scale
    int32_t __int_2074; // 0x2074
    int32_t __int_2078; // 0x2078
    int32_t __int_207C; // 0x207C
    int32_t __int_2080; // 0x2080
    int32_t __int_2084; // 0x2084
    int32_t __int_2088; // 0x2088
    int32_t __int_208C; // 0x208C
    int32_t __int_2090; // 0x2090
    probably_padding_bytes(0x4); // 0x2094
    double __double_2098; // 0x2098
    double __double_20A0; // 0x20A0
    double __double_20A8; // 0x20A8
    double __double_20B0; // 0x20B0
    double __double_20B8; // 0x20B8
    double __double_20C0; // 0x20C0
    unknown_fields(0x4); // 0x20C8
    int __dword_20CC; // 0x20CC
    int __dword_20D0; // 0x20D0
    int __dword_array_20D4[12]; // 0x20D4 (This might be an array of 4 Int3...?)
    probably_padding_bytes(0x4); // 0x2104
    // 0x2108

    // 0x4726A0
    dllexport gnu_noinline ZunResult __save_properties_and_configure_paths() asm_symbol_rel(0x4726A0);
    
    // 0x472DD0
    dllexport gnu_noinline int32_t update_window__normal_version() asm_symbol_rel(0x472DD0);
    
    // 0x4734E0
    dllexport gnu_noinline void __sub_4734E0(int arg1) asm_symbol_rel(0x4734E0);
    
    // 0x473890
    dllexport gnu_noinline BOOL __create_window(HINSTANCE instance) asm_symbol_rel(0x473890);
};
#pragma region // WindowData Verification
ValidateFieldOffset32(0x0, WindowData, window);
ValidateFieldOffset32(0x4, WindowData, resolution_dialogue);
ValidateFieldOffset32(0x8, WindowData, __dword_8);
ValidateFieldOffset32(0xC, WindowData, current_instance);
ValidateFieldOffset32(0x10, WindowData, window_active);
ValidateFieldOffset32(0x14, WindowData, __dword_14);
ValidateFieldOffset32(0x18, WindowData, __dword_18);
ValidateFieldOffset32(0x1C, WindowData, __sbyte_1C);
ValidateFieldOffset32(0x20, WindowData, performance_counter_frequency);
ValidateFieldOffset32(0x28, WindowData, startup_qpc_value);
ValidateFieldOffset32(0x30, WindowData, __bool_30);
ValidateFieldOffset32(0x31, WindowData, appdata_path);
ValidateFieldOffset32(0x1031, WindowData, exe_path);
ValidateFieldOffset32(0x2034, WindowData, screen_saver_active);
ValidateFieldOffset32(0x2038, WindowData, screen_saver_low_power_active);
ValidateFieldOffset32(0x203C, WindowData, screen_saver_power_off_active);
ValidateFieldOffset32(0x2040, WindowData, flags);
ValidateFieldOffset32(0x2044, WindowData, __counter_2044);

ValidateFieldOffset32(0x2050, WindowData, __int_2050);
ValidateFieldOffset32(0x2054, WindowData, __int_2054);
ValidateFieldOffset32(0x2058, WindowData, window_width);
ValidateFieldOffset32(0x205C, WindowData, window_height);
ValidateFieldOffset32(0x2060, WindowData, __dword_2060);
ValidateFieldOffset32(0x2064, WindowData, __dword_2064);
ValidateFieldOffset32(0x2068, WindowData, __int_2068);
ValidateFieldOffset32(0x206C, WindowData, __int_206C);
ValidateFieldOffset32(0x2070, WindowData, __float_2070);
ValidateFieldOffset32(0x2074, WindowData, __int_2074);
ValidateFieldOffset32(0x2078, WindowData, __int_2078);
ValidateFieldOffset32(0x207C, WindowData, __int_207C);
ValidateFieldOffset32(0x2080, WindowData, __int_2080);
ValidateFieldOffset32(0x2084, WindowData, __int_2084);
ValidateFieldOffset32(0x2088, WindowData, __int_2088);
ValidateFieldOffset32(0x208C, WindowData, __int_208C);
ValidateFieldOffset32(0x2090, WindowData, __int_2090);
ValidateFieldOffset32(0x2098, WindowData, __double_2098);
ValidateFieldOffset32(0x20A0, WindowData, __double_20A0);
ValidateFieldOffset32(0x20A8, WindowData, __double_20A8);
ValidateFieldOffset32(0x20B0, WindowData, __double_20B0);
ValidateFieldOffset32(0x20B8, WindowData, __double_20B8);
ValidateFieldOffset32(0x20C0, WindowData, __double_20C0);

ValidateFieldOffset32(0x20CC, WindowData, __dword_20CC);
ValidateFieldOffset32(0x20D0, WindowData, __dword_20D0);
ValidateFieldOffset32(0x20D4, WindowData, __dword_array_20D4);
#pragma endregion

extern "C" {
    // 0x568C30
    extern WindowData WINDOW_DATA asm("_WINDOW_DATA");
}

// size: 0xC
struct RGB {
    int32_t r; // 0x0
    int32_t g; // 0x4
    int32_t b; // 0x8
};

typedef struct Gui Gui;
extern "C" {
    // 0x4CF2E0
    extern Gui* GUI_PTR asm("_GUI_PTR");
    // 0x570918
    extern void* CACHED_MSG_FILE_PTR asm("_CACHED_MSG_FILE_PTR");
}
// size: 0x2CC
struct Gui : ZUNTask {
    // size: 0xD8
    struct MenuHelper {
        int32_t next_selection; // 0x0
        int32_t current_selection; // 0x4
        int32_t choices; // 0x8
        int32_t stack_selections[16]; // 0xC
        int32_t stack_choices[16]; // 0x4C
        int32_t stack_depth; // 0x8C
        unknown_fields(0x40); // 0x90
        int __dword_D0; // 0xD0
        int __dword_D4; // 0xD4
    };

    // size: 0x4
    struct MsgInstruction {
        int16_t time; // 0x0
        uint8_t opcode; // 0x2
        uint8_t args_size; // 0x3
        unsigned char args[]; // 0x4
    };

    // size: 0x1D8
    struct MsgVM {
        unknown_fields(0x0); // 0x0
        Timer __timer_4; // 0x4
        Timer script_time; // 0x18
        Timer pause_timer; // 0x2C
        AnmID player_portraits[2]; // 0x40
        AnmID enemy_portraits[4]; // 0x48
        AnmID __vm_id_58; // 0x58
        int __dword_5C; // 0x5C
        unknown_fields(0x4); // 0x60
        AnmID dialogue_lines[2]; // 0x64
        AnmID furigana_lines[2]; // 0x6C
        AnmID intro; // 0x74
        AnmID __textbox_related; // 0x78
        AnmID __vm_ref_7C; // 0x7C
        int32_t menu_time; // 0x80
        int32_t menu_state; // 0x84
        MenuHelper menu_controller; // 0x88
        int __dword_160; // 0x160
        MsgInstruction* current_instr; // 0x164
        Float3 __float3_168; // 0x168
        Float3 __float3_174; // 0x174
        Float3 __float3_180; // 0x180
        Float3 __float3_18C; // 0x18C
        int32_t __enemy_appear_counter; // 0x198
        union {
            uint32_t flags; // 0x19C
            struct {
                uint32_t : 6; // 1-6
                uint32_t __unknown_flag_A : 1; // 7
            };
        };
        int32_t next_text_line; // 0x1A0
        int __dword_1A4; // 0x1A4
        int __dword_1A8; // 0x1A8
        int32_t active_portait; // 0x1AC
        int __dword_1B0; // 0x1B0
        int __dword_1B4; // 0x1B4
        int __dword_1B8; // 0x1B8
        int __dword_1BC; // 0x1BC
        Float3 callout_position; // 0x1C0
        float __float_1CC; // 0x1CC
        unknown_fields(0x14); // 0x1D0
    };

#pragma region IMPORTED_FROM_VD_DATA_NEEDS_VALIDATION
    // size: 0x8
    struct LifebarMarker {
        float bar_position; // 0x0
        D3DCOLOR section_color; // 0x4
    };
    // size: 0x54
    struct Lifebar {
        float bar_value; // 0x0
        float life_percentage; // 0x4
        int32_t current_life; // 0x8
        unknown_fields(0x4); // 0xC
        LifebarMarker markers[4]; // 0x10
        AnmID main_vm; // 0x30
        AnmID glowA_vm; // 0x34
        AnmID glowB_vm; // 0x38
        AnmID marker_vms[4]; // 0x3C
        int32_t vms_initialized; // 0x4C
        int __dword_50; // 0x50
    };
#pragma endregion

    // ZUNTask base; // 0x0
    unknown_fields(0x5C); // 0xC
    AnmVM* __anm_vm_ptr_array_68[7]; // 0x68
    AnmVM* __anm_vm_84; // 0x84
    AnmVM* __anm_vm_88; // 0x88
    unknown_fields(0x30); // 0x8C
    AnmID __anm_id_BC; // 0xBC
    unknown_fields(0x7C); // 0xC0
    int32_t __int_13C; // 0x13C
    Timer __timer_140; // 0x140
    unknown_fields(0x4); // 0x154
    int32_t __score; // 0x158
    unknown_fields(0x4); // 0x15C
    AnmLoaded* stage_logo_anm; // 0x160
    unknown_fields(0xC); // 0x164
    int __dword_170; // 0x170
    unknown_fields(0x20); // 0x174
    union {
        uint32_t flags; // 0x194
        struct {

        };
    };
    Timer __timer_198; // 0x198
    unknown_fields(0x4); // 0x1AC
    MsgVM* msg_vm; // 0x1B0
    void* msg_file; // 0x1B4
    int32_t spell_timer_seconds; // 0x1B8
    int32_t spell_timer_hundredths; // 0x1BC
    unknown_fields(0x4); // 0x1C0
    Lifebar lifebars[3]; // 0x1C4
    AnmLoaded* __anm_loaded_2C0; // 0x2C0
    unknown_fields(0x8); // 0x2C4

    // 0x4420E0
    dllexport gnu_noinline void thiscall __sub_4420E0(int32_t count, int32_t arg2, int32_t arg3) asm_symbol_rel(0x4420E0);

    // 0x42D560
    dllexport gnu_noinline void __set_field_170(int value) asm_symbol_rel(0x42D560) {
        this->__dword_170 = value;
    }

    // 0x42D570
    dllexport gnu_noinline void vectorcall set_lifebar_marker(int32_t bar_index, int32_t marker_index, D3DCOLOR color, float position) asm_symbol_rel(0x42D570) {
        Gui* gui = GUI_PTR;
        gui->lifebars[bar_index].markers[marker_index].bar_position = position;
        gui->lifebars[bar_index].markers[marker_index].section_color = color;
    }

    // 0x42D5B0
    dllexport gnu_noinline int32_t __get_enemy_appear_counter() asm_symbol_rel(0x42D5B0) {
        return GUI_PTR->msg_vm->__enemy_appear_counter;
    }

    // 0x43A730
    dllexport gnu_noinline ZunResult thiscall __sub_43A730() asm_symbol_rel(0x43A730);

    static inline bool msg_is_active() {
        if (Gui* gui = GUI_PTR) {
            return gui->msg_vm;
        }
        return false;
    }
};
#pragma region // Gui Validation
ValidateFieldOffset32(0x0, Gui, task_flags);
ValidateFieldOffset32(0x4, Gui, on_tick_func);
ValidateFieldOffset32(0x8, Gui, on_draw_func);
ValidateFieldOffset32(0x68, Gui, __anm_vm_ptr_array_68);
ValidateFieldOffset32(0x84, Gui, __anm_vm_84);
ValidateFieldOffset32(0x88, Gui, __anm_vm_88);
ValidateFieldOffset32(0xBC, Gui, __anm_id_BC);
ValidateFieldOffset32(0x13C, Gui, __int_13C);
ValidateFieldOffset32(0x140, Gui, __timer_140);
ValidateFieldOffset32(0x158, Gui, __score);
ValidateFieldOffset32(0x170, Gui, __dword_170);
ValidateFieldOffset32(0x194, Gui, flags);
ValidateFieldOffset32(0x198, Gui, __timer_198);
ValidateFieldOffset32(0x1B0, Gui, msg_vm);
ValidateFieldOffset32(0x1B4, Gui, msg_file);
ValidateFieldOffset32(0x1B8, Gui, spell_timer_seconds);
ValidateFieldOffset32(0x1BC, Gui, spell_timer_hundredths);
ValidateFieldOffset32(0x1C4, Gui, lifebars);
ValidateFieldOffset32(0x2C0, Gui, __anm_loaded_2C0);
ValidateStructSize32(0x2CC, Gui);
#pragma endregion

#define SOUND_EFFECT_COUNT 84

// 0x4B47A0
const char* SOUND_EFFECT_FILENAMES[] = {
    "se_plst00.wav",
    "se_enep00.wav",
    "se_pldead00.wav",
    "se_power0.wav",
    "se_power1.wav",
    "se_tan00.wav",
    "se_tan01.wav",
    "se_tan02.wav",
    "se_ok00.wav",
    "se_cancel00.wav",
    "se_select00.wav",
    "se_gun00.wav",
    "se_cat00.wav",
    "se_lazer00.wav",
    "se_lazer01.wav",
    "se_enep01.wav",
    "se_damage00.wav",
    "se_item00.wav",
    "se_kira00.wav",
    "se_kira01.wav",
    "se_kira02.wav",
    "se_timeout.wav",
    "se_graze.wav",
    "se_powerup.wav",
    "se_pause.wav",
    "se_cardget.wav",
    "se_damage01.wav",
    "se_timeout2.wav",
    "se_invalid.wav",
    "se_slash.wav",
    "se_ch00.wav",
    "se_ch01.wav",
    "se_extend.wav",
    "se_cardget.wav", // Yes, this is a duplicate
    "se_nep00.wav",
    "se_bonus.wav",
    "se_bonus2.wav",
    "se_enep02.wav",
    "se_lazer02.wav",
    "se_nodamage.wav",
    "se_boon00.wav",
    "se_don00.wav",
    "se_boon01.wav",
    "se_ch02.wav",
    "se_ch03.wav",
    "se_extend2.wav",
    "se_pin00.wav",
    "se_pin01.wav",
    "se_lgods1.wav",
    "se_lgods2.wav",
    "se_lgods3.wav",
    "se_lgods4.wav",
    "se_lgodsget.wav",
    "se_msl.wav",
    "se_msl2.wav",
    "se_pldead01.wav",
    "se_heal.wav",
    "se_msl3.wav",
    "se_fault.wav",
    "se_noise.wav",
    "se_etbreak.wav",
    "se_tan03.wav",
    "se_wold.wav",
    "se_bonus4.wav",
    "se_big.wav",
    "se_item01.wav",
    "se_release.wav",
    "se_changeitem.wav",
    "se_trophy.wav",
    "se_warpl.wav",
    "se_warpr.wav",
    "se_notice.wav"
};

// size: 0x14
struct SoundData {
    int32_t id; // 0x0
    int32_t filename_index; // 0x4
    unknown_fields(0x2); // 0x8
    int16_t __short_A; // 0xA
    unknown_fields(0x8); // 0xC
};
#pragma region // SoundData Validation
ValidateFieldOffset32(0x0, SoundData, id);
ValidateFieldOffset32(0x4, SoundData, filename_index);
ValidateFieldOffset32(0xA, SoundData, __short_A);
ValidateStructSize32(0x14, SoundData);
#pragma endregion

// size: 0x34
struct ThBgmFormat {
    char filename[0x10]; // 0x0
    unknown_fields(0x4); // 0x10
    int __dword_14; // 0x14
    unknown_fields(0x1C); // 0x18
};
#pragma region // ThBgmFormat Validation
ValidateFieldOffset32(0x0, ThBgmFormat, filename);
ValidateFieldOffset32(0x14, ThBgmFormat, __dword_14);
ValidateStructSize32(0x34, ThBgmFormat);
#pragma endregion

struct WavFileHeader {
    char riff_text[4]; // 0x0
    uint32_t remaining_file_size; // 0x4
    char wave_text[4]; // 0x8
};
struct WavFileChunk {
    char id[4]; // 0x0
    uint32_t size; // 0x4
    unsigned char data[]; // 0x8
};

// 0x476830
dllexport gnu_noinline unsigned char* vectorcall get_wav_chunk_data(WavFileChunk* chunk, const char* chunk_id, int32_t* remaining_size_ptr, int32_t remaining_size) asm_symbol_rel(0x476830);
dllexport gnu_noinline unsigned char* vectorcall get_wav_chunk_data(WavFileChunk* chunk, const char* chunk_id, int32_t* remaining_size_ptr, int32_t remaining_size) {
    while (remaining_size) {
        *remaining_size_ptr = chunk->size;
        if (strncmp(chunk->id, chunk_id, sizeof(chunk->id)) == 0) {
            return chunk->data;
        }
        int32_t chunk_size = *remaining_size_ptr;
        chunk = pointer_raw_offset(chunk, sizeof(WavFileChunk) + chunk_size);
        remaining_size -= sizeof(WavFileChunk) + chunk_size;
    }
    return NULL;
}

struct WavFile {
    WavFileHeader header; // 0x0
    WavFileChunk chunks[]; // 0xC
};

/*
struct MMCKINFO {
    FOURCC ckid; // 0x0
    DWORD cksize; // 0x4
    FOURCC fccType; // 0x8
    DWORD dwDataOffset; // 0xC
    DWORD dwFlags; // 0x10
    // 0x14
};

class CWaveFile {
    WAVEFORMATEX* m_pwfx; // 0x0
    HMMIO m_hmmio; // 0x4
    MMCKINFO m_ck; // 0x8
    MMCKINFO m_ckRiff; // 0x1C
    DWORD m_dwSize; // 0x30
    MMIOINFO m_mmioinfoOut; // 0x34
    DWORD m_dwFlags; // 0x48
    BOOL m_bIsReadingFromMemory; // 0x4C
    BYTE* m_pbData; // 0x50
    BYTE* m_pbDataCur; // 0x54
    ULONG m_ulDataSize; // 0x58
    CHAR* m_pResourceBuffer; // 0x5C
};
*/

struct SoundManagerUnknownA {

};

// size: 0x18
struct SoundManagerUnknownB {
    LPDIRECTSOUNDBUFFER sound_buffer; // 0x0
    int32_t __int_4; // 0x4
    SoundData* data; // 0x8
    int32_t __int_C; // 0xC
    int32_t __int_10; // 0x10
    int __dword_14; // 0x14
    // 0x18

    // 0x4776F0
    dllexport gnu_noinline ZunResult thiscall __sub_4776F0(const char* filename) asm_symbol_rel(0x4776F0);
};
#pragma region // SoundManagerUnknownB Validation
ValidateFieldOffset32(0x0, SoundManagerUnknownB, sound_buffer);
ValidateFieldOffset32(0x4, SoundManagerUnknownB, __int_4);
ValidateFieldOffset32(0x8, SoundManagerUnknownB, data);
ValidateFieldOffset32(0xC, SoundManagerUnknownB, __int_C);
ValidateFieldOffset32(0x10, SoundManagerUnknownB, __int_10);
ValidateFieldOffset32(0x14, SoundManagerUnknownB, __dword_14);
ValidateStructSize32(0x18, SoundManagerUnknownB);
#pragma endregion

// size: 0x10C
struct SoundManagerUnknownD {
    unknown_fields(0x10C); // 0x0
};
#pragma region // SoundManagerUnknownD Validation
ValidateStructSize32(0x10C, SoundManagerUnknownD);
#pragma endregion

struct SoundManagerUnknownG {
    unknown_fields(0x78); // 0x0
    int __dword_78; // 0x78
    unknown_fields(0x10); // 0x7C
    HANDLE __handle_8C; // 0x8C
    // 0x90
};
#pragma region // SoundManagerUnknownG Validation
ValidateFieldOffset32(0x78, SoundManagerUnknownG, __dword_78);
ValidateFieldOffset32(0x8C, SoundManagerUnknownG, __handle_8C);
#pragma endregion

// This seems to be another part of CSound that isn't in my version of it...
struct SoundManagerUnknownE {

    // vtable ptr
    unknown_fields(0x4); // 0x4
    LPDIRECTSOUNDBUFFER* sound_buffer_array; // 0x8
    unknown_fields(0x4); // 0xC
    SoundManagerUnknownG* __smg_ptr_10; // 0x10
    uint32_t sound_buffer_count; // 0x14
    unknown_fields(0x8); // 0x18
    int __dword_20; // 0x20
    unknown_fields(0x34); // 0x24
    int __dword_58; // 0x58
    int __dword_5C; // 0x5C
    // 0x60

    // 0x48A620
    dllexport gnu_noinline HRESULT thiscall __sub_48A620(BOOL Arg1) asm_symbol_rel(0x48A620) {
        if (!this->sound_buffer_array) {
            return CO_E_NOTINITIALIZED;
        }
        this->__dword_58 = 0;
        this->__dword_5C = 0;
        HRESULT ret = 0;
        for (size_t i = 0; i < this->sound_buffer_count; ++i) {
            ret |= this->sound_buffer_array[i]->Stop();
            ret |= this->sound_buffer_array[i]->SetCurrentPosition(0);
        }
        this->__dword_20 = 0;
        if (Arg1) {
            SoundManagerUnknownG* smg_ptr = this->__smg_ptr_10;
            if (smg_ptr->__dword_78 == 1) {
                CloseHandle(smg_ptr->__handle_8C);
                smg_ptr->__handle_8C = INVALID_HANDLE_VALUE;
            }
        }
    }

    // 0x48AF10
    dllexport gnu_noinline void vectorcall __sub_48AF10(double arg1) asm_symbol_rel(0x48AF10) {
        use_var(arg1);
    }

    // This is giga jank
    virtual ~SoundManagerUnknownE() {}
};
#pragma region // SoundManagerUnknownE Validation
ValidateVirtualFieldOffset32(0x8, SoundManagerUnknownE, sound_buffer_array);
ValidateVirtualFieldOffset32(0x10, SoundManagerUnknownE, __smg_ptr_10);
ValidateVirtualFieldOffset32(0x14, SoundManagerUnknownE, sound_buffer_count);
ValidateVirtualFieldOffset32(0x20, SoundManagerUnknownE, __dword_20);
ValidateVirtualFieldOffset32(0x58, SoundManagerUnknownE, __dword_58);
ValidateVirtualFieldOffset32(0x5C, SoundManagerUnknownE, __dword_5C);
#pragma endregion

// size: 0x200
struct SoundManagerUnknownF {
    int32_t __int_array_0[60]; // 0x0
    unknown_fields(0x110); // 0xF0
};
#pragma region // SoundManagerUnknownF Validation
ValidateFieldOffset32(0x0, SoundManagerUnknownF, __int_array_0);
ValidateStructSize32(0x200, SoundManagerUnknownF);
#pragma endregion

extern "C" {
    // 0x4C9B80
    extern SoundData SOUND_DATA[SOUND_EFFECT_COUNT] asm("_SOUND_DATA");
}

typedef struct SoundManager SoundManager;

// 0x4B47A0
static inline constexpr const char *const SoundEffectFilenames[] = {
    "se_plst00.wav",
    "se_enep00.wav",
    "se_pldead00.wav",
    "se_power0.wav",
    "se_power1.wav",
    "se_tan00.wav",
    "se_tan01.wav",
    "se_tan02.wav",
    "se_ok00.wav",
    "se_cancel00.wav",
    "se_select00.wav",
    "se_gun00.wav",
    "se_cat00.wav",
    "se_lazer00.wav",
    "se_lazer01.wav",
    "se_enep01.wav",
    "se_damage00.wav",
    "se_item00.wav",
    "se_kira00.wav",
    "se_kira01.wav",
    "se_kira02.wav",
    "se_timeout.wav",
    "se_graze.wav",
    "se_powerup.wav",
    "se_pause.wav",
    "se_cardget.wav",
    "se_damage01.wav",
    "se_timeout2.wav",
    "se_invalid.wav",
    "se_slash.wav",
    "se_ch00.wav",
    "se_ch01.wav",
    "se_extend.wav",
    "se_cardget.wav",
    "se_nep00.wav",
    "se_bonus.wav",
    "se_bonus2.wav",
    "se_enep02.wav",
    "se_lazer02.wav",
    "se_nodamage.wav",
    "se_boon00.wav",
    "se_don00.wav",
    "se_boon01.wav",
    "se_ch02.wav",
    "se_ch03.wav",
    "se_extend2.wav",
    "se_pin00.wav",
    "se_pin01.wav",
    "se_lgods1.wav",
    "se_lgods2.wav",
    "se_lgods3.wav",
    "se_lgods4.wav",
    "se_lgodsget.wav",
    "se_msl.wav",
    "se_msl2.wav",
    "se_pldead01.wav",
    "se_heal.wav",
    "se_msl3.wav",
    "se_fault.wav",
    "se_noise.wav",
    "se_etbreak.wav",
    "se_tan03.wav",
    "se_wolf.wav",
    "se_bonus4.wav",
    "se_big.wav",
    "se_item01.wav",
    "se_release.wav",
    "se_changeitem.wav",
    "se_trophy.wav",
    "se_warpl.wav",
    "se_warpr.wav",
    "se_notice.wav"
};

// size: 0x573C
struct SoundManager {
    LPDIRECTSOUND8 dsound; // 0x0
    LPDIRECTSOUNDBUFFER sound_buffer_ptr; // 0x4
    HWND timer_hwnd; // 0x8
    CSoundManager* csound_manager_ptr; // 0xC
    DWORD sound_thread_id; // 0x10
    HANDLE __handle_14; // 0x14
    unknown_fields(0x4); // 0x18
    int32_t active_sound_ids[12]; // 0x1C
    int32_t active_sound_id_counts[12]; // 0x4C
    SoundManagerUnknownF __unknown_smf_array_7C[12]; // 0x7C
    void* bgm_format_offsets[16]; // 0x187C
    SoundManagerUnknownA* __unknown_sma_ptr_array_18BC[16]; // 0x18BC
    SoundManagerUnknownA* __unknown_sma_ptr_array_18FC[16]; // 0x18FC
    int __bgm_format_14_array_193C[16]; // 0x193C
    int __dword_197C; // 0x197C
    union {
        void* bgm_format_file; // 0x1980
        ThBgmFormat* bgm_formats;
    };
    char __text_buffer_1984[0x100]; // 0x1984
    SoundManagerUnknownB __unknown_smb_array_1A84[SOUND_EFFECT_COUNT]; // 0x1A84
    void* sound_effect_files[countof(SOUND_EFFECT_FILENAMES)]; // 0x2264
    char __text_buffer_2384[0x100]; // 0x2384
    SoundManagerUnknownD __unknown_smd_array_2484[32]; // 0x2484 (only 31 are used properly)
    char __text_buffer_array_4604[16][0x100]; // 0x4604
    char thbgm_filename[0x100]; // 0x5604
    SoundManagerUnknownE* __unknown_sme_ptr_5704; // 0x5704
    unknown_fields(0x4); // 0x5708
    HANDLE __handle_570C; // 0x570C
    unknown_fields(0x4); // 0x5710
    int32_t file_pointer_offset; // 0x5714
    HANDLE __thread_5718; // 0x5718
    HANDLE __handle_571C; // 0x571C
    DWORD __thread_id_5720; // 0x5720
    int __dword_5724; // 0x5724
    HWND main_window_hwnd; // 0x5728
    int __dword_572C; // 0x572C
    int __dword_5730; // 0x5730
    int __dword_5734; // 0x5734
    int __dword_5738; // 0x5738
    // 0x573C

    inline void zero_contents() {
        zero_this();
    }

    inline void copy_sound_data() {
        SoundManagerUnknownB* unknown_b_ptr = this->__unknown_smb_array_1A84;
        for (size_t i = 0; i < countof(this->__unknown_smb_array_1A84); ++unknown_b_ptr, ++i) {
            unknown_b_ptr->__int_4 = -1;
            SoundData* sound_data = SOUND_DATA;
            while (sound_data->id != i) ++sound_data;
            unknown_b_ptr->__int_C = i;
            unknown_b_ptr->data = sound_data;
        }
    }

    inline void free_bgm_format_file() {
        SAFE_FREE_FAST(this->bgm_format_file);
    }

    inline void release_smb_array() {
        SoundManagerUnknownB* smb_ptr = this->__unknown_smb_array_1A84;
        for (size_t i = 0; i < countof(this->__unknown_smb_array_1A84); ++smb_ptr, ++i) {
            SAFE_RELEASE(smb_ptr->sound_buffer);
        }
    }

    inline void free_all_sound_effect_files() {
        void** sound_file_pointer = this->sound_effect_files;
        for (size_t i = 0; i < countof(this->sound_effect_files); ++sound_file_pointer, ++i) {
            SAFE_FREE_FAST(*sound_file_pointer);
        }
    }

    inline void free_first_sma_array() {
        SoundManagerUnknownA** sma_ptr = this->__unknown_sma_ptr_array_18BC;
        for (size_t i = 0; i < countof(this->__unknown_sma_ptr_array_18BC); ++sma_ptr, ++i) {
            SAFE_FREE_FAST(*sma_ptr);
        }
    }

    SoundManager() {
        this->copy_sound_data();
    }

    // 0x476320
    dllexport static gnu_noinline int32_t __wait_and_close_handles() asm_symbol_rel(0x476320);

    // 0x4763D0
    dllexport static gnu_noinline DWORD WINAPI sound_thread_func(void* self) asm_symbol_rel(0x4763D0);

    // 0x476410
    dllexport gnu_noinline ZunResult thiscall __sub_476410(HWND window_hwnd_arg) asm_symbol_rel(0x476410);

    // 0x4767B0
    dllexport static gnu_noinline DWORD WINAPI load_sound_effects(void* self) asm_symbol_rel(0x4767B0);
    
    // 0x476890
    dllexport gnu_noinline int32_t thiscall __sub_476890(const char* filename) asm_symbol_rel(0x476890) {
        char buffer[128];
        const char* path;
        if (!(path = strrchr(filename, '/')) && !(path = strrchr(filename, '\\'))) {
            byteloop_strcpy(buffer, filename);
        } else {
            byteloop_strcpy(buffer, path + 1);
        }
        ThBgmFormat* bgm_formats = this->bgm_formats;
        size_t i = 0;
        for (; bgm_formats[i].filename[0] != '\0';) {
            // TODO
        }
    }
    
    // 0x476B40
    dllexport gnu_noinline void thiscall __sub_476B40() asm_symbol_rel(0x476B40);

    // 0x476BE0
    dllexport static gnu_noinline void stdcall __play_sound_centered(int32_t sound_id, float) asm_symbol_rel(0x476BE0);

    // 0x476C70
    dllexport static gnu_noinline void vectorcall __play_sound_positioned(int32_t sound_id, float position) asm_symbol_rel(0x476C70);

    static inline void __play_sound(int32_t sound_id) {
        if (sound_id >= 0) SoundManager::__play_sound_centered(sound_id, 0.0f);
    }

    static inline void __play_sound_positioned_validate(int32_t sound_id, float position) {
        if (sound_id >= 0) SoundManager::__play_sound_positioned(sound_id, position);
    }

    inline void cleanup() { // Might be destructor?
        this->__wait_and_close_handles();
        this->free_bgm_format_file();
        this->release_smb_array();
        this->free_all_sound_effect_files();
        if (this->csound_manager_ptr) {
            KillTimer(this->timer_hwnd, 1);
            this->__sub_476B40();
            this->dsound = NULL; // Isn't this supposed to be released though?
            this->sound_buffer_ptr->Stop();
            SAFE_RELEASE(this->sound_buffer_ptr);
            SAFE_DELETE(this->__unknown_sme_ptr_5704);
            SAFE_DELETE(this->csound_manager_ptr); // This destructor got inlined
            this->free_first_sma_array();
        }
    }
};
#pragma region // SoundManager Validation
ValidateFieldOffset32(0x0, SoundManager, dsound);
ValidateFieldOffset32(0x4, SoundManager, sound_buffer_ptr);
ValidateFieldOffset32(0x8, SoundManager, timer_hwnd);
ValidateFieldOffset32(0xC, SoundManager, csound_manager_ptr);
ValidateFieldOffset32(0x10, SoundManager, sound_thread_id);
ValidateFieldOffset32(0x14, SoundManager, __handle_14);
ValidateFieldOffset32(0x1C, SoundManager, active_sound_ids);
ValidateFieldOffset32(0x4C, SoundManager, active_sound_id_counts);
ValidateFieldOffset32(0x7C, SoundManager, __unknown_smf_array_7C);
ValidateFieldOffset32(0x187C, SoundManager, bgm_format_offsets);
ValidateFieldOffset32(0x18BC, SoundManager, __unknown_sma_ptr_array_18BC);
ValidateFieldOffset32(0x18FC, SoundManager, __unknown_sma_ptr_array_18FC);
ValidateFieldOffset32(0x193C, SoundManager, __bgm_format_14_array_193C);
ValidateFieldOffset32(0x197C, SoundManager, __dword_197C);
ValidateFieldOffset32(0x1980, SoundManager, bgm_format_file);
ValidateFieldOffset32(0x1A84, SoundManager, __unknown_smb_array_1A84);
ValidateFieldOffset32(0x2264, SoundManager, sound_effect_files);
ValidateFieldOffset32(0x2384, SoundManager, __text_buffer_2384);
ValidateFieldOffset32(0x2484, SoundManager, __unknown_smd_array_2484);
ValidateFieldOffset32(0x5604, SoundManager, thbgm_filename);
ValidateFieldOffset32(0x5704, SoundManager, __unknown_sme_ptr_5704);
ValidateFieldOffset32(0x570C, SoundManager, __handle_570C);
ValidateFieldOffset32(0x5714, SoundManager, file_pointer_offset);
ValidateFieldOffset32(0x5718, SoundManager, __thread_5718);
ValidateFieldOffset32(0x571C, SoundManager, __handle_571C);
ValidateFieldOffset32(0x5720, SoundManager, __thread_id_5720);
ValidateFieldOffset32(0x5724, SoundManager, __dword_5724);
ValidateFieldOffset32(0x5728, SoundManager, main_window_hwnd);
ValidateFieldOffset32(0x572C, SoundManager, __dword_572C);
ValidateFieldOffset32(0x5730, SoundManager, __dword_5730);
ValidateFieldOffset32(0x5734, SoundManager, __dword_5734);
ValidateFieldOffset32(0x5738, SoundManager, __dword_5738);
ValidateStructSize32(0x573C, SoundManager);
#pragma endregion

extern "C" {
    // 0x56AD80
    extern SoundManager SOUND_MANAGER asm("_SOUND_MANAGER");
}



// 0x453640
dllexport gnu_noinline UpdateFuncRet fastcall Supervisor::on_registration(void* self) {
    if (THDAT_ARCFILE.__sub_46EB80()) {
        char ver_file_name[64];
        int32_t ver_file_size;
        sprintf(ver_file_name, "th18_%.4x%c.ver", 100, 'a');
        void* ver_file = read_file_to_buffer(ver_file_name, &ver_file_size, false);
        SUPERVISOR.ver_file_buffer = ver_file;
        if (!ver_file) {
            LOG_BUFFER.write_error(JpEnStr("", "error : Wrong data version\r\n"));
        }
    }
    else {
        LOG_BUFFER.write_error(JpEnStr("", "error : data file does not exist\r\n"));
    }
    GAME_SPEED.value = 1.0f;
    SUPERVISOR.background_color = PackD3DCOLOR(255, 0, 0, 0);
    SUPERVISOR.__initialize_cameras();
    SUPERVISOR.__camera2_sub_454F50();
    DWORD time = timeGetTime();
    SUPERVISOR.initial_rng_seed = time;
    REPLAY_RNG.value = time;
    RNG.value = time;
    DWORD thread_id;
    SOUND_MANAGER.__handle_571C = CreateThread(
        NULL,
        0,
        &SoundManager::load_sound_effects,
        &SOUND_MANAGER,
        0,
        &thread_id
    );

}

// 0x4767B0
dllexport gnu_noinline DWORD WINAPI SoundManager::load_sound_effects(void* self) {
    int32_t i = 0;
    do {
        if (SOUND_MANAGER.__dword_5724 == 2) {
            return 1;
        }
        void* sound_effect_file = read_file_to_buffer(SoundEffectFilenames[i], NULL, false);
        SOUND_MANAGER.sound_effect_files[i] = sound_effect_file;
        if (!sound_effect_file) {
            LOG_BUFFER.write(JpEnStr("", "error : Sound File cannot read Check data %s\r\n"), SoundEffectFilenames[i]);
            return 1;
        }
    } while (++i < countof(SoundEffectFilenames));
    while (SOUND_MANAGER.__dword_5724 == 0) {
        Sleep(1);
    }
    return 0;
}

// 0x4776F0
dllexport gnu_noinline ZunResult thiscall SoundManagerUnknownB::__sub_4776F0(const char* filename) {
    if (SOUND_MANAGER.csound_manager_ptr) {
        SAFE_RELEASE(this->sound_buffer);
        SoundManagerUnknownB* unknown_b_ptr = SOUND_MANAGER.__unknown_smb_array_1A84;
        int32_t idk = this->__int_C;
        int32_t current_filename_index = this->data->filename_index;
        for (int32_t i = 0; i < idk; ++i, ++unknown_b_ptr) {
            if (unknown_b_ptr->data->filename_index == current_filename_index) {
                SOUND_MANAGER.dsound->DuplicateSoundBuffer(SOUND_MANAGER.__unknown_smb_array_1A84[i].sound_buffer, &this->sound_buffer);
                return ZUN_SUCCESS;
            }
        }
        while (!SOUND_MANAGER.sound_effect_files[this->data->filename_index]) {
            Sleep(10);
        }
        const char* error_text;
        if (WavFile* sound_file = (WavFile*)SOUND_MANAGER.sound_effect_files[this->data->filename_index]) {
            if (!strncmp(sound_file->header.riff_text, "RIFF", sizeof(sound_file->header.riff_text))) {
                error_text = JpEnStr("Wav t@C %s\r\n", "Not a Wav file %s\r\n");
                goto OtherError;
            }
            int32_t file_size = sound_file->header.remaining_file_size;
            if (!strncmp(sound_file->header.wave_text, "WAVE", sizeof(sound_file->header.wave_text))) {
                goto MalformedWaveError;
            }
            int32_t data_size = file_size - sizeof(WavFileHeader);
            WAVEFORMATEX* wav_format_ptr = (WAVEFORMATEX*)get_wav_chunk_data(sound_file->chunks, "fmt ", &file_size, data_size);
            if (!wav_format_ptr) {
                goto MalformedWaveError;
            }
            WAVEFORMATEX wav_format = *wav_format_ptr;
            unsigned char* sound_data_ptr = get_wav_chunk_data(sound_file->chunks, "data", &file_size, data_size);
            if (!sound_data_ptr) {
                goto MalformedWaveError;
            }
            DSBUFFERDESC wav_buffer_desc = {
                .dwSize = sizeof(DSBUFFERDESC),
                .dwFlags = DSBCAPS_GLOBALFOCUS | DSBCAPS_CTRLPAN | DSBCAPS_CTRLVOLUME | DSBCAPS_LOCSOFTWARE,
                .dwBufferBytes = (DWORD)file_size,
                .dwReserved = 0,
                .lpwfxFormat = &wav_format,
                .guid3DAlgorithm = DS3DALG_DEFAULT
            };
            if (SUCCEEDED(SOUND_MANAGER.dsound->CreateSoundBuffer(&wav_buffer_desc, &this->sound_buffer, NULL))) {
                LPVOID buffer_contents_ptr_A, buffer_contents_ptr_B;
                DWORD buffer_contents_size_A, buffer_contents_size_B;
                if (SUCCEEDED(this->sound_buffer->Lock(0, file_size, &buffer_contents_ptr_A, &buffer_contents_size_A, &buffer_contents_ptr_B, &buffer_contents_size_B, 0))) {
                    memcpy(buffer_contents_ptr_A, sound_data_ptr, buffer_contents_size_A);
                    if (buffer_contents_size_B) {
                        memcpy(buffer_contents_ptr_B, sound_data_ptr + buffer_contents_size_A, buffer_contents_size_B);
                    }
                    this->sound_buffer->Unlock(buffer_contents_ptr_A, buffer_contents_size_A, buffer_contents_ptr_B, buffer_contents_size_B);
                    SAFE_FREE(SOUND_MANAGER.sound_effect_files[this->data->filename_index]);
                    DebugLogger::__debug_log_stub_10("Create Sound Buffer %s\n", filename);
                }
            }
        }
        else {
MalformedWaveError:
            error_text = JpEnStr("Wav t@C? %s\r\n", "Isn't it a Wav file? %s\r\n");
OtherError:
            LOG_BUFFER.write(error_text, filename);
            SAFE_FREE(SOUND_MANAGER.sound_effect_files[this->data->filename_index]);
            return ZUN_ERROR;
        }
    }
    return ZUN_SUCCESS;
}

// 0x476320
dllexport gnu_noinline int32_t SoundManager::__wait_and_close_handles() {
    if (SOUND_MANAGER.__thread_5718) {
        SOUND_MANAGER.__dword_5724 = SOUND_MANAGER.__dword_5724 == 0 ? 1 : SOUND_MANAGER.__dword_5724;
        while (WaitForSingleObject(SOUND_MANAGER.__thread_5718, 100) == WAIT_TIMEOUT) {
            Sleep(1);
        }
        while (WaitForSingleObject(SOUND_MANAGER.__handle_571C, 100) == WAIT_TIMEOUT) {
            Sleep(1);
        }
        CloseHandle(SOUND_MANAGER.__thread_5718);
        CloseHandle(SOUND_MANAGER.__handle_571C);
        SOUND_MANAGER.__thread_5718 = NULL;
        SOUND_MANAGER.__handle_571C = NULL;
    }
    return 0;
}

// 0x4763D0
dllexport gnu_noinline DWORD WINAPI SoundManager::sound_thread_func(void* self) {
    SOUND_MANAGER.__sub_476410(SOUND_MANAGER.main_window_hwnd);
    while (!SOUND_MANAGER.__dword_5724) {
        Sleep(1);
    }
    SOUND_MANAGER.__dword_572C = 1;
    return 0;
}

// 0x476410
dllexport gnu_noinline ZunResult SoundManager::__sub_476410(HWND window_hwnd_arg) {
    HWND window_hwnd = window_hwnd_arg;
    this->copy_sound_data();
    memset(this->active_sound_ids, -1, sizeof(this->active_sound_ids));
    CSoundManager* csound_manager_ptr = new CSoundManager();
    this->csound_manager_ptr = csound_manager_ptr;
    if (SUCCEEDED(csound_manager_ptr->Initialize(window_hwnd, DSSCL_PRIORITY))) {
        csound_manager_ptr->SetPrimaryBufferFormat(2, 44100, 16);
        LPDIRECTSOUND8 dsound = this->csound_manager_ptr->GetDirectSound();
        this->dsound = dsound;
        LPDIRECTSOUNDBUFFER* buffer_ptr_ptr = &this->sound_buffer_ptr;
        WAVEFORMATEX sound_format = {
            .wFormatTag = WAVE_FORMAT_1S08,
            .nChannels = 2,
            .nSamplesPerSec = 44100,
            .nAvgBytesPerSec = 176400,
            .nBlockAlign = 4,
            .wBitsPerSample = 16,
            .cbSize = 0
        };
        DSBUFFERDESC buffer_desc = {
            .dwSize = sizeof(DSBUFFERDESC),
            .dwFlags = DSBCAPS_GLOBALFOCUS | DSBCAPS_LOCSOFTWARE,
            .dwBufferBytes = 0x8000,
            .dwReserved = 0,
            .lpwfxFormat = &sound_format,
            .guid3DAlgorithm = DS3DALG_DEFAULT
        };
        if (FAILED(dsound->CreateSoundBuffer(&buffer_desc, buffer_ptr_ptr, NULL))) {
            return ZUN_ERROR;
        }
        LPVOID buffer_contents_ptr_A;
        DWORD buffer_contents_size_A;
        LPVOID buffer_contents_ptr_B;
        DWORD buffer_contents_size_B;
        if (FAILED((*buffer_ptr_ptr)->Lock(0, 0x8000, &buffer_contents_ptr_A, &buffer_contents_size_A, &buffer_contents_ptr_B, &buffer_contents_size_B, 0))) {
            return ZUN_ERROR;
        }
        memset(buffer_contents_ptr_A, 0, buffer_contents_size_A);
        (*buffer_ptr_ptr)->Unlock(buffer_contents_ptr_A, buffer_contents_size_A, buffer_contents_ptr_B, buffer_contents_size_B);
        (*buffer_ptr_ptr)->Play(0, 0, DSBPLAY_LOOPING);
        this->__dword_5730 = 100;
        this->__dword_5734 = 100;
        SetTimer(window_hwnd, 0, 250, NULL);
        this->timer_hwnd = window_hwnd;
        window_hwnd = NULL;
        SoundManagerUnknownB* unknown_b_ptr = this->__unknown_smb_array_1A84;
        SoundData* sound_data = SOUND_DATA;
        for (size_t i = 0; sound_data < array_end_addr(SOUND_DATA); ++i, ++sound_data, ++unknown_b_ptr) {
            if (SOUND_MANAGER.__dword_5724 == 2) {
                return ZUN_ERROR;
            }
            if (ZUN_FAILED(unknown_b_ptr->__sub_4776F0(SOUND_EFFECT_FILENAMES[sound_data->filename_index]))) {
                LOG_BUFFER.write(
                    JpEnStr("error : Sound t@C f[^mF %s\r\n", "error : Sound File cannot read Check data %s\r\n")
                    , SOUND_EFFECT_FILENAMES[SOUND_DATA[i].filename_index]
                );
                return ZUN_ERROR;
            }
        }
        LOG_BUFFER.write(JpEnStr("DirectSound \r\n", "DirectSound has been successfully initialized\r\n"));
        return ZUN_SUCCESS;
    } else {
        LOG_BUFFER.write(JpEnStr("DirectSound IuWFNgs\r\n", "Initialization of DirectSound object failed\r\n"));
        if (this->csound_manager_ptr) {
            SAFE_DELETE(this->csound_manager_ptr);
        }
        return ZUN_ERROR;
    }
}

// 0x476B40
dllexport gnu_noinline void thiscall SoundManager::__sub_476B40() {
    if (SoundManagerUnknownE* sme_ptr = this->__unknown_sme_ptr_5704) {
        sme_ptr->__sub_48A620(true);
        if (this->__handle_14) {
            do {
                PostThreadMessageA(this->sound_thread_id, WM_QUIT, 0, 0);
            } while (WaitForSingleObject(this->__handle_14, 256));
            CloseHandle(this->__handle_14);
            CloseHandle(this->__handle_570C);
            this->__handle_14 = 0;
        }
    }
    SAFE_DELETE(this->__unknown_sme_ptr_5704);
}

// 0x476BE0
dllexport gnu_noinline void stdcall SoundManager::__play_sound_centered(int32_t sound_id, float) {
    int32_t idk = SOUND_DATA[sound_id].__short_A;
    nounroll for (size_t i = 0; i < countof(SOUND_MANAGER.active_sound_ids); ++i) {
        int32_t active_sound_id = SOUND_MANAGER.active_sound_ids[i];
        if (active_sound_id < 0) {
            SOUND_MANAGER.active_sound_ids[i] = sound_id;
            SOUND_MANAGER.__unknown_smf_array_7C[i].__int_array_0[0] = 0;
            SOUND_MANAGER.active_sound_id_counts[i] = 1;
            SOUND_MANAGER.__unknown_smb_array_1A84[i].__int_4 = idk;
            return;
        }
        if (active_sound_id == sound_id) {
            int32_t active_sound_id_count = SOUND_MANAGER.active_sound_id_counts[i];
            int32_t* active_sound_id_count_ptr = &SOUND_MANAGER.active_sound_id_counts[i];
            if (active_sound_id_count < 60 && active_sound_id_count >= 0) {
                SOUND_MANAGER.__unknown_smf_array_7C[i].__int_array_0[active_sound_id_count] = 0;
                ++*active_sound_id_count_ptr;
            }
            return;
        }
    }
}

// 0x476C70
dllexport gnu_noinline void vectorcall SoundManager::__play_sound_positioned(int32_t sound_id, float position) {
    int32_t idk = SOUND_DATA[sound_id].__short_A;
    int32_t idk2 = (int32_t)(position * 1000.0f / 192.0f);
    nounroll for (size_t i = 0; i < countof(SOUND_MANAGER.active_sound_ids); ++i) {
        int32_t active_sound_id = SOUND_MANAGER.active_sound_ids[i];
        if (active_sound_id < 0) {
            SOUND_MANAGER.active_sound_ids[i] = sound_id;
            SOUND_MANAGER.__unknown_smf_array_7C[i].__int_array_0[0] = idk2;
            SOUND_MANAGER.active_sound_id_counts[i] = 1;
            SOUND_MANAGER.__unknown_smb_array_1A84[i].__int_4 = idk;
            return;
        }
        if (active_sound_id == sound_id) {
            int32_t active_sound_id_count = SOUND_MANAGER.active_sound_id_counts[i];
            int32_t* active_sound_id_count_ptr = &SOUND_MANAGER.active_sound_id_counts[i];
            if (active_sound_id_count < 60 && active_sound_id_count >= 0) {
                SOUND_MANAGER.__unknown_smf_array_7C[i].__int_array_0[active_sound_id_count] = idk2;
                ++*active_sound_id_count_ptr;
            }
            return;
        }
    }
}

enum ReplayMode {
    __replay_mode_0 = 0,
    __replay_mode_1 = 1,
    __replay_mode_2 = 2
};

typedef struct GameThread GameThread;
extern "C" {
    // 0x4CF2E4
    extern GameThread* GAME_THREAD_PTR asm("_GAME_THREAD_PTR");
}

// size: 0xD8
struct GameThread : ZUNTask {
    //ZUNTask base; // 0x0
    Timer __timer_C; // 0xC
    int32_t stage_number; // 0x20
    int32_t chapter; // 0x24
    Config config; // 0x28
    union {
        uint32_t flags; // 0xB0
        struct {
            uint32_t __unknown_flag_A : 1; // 1
            uint32_t __unknown_flag_B : 1; // 2
            uint32_t skip_flag : 1; // 3
            uint32_t __unknown_flag_H : 1; // 4
            uint32_t __unknown_flag_I : 1; // 5
            uint32_t : 2; // 6-7
            uint32_t __unknown_flag_J : 1; // 8
            uint32_t __unknown_flag_D : 1; // 9
            uint32_t : 1; // 10
            uint32_t __unknown_flag_C : 1; // 11
            uint32_t __unknown_flag_K : 1; // 12
            uint32_t : 2; // 13-14
            uint32_t __unknown_flag_E : 1; // 15
            uint32_t : 1; // 16
            uint32_t __unknown_flag_F : 1; // 17
            uint32_t __unknown_flag_G : 1; // 18
        };
    };
    unknown_fields(0x4); // 0xB4
    int __int_B8; // 0xB8
    unknown_fields(0x14); // 0xBC
    ReplayMode replay_mode; // 0xD0
    int __int_D4; // 0xD4
    // 0xD8

    // 0x4437B0
    GameThread(ReplayMode mode) {

    }

    // 0x439E80
    dllexport gnu_noinline void thiscall set_chapter(int32_t chapter) asm_symbol_rel(0x439E80) {
        GAME_MANAGER.globals.chapter = chapter;
        GAME_THREAD_PTR->chapter = chapter;
    }
};

typedef int32_t (*volatile fastcall AnmOnFunc)(AnmVM*);
typedef int32_t (*volatile fastcall AnmOnFuncArg)(AnmVM*, int32_t);

extern inline const AnmOnFunc ANM_ON_WAIT_FUNCS[];
//extern inline const AnmOnFunc ANM_ON_TICK_FUNCS[];
//extern inline const AnmOnFunc ANM_ON_DRAW_FUNCS[];
//extern inline const AnmOnFunc ANM_ON_DESTROY_FUNCS[];
//extern inline const AnmOnFuncArg ANM_ON_INTERRUPT_FUNCS[];
extern inline const AnmOnFunc ANM_ON_COPY_A_FUNCS[];
extern inline const AnmOnFunc ANM_ON_COPY_B_FUNCS[];
//extern inline const AnmOnFuncArg ANM_ON_SPRITE_LOOKUP_FUNCS[];
extern "C" {
    extern AnmOnFunc ANM_ON_TICK_FUNCS[] asm("_ANM_ON_TICK_FUNCS");
    extern AnmOnFunc ANM_ON_DESTROY_FUNCS[] asm("_ANM_ON_DESTROY_FUNCS");
    extern AnmOnFuncArg ANM_ON_INTERRUPT_FUNCS[] asm("_ANM_ON_INTERRUPT_FUNCS");
    extern AnmOnFuncArg ANM_ON_SPRITE_LOOKUP_FUNCS[] asm("_ANM_ON_SPRITE_LOOKUP_FUNCS");
    extern AnmOnFunc ANM_ON_DRAW_FUNCS[] asm("_ANM_ON_DRAW_FUNCS");
}

// size: 0x8
struct AnmInstruction {
    int16_t opcode; // 0x0
    uint16_t offset_to_next; // 0x2
    int16_t time; // 0x4
    uint16_t param_mask; // 0x6
    unsigned char args[]; // 0x8
};

enum AnmVMCreationListType {
    WorldListBack,
    WorldListFront,
    UiListBack,
    UiListFront,
};
union AnmVMCreationFlags {
    uint32_t raw;
    struct {
        uint32_t __unknown_flag_A : 1; // 1
        uint32_t list_type : 2; // 2-3
        uint32_t __unknown_flag_B : 1; // 4
    };
};

enum AnmVMState {
    Normal = 0,
    MarkedForDelete,
    Deleted
};

enum AnmBlendMode : uint8_t {

};

enum AnmUVMode : uint8_t {
    Wrap = 0,
    Clamp = 1,
    Mirror = 2
};

// size: 0x60C
struct AnmVM {
    struct AnmContextVars {
        int32_t int_vars[4]; // 0x0
        float float_vars[4]; // 0x10
        Float3 __float3_20; // 0x20
        int32_t counter_vars[2]; // 0x2C
        float rand_scale; // 0x34
        float rand_angle_scale; // 0x38
        int32_t rand_int_range; // 0x3C
    };
    struct AnmVMData {
        Timer interrupt_return_time; // 0x0
        int32_t interrupt_return_offset; // 0x14
        uint32_t layer; // 0x18
        int32_t slot; // 0x1C
        int32_t slot2; // 0x20
        int32_t sprite_id; // 0x24
        int32_t script_id; // 0x28
        int32_t current_instruction_offset; // 0x2C
        Float3 position; // 0x30
        Float3 rotation; // 0x3C
        Float3 angular_velocity; // 0x48
        Float2 scale; // 0x54
        Float2 scale2; // 0x5C
        Float2 scale_delta; // 0x64
        Float2 uv_scale; // 0x6C
        Float2 sprite_size; // 0x74
        Float2 uv_scroll; // 0x7C
        Float3 anchor_offset; // 0x84
        ZUNInterp<Float3> position_interp; // 0x90
        ZUNInterp<RGB> color_interp; // 0xE8
        ZUNInterp<int32_t> alpha_interp; // 0x140
        ZUNInterp<Float3> rotation_interp; // 0x170
        ZUNInterp<ZUNAngle> angular_velocity_interp; // 0x1C8
        ZUNInterp<Float2> scale_interp; // 0x1F8
        ZUNInterp<Float2> scale2_interp; // 0x23C
        ZUNInterp<Float2> uv_scale_interp; // 0x280
        ZUNInterp<RGB> color2_interp; // 0x2C4
        ZUNInterp<int32_t> alpha2_interp; // 0x31C
        ZUNInterp<float> u_scroll_speed_interp; // 0x34C
        ZUNInterp<float> v_scroll_speed_interp; // 0x37C
        Float2 sprite_uv_quad[4]; // 0x3AC
        Float2 uv_scroll_speed; // 0x3CC
        D3DMATRIXZ __matrix_3D4; // 0x3D4
        D3DMATRIXZ __matrix_414; // 0x414
        D3DMATRIXZ __matrix_454; // 0x454
        int32_t run_interrupt; // 0x494
        int32_t __last_sprite_set_time; // 0x498
        unknown_fields(0x4); // 0x49C
        uint16_t script_id2; // 0x4A0
        unknown_fields(0x2); // 0x4A2
        AnmContextVars current_context_vars; // 0x4A4
        Float3 __position_2; // 0x4E4
        Float3 __render_quad[4]; // 0x4F0
        AnmVMCreationFlags creation_flags; // 0x520
        D3DCOLOR color1; // 0x524
        D3DCOLOR color2; // 0x528
        D3DCOLOR mixed_inherited_color; // 0x52C
        uint8_t font_width; // 0x530
        uint8_t font_height; // 0x531
        probably_padding_bytes(0x2); // 0x532
        union {
            uint32_t flags_low; // 0x534
            struct {
                uint32_t visible : 1; // 1
                uint32_t __unknown_flag_J : 1; // 2
                uint32_t __z_rotation : 1; // 3
                uint32_t __scale_related_A : 1; // 4
                uint32_t : 1; // 5
                uint32_t blend_mode : 4; // 6-9
                uint32_t : 1; // 10
                uint32_t position_mode : 1; // 11
                uint32_t mirror_x : 1; // 12
                uint32_t mirror_y : 1; // 13
                uint32_t : 1; // 14
                uint32_t disable_z_write : 1; // 15
                uint32_t : 1; // 16
                uint32_t __unknown_std_flag_A : 1; // 17
                uint32_t color_mode : 3; // 18-20
                uint32_t : 1; // 21
                uint32_t __unknown_flag_O : 1; // 22
                uint32_t x_anchor_mode : 2; // 23-24
                uint32_t y_anchor_mode : 2; // 25-26
                uint32_t type : 5; // 27-31
                uint32_t : 1; // 32
            };
        };
        union {
            uint32_t flags_high; // 0x538
            struct {
                uint32_t v_scroll_mode : 2; // 1-2
                uint32_t u_scroll_mode : 2; // 3-4
                uint32_t rotation_mode : 3; // 5-7
                uint32_t __vm_state : 2; // 8-9
                uint32_t auto_rotate : 1; // 10
                uint32_t __unknown_flag_T : 1; // 11
                uint32_t slowdown_immune : 1; // 12
                uint32_t use_animation_rng : 1; // 13
                uint32_t nearest_neighbor : 1; // 14
                uint32_t : 1; // 15
                uint32_t __unknown_flag_Q : 1; // 16
                uint32_t __unknown_field_B : 2; // 17-18
                uint32_t __use_root_vm_custom_slowdown : 1; // 19
                uint32_t : 1; // 20
                uint32_t origin_mode : 2; // 21-22
                uint32_t resolution_mode : 3; // 23-25
                uint32_t inherit_rotation : 1; // 26
                uint32_t __unknown_flag_U : 1; // 27
                uint32_t colorize_children : 1; // 28
                uint32_t __unknown_flag_F : 1; // 29
                uint32_t : 1; // 30
                uint32_t enable_camera_fade : 1; // 31
                uint32_t : 1; // 32
            };
        };
        Float2 __float2_53C; // 0x53C
        // 0x544
    };
    static_assert(sizeof(AnmVMData) == 0x544);
    struct AnmVMController {
        AnmID id; // 0x0 (0x544)
        uint32_t fast_id; // 0x4 (0x548)
        Timer script_time; // 0x8 (0x54C)
        Timer __timer_1C; // 0x1C (0x560)
        ZUNLinkedList<AnmVM> global_list_node; // 0x30 (0x574)
        ZUNLinkedList<AnmVM> child_list_node; // 0x40 (0x584)
        ZUNLinkedListHead<AnmVM> child_list_head; // 0x50 (0x594)
        //ZUNLinkedList<AnmVM> child_list_head; // 0x50 (0x594)
        ZUNLinkedList<AnmVM> destroy_list_node; // 0x60 (0x5A4)
        AnmVM* next_in_layer; // 0x70 (0x5B4)
        AnmVM* prev_in_layer; // 0x74 (0x5B8)
        AnmVM* __root_vm; // 0x78 (0x5BC)
        AnmVM* parent; // 0x7C (0x5C0)
        float slowdown; // 0x80 (0x5C4)
        void* special_data; // 0x84 (0x5C8)
        uint32_t special_data_size; // 0x88 (0x5CC)
        uint32_t on_wait_index; // 0x8C (0x5D0)
        uint32_t on_tick_index; // 0x90 (0x5D4)
        uint32_t on_draw_index; // 0x94 (0x5D8)
        uint32_t on_destroy_index; // 0x98 (0x5DC)
        uint32_t on_interrupt_index; // 0x9C (0x5E0)
        uint32_t on_copy_A_index; // 0xA0 (0x5E4)
        uint32_t on_copy_B_index; // 0xA4 (0x5E8)
        uint32_t on_sprite_lookup_index; // 0xA8 (0x5EC)
        Float3 position; // 0xAC (0x5F0)
        void* associated_entity; // 0xB8 (0x5FC)
        Float3 __rotation_related; // 0xBC (0x600)

        inline void zero_contents() {
            zero_this();
        }
    };
    ValidateStructSize32(0xC8, AnmVMController);

    AnmVMData data; // 0x0
    AnmVMController controller; // 0x544
    // 0x60C

    inline void zero_contents() {
        zero_this();
    }

    AnmVM() {
        this->zero_contents();
        this->data.sprite_id = -1;
        this->data.current_instruction_offset = -1;
    }

    // 0x4894D0
    dllexport gnu_noinline AnmLoaded* thiscall get_anm_loaded() asm_symbol_rel(0x4894D0);

    template <typename L>
    inline AnmVM* search_roots(L&& lambda) {
        AnmVM* search = this;
        while ((search = search->controller.__root_vm) && !lambda(search));
        return search;
    }
    
    // 0x4066B0
    dllexport gnu_noinline void thiscall set_layer(int32_t layer) asm_symbol_rel(0x4066B0) {
        // IDFK how this one was originally structured
        this->data.layer = layer;
        switch (layer) {
            default:
                this->data.origin_mode = 0;
                break;
            case 3 ... 19:
                this->data.origin_mode = 1;
                break;
            case 20 ... 23:
                this->data.origin_mode = 2;
                break;
        }
        switch (layer) {
            case 20 ... 32: case 37 ... 45:
                this->data.resolution_mode = 1;
                break;
        }
    }

    // 0x405BB0
    dllexport gnu_noinline float vectorcall get_root_vm_custom_slowdown() asm_symbol_rel(0x405BB0) {
        return this->search_roots([](AnmVM* vm) static_lambda {
            return vm->data.__use_root_vm_custom_slowdown;
        })->controller.slowdown;
    }

    // 0x405AD0
    dllexport gnu_noinline void thiscall set_position_interp_bezier(int32_t end_time, Float3* initial_pos, Float3* bezier1, Float3* final_pos, Float3* bezier2) asm_symbol_rel(0x405AD0) {
        this->data.position_interp.end_time = end_time;
        this->data.position_interp.mode[0] = 8;
        this->data.position_interp.initial_value = *initial_pos;
        this->data.position_interp.final_value = *final_pos;
        this->data.position_interp.bezier1 = *bezier1;
        this->data.position_interp.bezier2 = *bezier2;
        this->data.position_interp.time.reset();
    }

    // 0x405CE0
    dllexport gnu_noinline float vectorcall get_z_rotation() asm_symbol_rel(0x405CE0) {
        return this->data.rotation.z;
    }

    // 0x406630
    dllexport gnu_noinline void thiscall initialize_alpha_interp(int32_t end_time, int32_t mode, uint8_t initial_alpha, uint8_t final_alpha) asm_symbol_rel(0x406630) {
        this->data.alpha_interp.end_time = end_time;
        this->data.alpha_interp.mode[0] = mode;
        this->data.alpha_interp.initial_value = initial_alpha;
        this->data.alpha_interp.final_value = final_alpha;
        this->data.alpha_interp.bezier1 = 0;
        this->data.alpha_interp.bezier2 = 0;
        this->data.alpha_interp.time.reset();
    }


    inline float get_custom_slowdown() {
        AnmVM* root_vm = this->controller.__root_vm;
        if (root_vm && this->data.__use_root_vm_custom_slowdown) {
            return this->get_root_vm_custom_slowdown();
        } else {
            return this->controller.slowdown;
        }
    }

    inline void set_custom_slowdown(float slowdown_value) {
        this->controller.slowdown = slowdown_value;
    }

    inline void clear_all() {
        Float3 controller_position = this->controller.position;
        uint32_t vm_fast_id = this->controller.fast_id;
        int32_t vm_layer = this->data.layer;
        this->zero_contents();
        this->controller.position = controller_position;
        this->controller.fast_id = vm_fast_id;
        this->data.layer = vm_layer;
    }

    inline void clear_controller() {
        Float3 controller_position = this->controller.position;
        int32_t vm_layer = this->data.layer;
        uint32_t vm_fast_id = this->controller.fast_id;
        this->controller.zero_contents();
        this->controller.fast_id = vm_fast_id;
        this->data.layer = vm_layer;
        this->controller.position = controller_position;
    }
    
    // 0x406730
    dllexport gnu_noinline void set_controller_position(Float3* position) asm_symbol_rel(0x406730) {
        this->controller.position = *position;
    }

    // 0x41B430
    dllexport gnu_noinline void reset() asm_symbol_rel(0x41B430) {
        this->clear_all();
        this->data.scale = { 1.0f, 1.0f };
        this->data.scale2 = { 1.0f, 1.0f };
        this->data.uv_scale = { 1.0f, 1.0f };
        this->data.color1 = PackD3DCOLOR(255, 255, 255, 255);
        this->data.__matrix_3D4.set_identity();
        this->controller.script_time.default_values();
        this->controller.__timer_1C.default_values();
        this->data.position_interp.end_time = 0;
        //this->data.color_interp.end_time = 0;
        this->data.alpha_interp.end_time = 0;
        this->data.rotation_interp.end_time = 0;
        this->data.angular_velocity_interp.end_time = 0;
        //this->data.scale_interp.end_time = 0;
        this->data.scale2_interp.end_time = 0;
        this->data.uv_scale_interp.end_time = 0;
        this->data.color2_interp.end_time = 0;
        this->data.alpha2_interp.end_time = 0;
        this->data.u_scroll_speed_interp.end_time = 0;
        this->data.v_scroll_speed_interp.end_time = 0;
        this->data.__unknown_field_B = 1;
        this->data.current_context_vars.rand_scale = 1.0f;
        this->data.current_context_vars.rand_angle_scale = PI_f;
        this->data.current_context_vars.rand_int_range = UINT16_MAX + 1;
        // Technically memset 0 isn't guaranteed to assign NULL to pointers
        // according to official C/C++ standards. Instead literal 0 is given
        // special meanings in the context of pointers.
        // Assigning 0 to a pointer will initialize it with the platform-dependent
        // null pointer value, which could be 0x55555555 or some BS on hypothetical
        // exotic platforms. Memset doesn't do this, instead copying the bytes
        // verbatum with no guarantees about pointer contents.
        //
        // TLDR: Even if you memset something to 0, the standard doesn't guarantee
        // pointers will be NULL. ZUN is *technically* following best practice here!
        //
        // It's still stupid though.
        this->controller.__root_vm = NULL;
        this->controller.parent = NULL;
        this->controller.global_list_node.initialize_with(this);
        this->controller.child_list_node.initialize_with(this);
        this->controller.child_list_head.initialize_with(this);
        this->controller.destroy_list_node.initialize_with(this);
    }

    // 0x41B6F0
    dllexport gnu_noinline void cleanup() asm_symbol_rel(0x41B6F0) {
        if (void* special_data = this->controller.special_data) {
            free(special_data);
        }
        this->controller.special_data = NULL;
        this->controller.special_data_size = 0;
        this->controller.id = 0;
        this->data.current_instruction_offset = -1;
        for (
            AnmVM* vm = this;
            vm->controller.next_in_layer;
            // vm = vm->controller.next_in_layer
        ) {
            vm->controller.id = 0;
        }
    }

    // 0x41B750
    inline ~AnmVM() {
        this->cleanup();
    }

#define declare_on_func(func_name, index_var, func_table, ...) \
    inline int32_t func_name(MACRO_FIRST_EVAL(__VA_ARGS__) MACRO_SECOND_EVAL(__VA_ARGS__,)) { \
        if (uint32_t index = this->controller.index_var) { \
            return (func_table[index])(this __VA_OPT__(,) MACRO_SECOND_EVAL(__VA_ARGS__,)); \
        } else return 0; \
    }

    declare_on_func(run_on_wait, on_wait_index, ANM_ON_WAIT_FUNCS);
    declare_on_func(run_on_tick, on_tick_index, ANM_ON_TICK_FUNCS);
    declare_on_func(run_on_draw, on_draw_index, ANM_ON_DRAW_FUNCS);
    declare_on_func(run_on_destroy, on_destroy_index, ANM_ON_DESTROY_FUNCS);
    declare_on_func(run_on_interrupt, on_interrupt_index, ANM_ON_INTERRUPT_FUNCS, int32_t, interrupt);
    declare_on_func(run_on_copy_A, on_copy_A_index, ANM_ON_COPY_A_FUNCS);
    declare_on_func(run_on_copy_B, on_copy_B_index, ANM_ON_COPY_B_FUNCS);
    declare_on_func(run_on_sprite_lookup, on_sprite_lookup_index, ANM_ON_SPRITE_LOOKUP_FUNCS, int32_t, sprite);

#undef declare_on_func

    // 0x412F20
    dllexport inline void thiscall interrupt(int32_t interrupt_index) asm_symbol_rel(0x412F20) {
        this->run_on_interrupt(interrupt_index);
        this->data.run_interrupt = interrupt_index;
    }

    inline AnmInstruction* get_current_instruction();

    // 0x47D8B0
    dllexport gnu_noinline void vectorcall set_scale_delta(float x, float y) asm_symbol_rel(0x47D8B0) {
        this->data.__unknown_flag_U = true;
        this->data.scale_delta.x = x;
        this->data.scale_delta.y = y;
    }
    // 0x47D8D0
    dllexport gnu_noinline void vectorcall set_angular_velocity(float x, float y, float z) asm_symbol_rel(0x47D8D0) {
        this->data.__unknown_flag_U = true;
        this->data.angular_velocity.x = x;
        this->data.angular_velocity.y = y;
        this->data.angular_velocity.z = z;
    }
    
    // 0x43A250
    dllexport gnu_noinline float vectorcall get_scaled_sprite_x_size() asm_symbol_rel(0x43A250) {
        return this->data.sprite_size.x * this->data.scale.x;
    }
    
    // 0x43A260
    dllexport gnu_noinline float vectorcall get_scaled_sprite_y_size() asm_symbol_rel(0x43A260) {
        return this->data.sprite_size.y * this->data.scale.y;
    }

    // 0x478580
    dllexport gnu_noinline int32_t run_anm() asm_symbol_rel(0x478580);

    // 0x488EF0
    dllexport void __unknown_tree_set_J() asm_symbol_rel(0x488EF0) {
        this->data.__unknown_flag_J = true;
        this->controller.child_list_head.for_each([](AnmVM* vm) gnu_always_inline static_lambda {
            clang_noinline vm->__unknown_tree_set_J();
        });
    }

    // 0x488F20
    dllexport void __unknown_tree_clear_J() asm_symbol_rel(0x488F20) {
        this->data.__unknown_flag_J = false;
        this->controller.child_list_head.for_each([](AnmVM* vm) gnu_always_inline static_lambda {
            clang_noinline vm->__unknown_tree_clear_J();
        });
    }
    
    // 0x4892E0
    dllexport gnu_noinline void vectorcall set_z_rotation(float value) asm_symbol_rel(0x4892E0) {
        this->data.__z_rotation = true;
        this->data.rotation.z = value;
    }
};
ValidateStructSize32(0x60C, AnmVM);

// size: 0x624
struct FastAnmVM : AnmVM {
    ZUNLinkedList<FastAnmVM> fast_node; // 0x60C
    bool alive; // 0x61C
    probably_padding_bytes(0x3); // 0x61D
    uint32_t fast_id; // 0x620
};

typedef struct AnmEntry AnmEntry;

// size: 0x10
struct AnmTexture {
    ZUNMagic magic; // 0x0 (THTX)
    uint16_t __zero; // 0x4
    uint16_t format; // 0x6
    int16_t width; // 0x8
    int16_t height; // 0xA
    uint32_t num_bytes; // 0xC
    unsigned char data[]; // 0x10
};
#pragma region // AnmTexture Validation
ValidateFieldOffset32(0x0, AnmTexture, magic);
ValidateFieldOffset32(0x4, AnmTexture, __zero);
ValidateFieldOffset32(0x6, AnmTexture, format);
ValidateFieldOffset32(0x8, AnmTexture, width);
ValidateFieldOffset32(0xA, AnmTexture, height);
ValidateFieldOffset32(0xC, AnmTexture, num_bytes);
ValidateFieldOffset32(0x10, AnmTexture, data);
ValidateStructSize32(0x10, AnmTexture);
#pragma endregion

// size: 0x18
struct AnmImage {
    LPDIRECT3DTEXTURE9 d3d_texture; // 0x0
    void* file; // 0x4
    int32_t file_size; // 0x8
    uint32_t bytes_per_pixel; // 0xC
    AnmEntry* entry; // 0x10
    union {
        uint32_t flags; // 0x14
        struct {
            uint32_t __unknown_flag_A : 1;
            uint32_t : 31;
        };
    };
    // 0x18
};
#pragma region // AnmImage Validation
ValidateFieldOffset32(0x0, AnmImage, d3d_texture);
ValidateFieldOffset32(0x4, AnmImage, file);
ValidateFieldOffset32(0x8, AnmImage, file_size);
ValidateFieldOffset32(0xC, AnmImage, bytes_per_pixel);
ValidateFieldOffset32(0x10, AnmImage, entry);
ValidateFieldOffset32(0x14, AnmImage, flags);
ValidateStructSize32(0x18, AnmImage);
#pragma endregion

// size: 0x44
struct AnmSprite {
    unknown_fields(0x1C); // 0x0
    float __float_1C; // 0x1C
    float __float_20; // 0x20
    float __uv_related_24[4]; // 0x24
    float __size_y; // 0x34
    float __size_x; // 0x38
    float __float_3C; // 0x3C
    float __float_40; // 0x40
    // 0x44
};
#pragma region // AnmSprite Validation
ValidateFieldOffset32(0x1C, AnmSprite, __float_1C);
ValidateFieldOffset32(0x20, AnmSprite, __float_20);
ValidateFieldOffset32(0x24, AnmSprite, __uv_related_24);
ValidateFieldOffset32(0x34, AnmSprite, __size_y);
ValidateFieldOffset32(0x38, AnmSprite, __size_x);
ValidateFieldOffset32(0x3C, AnmSprite, __float_3C);
ValidateFieldOffset32(0x40, AnmSprite, __float_40);
ValidateStructSize32(0x44, AnmSprite);
#pragma endregion

// size: 0x40+
struct AnmEntry {
    uint32_t version; // 0x0
    uint16_t sprite_count; // 0x4
    uint16_t script_count; // 0x6
    uint16_t __word_8; // 0x8
    uint16_t width; // 0xA
    uint16_t height; // 0xC
    uint16_t format; // 0xE
    uint32_t image_path_offset; // 0x10
    int16_t offset_x; // 0x14
    int16_t offset_y; // 0x16
    uint32_t memory_priority; // 0x18
    uint32_t texture_data_offset; // 0x1C
    bool has_data; // 0x20
    unknown_fields(0x1); // 0x21
    bool low_res_scale; // 0x22
    unknown_fields(0x1); // 0x23
    uint32_t offset_to_next; // 0x24
    padding_bytes(0x18); // 0x28
    unsigned char data[]; // 0x40
};
#pragma region // AnmEntry Validation
ValidateFieldOffset32(0x0, AnmEntry, version);
ValidateFieldOffset32(0x4, AnmEntry, sprite_count);
ValidateFieldOffset32(0x6, AnmEntry, script_count);
ValidateFieldOffset32(0x8, AnmEntry, __word_8);
ValidateFieldOffset32(0xA, AnmEntry, width);
ValidateFieldOffset32(0xC, AnmEntry, height);
ValidateFieldOffset32(0xE, AnmEntry, format);
ValidateFieldOffset32(0x10, AnmEntry, image_path_offset);
ValidateFieldOffset32(0x14, AnmEntry, offset_x);
ValidateFieldOffset32(0x16, AnmEntry, offset_y);
ValidateFieldOffset32(0x18, AnmEntry, memory_priority);
ValidateFieldOffset32(0x1C, AnmEntry, texture_data_offset);
ValidateFieldOffset32(0x20, AnmEntry, has_data);
ValidateFieldOffset32(0x22, AnmEntry, low_res_scale);
ValidateFieldOffset32(0x24, AnmEntry, offset_to_next);
ValidateFieldOffset32(0x40, AnmEntry, data);
ValidateStructSize32(0x40, AnmEntry);
#pragma endregion

inline const AnmOnFunc ANM_ON_WAIT_FUNCS[] = { NULL, NULL };
//inline const AnmOnFunc ANM_ON_TICK_FUNCS[] = { NULL, NULL };
//inline const AnmOnFunc ANM_ON_DRAW_FUNCS[] = { NULL, NULL };
//inline const AnmOnFunc ANM_ON_DESTROY_FUNCS[] = { NULL, NULL };
//inline const AnmOnFuncArg ANM_ON_INTERRUPT_FUNCS[] = { NULL, NULL };
inline const AnmOnFunc ANM_ON_COPY_A_FUNCS[] = { NULL, NULL };
inline const AnmOnFunc ANM_ON_COPY_B_FUNCS[] = { NULL, NULL };
//inline const AnmOnFuncArg ANM_ON_SPRITE_LOOKUP_FUNCS[] = { NULL, NULL };

enum AnmListEnd {
    AnmListBack,
    AnmListFront
};

// size: 0x13C
struct AnmLoaded {
    int32_t slot_index; // 0x0
    char anm_path[MAX_PATH]; // 0x4
    void* anm_file; // 0x108
    AnmVM (*__vm_array)[]; // 0x10C
    int32_t entry_count; // 0x110
    int32_t script_count; // 0x114
    int32_t sprite_count; // 0x118
    AnmSprite* sprites; // 0x11C
    AnmInstruction* (*scripts)[]; // 0x120
    AnmImage* images; // 0x124
    int32_t __load_wait; // 0x128
    unknown_fields(0x4); // 0x12C
    int32_t total_image_sizes; // 0x130
    int32_t __counter_134; // 0x134
    unknown_fields(0x4); // 0x138
    // 0x13C

    inline void zero_contents() {
        zero_this();
    }

    inline AnmLoaded() {
        this->zero_contents();
    }

    // 0x47D8F0
    dllexport gnu_noinline AnmInstruction* thiscall get_script(int32_t index) asm_symbol_rel(0x47D8F0) {
        return (*this->scripts)[index];
    }

    // 0x477B00
    dllexport gnu_noinline ZunResult thiscall set_sprite(AnmVM* vm, int32_t sprite_id) asm_symbol_rel(0x477B00) {
        if (!this->anm_file) {
            return ZUN_ERROR;
        }
        vm->data.sprite_id = sprite_id;
        AnmSprite* sprite = &this->sprites[sprite_id];
        vm->data.sprite_uv_quad[2].x = sprite->__uv_related_24[0];
        vm->data.sprite_uv_quad[0].x = sprite->__uv_related_24[0];
        vm->data.sprite_uv_quad[3].x = sprite->__uv_related_24[1];
        vm->data.sprite_uv_quad[1].x = sprite->__uv_related_24[1];
        vm->data.sprite_uv_quad[1].y = sprite->__uv_related_24[2];
        vm->data.sprite_uv_quad[0].y = sprite->__uv_related_24[2];
        vm->data.sprite_uv_quad[3].y = sprite->__uv_related_24[3];
        vm->data.sprite_uv_quad[2].y = sprite->__uv_related_24[3];
        
        float sizeX = sprite->__size_x;
        vm->data.sprite_size.x = sizeX;
        float sizeY = sprite->__size_y;
        vm->data.sprite_size.y = sizeY;

        constexpr float scale_factor = 1.0f / 256.0f;
        vm->data.__matrix_3D4.set_scaled(
            sizeX * scale_factor,
            sizeY * scale_factor
        );
        vm->data.__matrix_454.set_scaled(
            sizeX / sprite->__float_20 * sprite->__float_3C,
            sizeY / sprite->__float_1C * sprite->__float_40
        );
        vm->data.__matrix_414 = vm->data.__matrix_3D4;

        return ZUN_SUCCESS;
    }

    // Definitely exists, found at 0x40CEF0 in DDC
    inline ZunResult thiscall __set_initial_sprite(AnmVM* vm, int32_t sprite_id) {
        vm->reset();
        vm->data.slot2 = this->slot_index;
        return this->set_sprite(vm, sprite_id);
    }

    inline void __prepare_vm_data(AnmVM* vm, int32_t script_id);

    inline void __prepare_vm(AnmVM* vm, int32_t script_id);

    // 0x477D60
    dllexport void __sub_477D60(AnmVM* vm, int32_t sprite_id) asm_symbol_rel(0x477D60);

    // 0x407420
    dllexport gnu_noinline void __copy_data_to_vm(AnmVM* vm, int32_t index) asm_symbol_rel(0x407420) {
        vm->clear_controller();
        vm->controller.global_list_node.initialize_with(vm);
        vm->controller.child_list_node.initialize_with(vm);
        vm->controller.child_list_head.initialize_with(vm);
        rep_movsd(&vm->data, &(*this->__vm_array)[index].data, sizeof(AnmVM::AnmVMData) / sizeof(DWORD));
        vm->controller.__timer_1C.reset();
        vm->controller.script_time.reset();
    }

    // 0x41F920
    dllexport gnu_noinline int32_t __copy_data_to_vm_and_run(AnmVM* vm, int32_t index) asm_symbol_rel(0x41F920) {
        this->__copy_data_to_vm(vm, index);
        vm->controller.parent = NULL;
        vm->controller.__root_vm = NULL;
        return vm->run_anm();
    }

    // 0x4894E0
    dllexport gnu_noinline void thiscall __copy_data_to_vm_unknown_A(AnmVM* vm) asm_symbol_rel(0x4894E0) {
        Float3 position = vm->data.position;
        this->__copy_data_to_vm(vm, 7);
        vm->data.position = position;
        vm->controller.__timer_1C.reset();
        vm->controller.script_time.reset();
    }

    // 0x405BF0
    dllexport AnmID& thiscall instantiate_vm_to_world_list_back(AnmID& out, int32_t script_index, int32_t layer, AnmVM** raw_out) asm_symbol_rel(0x405BF0);

    // 0x409590
    dllexport AnmID& thiscall instantiate_vm_to_ui_list_front(AnmID& out, int32_t script_index, Float3* position, int = 0) asm_symbol_rel(0x409590);

    // 0x409670
    dllexport AnmID& thiscall instantiate_vm_to_ui_list_back(AnmID& out, int32_t script_index, Float3* position, int = 0) asm_symbol_rel(0x409670);

    // 0x413180
    dllexport AnmID& thiscall instantiate_vm_to_world_list_back(AnmID& out, int32_t script_index, Float3* position, float z_rotation, int32_t layer, AnmVM** raw_out) asm_symbol_rel(0x413180);

    // 0x416A10
    dllexport AnmID& thiscall instantiate_vm_to_ui_list_back(AnmID& out, int32_t script_index, int = 0) asm_symbol_rel(0x416A10);

    // 0x43A030
    dllexport AnmID& thiscall instantiate_vm_to_world_list_front(AnmID& out, int32_t script_index, int32_t layer, int = 0) asm_symbol_rel(0x43A030);

    // 0x43A110
    dllexport AnmID& thiscall instantiate_vm_to_world_list_front(AnmID& out, int32_t script_index, Float3* position, float z_rotation, int = -1, int = 0) asm_symbol_rel(0x43A110);

    inline AnmID& thiscall instantiate_vm_to_world_list_back(AnmID& out, int32_t script_index, Float3* position);
    inline uint32_t thiscall instantiate_vm_to_world_list_back(int32_t script_index, Float3* position);

    // 0x488770
    dllexport AnmID& thiscall instantiate_vm(AnmID& out, int32_t script_index, Float3* position, float z_rotation, int32_t layer, AnmVMCreationFlags flags, AnmVM** raw_out) asm_symbol_rel(0x488770);

    // 0x4888F0
    dllexport AnmID& thiscall instantiate_child_vm(AnmID& out, int32_t script_index, AnmVM* parent, AnmVMCreationFlags flags) asm_symbol_rel(0x4888F0);

    // 0x488A40
    dllexport AnmID& thiscall instantiate_orphan_vm_to_world_list_back(AnmID& out, int32_t script_index, AnmVM* parent, int = 0) asm_symbol_rel(0x488A40);

    // 0x4865B0
    dllexport gnu_noinline ZunResult thiscall preload(const char* filename) asm_symbol_rel(0x4865B0) {
        char path[MAX_PATH + 1];
        sprintf(path, "%s", filename);
        void* anm_file = read_file_to_buffer(path, NULL, false);
        if (!anm_file) {
            return ZUN_ERROR;
        }
        this->anm_file = anm_file;
        byteloop_strcpy(this->anm_path, filename);
        AnmEntry* current_entry = (AnmEntry*)anm_file;
        int32_t entry_count = 1;
        int32_t total_script_count = current_entry->script_count;
        int32_t total_sprite_count = current_entry->sprite_count;
        while (uint32_t offset_to_next = current_entry->offset_to_next) {
            current_entry = based_pointer(current_entry, offset_to_next);
            ++entry_count;
            total_script_count += current_entry->script_count;
            total_sprite_count += current_entry->sprite_count;
        }
        this->entry_count = entry_count;

        size_t image_array_size = sizeof(AnmImage) * entry_count;
        AnmImage* images = (AnmImage*)malloc(image_array_size);
        this->images = images;
        memset(images, 0, image_array_size);

        this->sprites = (AnmSprite*)malloc(sizeof(AnmSprite[total_sprite_count]));
        this->scripts = (AnmInstruction*(*)[])malloc(sizeof(AnmInstruction*[total_script_count]));
        this->script_count = total_script_count;
        this->sprite_count = total_sprite_count;

        current_entry = (AnmEntry*)anm_file;
        
        for (int32_t entry_index = 0;;) {
            if (expect(!current_entry, false)) {
                LOG_BUFFER.write_error(JpEnStr("", "Can't load animation. data is lost or corrupted\r\n"));
                break;
            }
            if (expect(current_entry->version != 8, false)) {
                LOG_BUFFER.write_error(JpEnStr("", "different version of animation\r\n"));
                break;
            }
            if (!current_entry->has_data) {
                const char* image_filename = based_pointer<const char>(current_entry, current_entry->image_path_offset);
                if (image_filename[0] != '@') {
                    char image_path[MAX_PATH];
                    sprintf(image_path, "%s", image_filename);
                    int32_t image_file_size;
                    void* image_file = read_file_to_buffer(image_path, &image_file_size, true);
                    if (expect(!image_file, false)) {
                        LOG_BUFFER.write_error(JpEnStr("", "Unable to load texture %s. data is lost or corrupted\r\n"), image_filename);
                        break;
                    }
                    this->images[entry_index].file_size = image_file_size;
                    this->images[entry_index].file = image_file;
                }
            }
            ++entry_index;
            size_t offset_to_next = current_entry->offset_to_next;
            if (expect(!offset_to_next, false)) {
                size_t vm_array_size = sizeof(AnmVM) * total_script_count;
                auto vm_array = (AnmVM(*)[])malloc(vm_array_size);
                this->__vm_array = vm_array;
                memset(vm_array, 0, vm_array_size);
                break;
            }
            current_entry = based_pointer(current_entry, offset_to_next);
        }
        return ZUN_SUCCESS;
    }
};

// size: 0x14
// D3DFVF_XYZRHW | D3DFVF_DIFFUSE (0x44)
struct PrimitiveVertex {
    Float4 position; // 0x0
    D3DCOLOR diffuse; // 0x10
    // 0x14

    static constexpr DWORD FVF_TYPE = D3DFVF_XYZRHW | D3DFVF_DIFFUSE;
};
// size: 0x14
// D3DFVF_XYZ | D3DFVF_TEX1 (0x102)
struct UnknownVertexA {
    Float3 position; // 0x0
    Float2 texture_uv; // 0xC
    // 0x14

    static constexpr DWORD FVF_TYPE = D3DFVF_XYZ | D3DFVF_TEX1;
};
// size: 0x18
// D3DFVF_XYZRHW | D3DFVF_TEX1 (0x104)
struct SpriteVertexB {
    Float4 position; // 0x0
    Float2 texture_uv; // 0x10
    // 0x18

    static constexpr DWORD FVF_TYPE = D3DFVF_XYZRHW | D3DFVF_TEX1;
};
// size: 0x18
// D3DFVF_XYZ | D3DFVF_DIFFUSE | D3DFVF_TEX1 (0x142)
struct SpriteVertexC {
    Float3 position; // 0x0
    D3DCOLOR diffuse; // 0xC
    Float2 texture_uv; // 0x10
    // 0x18

    static constexpr DWORD FVF_TYPE = D3DFVF_XYZ | D3DFVF_DIFFUSE | D3DFVF_TEX1;
};
// size: 0x1C
// D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1 (0x144)
struct SpriteVertex {
    Float4 position; // 0x0
    D3DCOLOR diffuse; // 0x10
    Float2 texture_uv; // 0x14
    // 0x1C

    static constexpr DWORD FVF_TYPE = D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1;
};
// size: 0x10
// D3DFVF_XYZ | D3DFVF_DIFFUSE (0x42)
struct UnknownVertexB {
    Float3 position; // 0x0
    D3DCOLOR diffuse; // 0xC
    // 0x10

    static constexpr DWORD FVF_TYPE = D3DFVF_XYZ | D3DFVF_DIFFUSE;
};

extern "C" {
    // 0x51F65C
    extern AnmManager* ANM_MANAGER_PTR asm("_ANM_MANAGER_PTR");
    // 0x5704C0
    extern SpriteVertexB SPRITE_VERTEX_BUFFER_B[4] asm("_SPRITE_VERTEX_BUFFER_B");
    // 0x570520
    extern SpriteVertex SPRITE_VERTEX_BUFFER_A[4] asm("_SPRITE_VERTEX_BUFFER_A");
    // 0x570590
    extern SpriteVertexC SPRITE_VERTEX_BUFFER_C[4] asm("_SPRITE_VERTEX_BUFFER_C");
}

enum AnmFileIndex {
    TEXT_ANM_INDEX = 0,
    SIG_ANM_INDEX = 1,
    ASCII_ANM_INDEX = 2,
    STAGE_ANM_INDEX_A = 3,
    STAGE_ANM_INDEX_B = 4,
    FRONT_ANM_INDEX = 5,
    STAGE_LOGO_ANM_INDEX = 6,
    BULLET_ANM_INDEX = 7,
    EFFECT_ANM_INDEX = 8,
    PLAYER_ANM_INDEX = 9,

    TITLE_ANM_INDEX = 16,
    TITLEV_ANM_INDEX = 17,

    HELP_ANM_INDEX = 19,

    TROPHY_ANM_INDEX = 27,

    ABILITY_ANM_INDEX = 30,
    ABCARD_ANM_INDEX = 31,
    ABMENU_ANM_INDEX = 32,


    ENUM_MAX_VALUE_DECLARE(CmdType)
};

// 0x4B4920
static inline constexpr int D3DFORMAT_SIZES_TABLE[] = {
    4,
    sizeof(PixelA8R8G8B8), // 4
    sizeof(PixelA1R5G5B5), // 2
    sizeof(PixelR5G6B5), // 2
    sizeof(PixelR8G8B8), // 3
    sizeof(PixelA4R4G4B4), // 2
    sizeof(PixelA8R3G3B2), // 2
    sizeof(PixelA8), // 1
    sizeof(PixelR3G3B2) // 1
};

// 0x4B4944
static inline constexpr D3DFORMAT D3DFORMAT_TABLE[] = {
    D3DFMT_UNKNOWN,
    D3DFMT_A8R8G8B8,
    D3DFMT_A1R5G5B5,
    D3DFMT_R5G6B5,
    D3DFMT_R8G8B8,
    D3DFMT_A4R4G4B4,
    D3DFMT_A8R3G3B2,
    D3DFMT_A8,
    D3DFMT_R3G3B2
};

// size: 0x39724B8
struct AnmManager {

#define WORLD_LAYER_A_COUNT 24
#define WORLD_LAYER_B_COUNT 13
#define WORLD_LAYER_COUNT (WORLD_LAYER_A_COUNT + WORLD_LAYER_B_COUNT)
#define UI_LAYER_COUNT 9

    ZUNThreadB __thread_0; // 0x0
    unknown_fields(0x4); // 0x1C
    int __dword_20; // 0x20
    unknown_fields(0x24); // 0x24
    int __dword_48; // 0x48
    unknown_fields(0x24); // 0x4C
    int __dword_70; // 0x70
    unknown_fields(0x24); // 0x74
    int __dword_98; // 0x98
    unknown_fields(0x24); // 0x9C
    int __dword_C0; // 0xC0
    unknown_fields(0x8); // 0xC4
    int __dword_CC; // 0xCC
    Int2 __int2_D0; // 0xD0
    Float2 __float2_D8; // 0xD8
    unknown_fields(0x4); // 0xE0
    AnmVM __vm_E4; // 0xE4
    ZUNLinkedList<AnmVM>* world_list_head; // 0x6F0
    ZUNLinkedList<AnmVM>* world_list_tail; // 0x6F4
    ZUNLinkedList<AnmVM>* ui_list_head; // 0x6F8
    ZUNLinkedList<AnmVM>* ui_list_tail; // 0x6FC
    FastAnmVM fast_array[uint_width_max(ANM_FAST_ID_BITS)]; // 0x700
    FastAnmVM fast_array_end; // 0x31200DC
    int32_t next_snapshot_fast_id; // 0x3120700
    int32_t next_snapshot_discriminator; // 0x3120704
    ZUNLinkedListHead<AnmVM> snapshot_list_head; // 0x3120708
    //ZUNLinkedList<AnmVM> snapshot_list_head; // 0x3120708
    ZUNLinkedListHead<FastAnmVM> free_list_head; // 0x3120718
    //ZUNLinkedList<FastAnmVM> free_list_head; // 0x3120718
    unknown_fields(0x4); // 0x3120728
    AnmLoaded* loaded_anm_files[33]; // 0x312072C
    D3DMATRIXZ __matrix_31207B0; // 0x31207B0
    AnmVM __vm_31207F0; // 0x31207F0
    unknown_fields(0x4); // 0x3120DFC
    D3DCOLOR current_texture_blend_color; // 0x3120E00
    int32_t __index_3120E04; // 0x3120E04
    AnmBlendMode current_blend_mode; // 0x3120E08
    char __byte_3120E09; // 0x3120E09
    int8_t __sbyte_3120E0A; // 0x3120E0A
    char __byte_3120E0B; // 0x3120E0B
    char __byte_3120E0C; // 0x3120E0C
    unknown_fields(0x1); // 0x3120E0D
    bool currently_using_point_filtering; // 0x3120E0E
    bool currently_using_modulate_op; // 0x3120E0F
    AnmUVMode current_u_sample_mode; // 0x3120E10
    AnmUVMode current_v_sample_mode; // 0x3120E11
    probably_padding_bytes(0x2); // 0x3120E12
    int __current_dword_3120E14; // 0x3120E14
    LPDIRECT3DVERTEXBUFFER9 __d3d_vertex_buffer_3120E18; // 0x3120E18
    UnknownVertexA __vertex_array_3120E1C[4]; // 0x3120E1C
    int32_t unrendered_sprite_count; // 0x3120E6C
    SpriteVertex sprite_vertex_data[0x40000]; // 0x3120E70
    SpriteVertex* sprite_write_cursor; // 0x3820E70
    SpriteVertex* sprite_render_cursor; // 0x3820E74
    int32_t unrendered_primitive_count; // 0x3820E78
    PrimitiveVertex primitive_vertex_data[0x10000]; // 0x3820E7C
    PrimitiveVertex* primitive_write_cursor; // 0x3960E7C
    PrimitiveVertex* primitive_render_cursor; // 0x3960E80
    AnmVM layer_heads[WORLD_LAYER_COUNT + UI_LAYER_COUNT]; // 0x3960E84
    uint32_t prev_slow_id; // 0x39724AC
    D3DCOLOR __color_39724B0; // 0x39724B0
    unknown_fields(0x4); // 0x39724B4
    // 0x39724B8

    inline void zero_contents() {
        zero_this();
    }

    inline static void set_modulate_op();

    // 0x47E730
    dllexport gnu_noinline void thiscall flush_sprites() asm_symbol_rel(0x47E730) {
        if (this->unrendered_sprite_count) {
            this->set_modulate_op();
            SUPERVISOR.d3d_device->SetTextureStageState(0, D3DTSS_ALPHAARG2, D3DTA_DIFFUSE);
            SUPERVISOR.d3d_device->SetTextureStageState(0, D3DTSS_COLORARG2, D3DTA_DIFFUSE);
            SUPERVISOR.d3d_device->SetFVF(SpriteVertex::FVF_TYPE);
            SUPERVISOR.d3d_device->DrawPrimitiveUP(D3DPT_TRIANGLELIST, this->unrendered_sprite_count * 2, this->sprite_render_cursor, sizeof(SpriteVertex));
            this->sprite_render_cursor = this->sprite_write_cursor;
            ++this->__dword_CC;
            this->unrendered_sprite_count = 0;
        }
    }

    // 0x481210
