#pragma clang diagnostic ignored "-Wc++20-extensions"
#pragma clang diagnostic ignored "-Wdeprecated-volatile"
#pragma clang diagnostic ignored "-Winvalid-source-encoding"

#if !CLANG_CL && __INTELLISENSE__
#define _HAS_CXX17 1
#define _HAS_CXX20 0
#endif

#include <stdlib.h>
#include <stdint.h>
#include <limits.h>
#include <stdint.h>
#include <direct.h>
#include <time.h>

#include <string.h>

#define _USE_MATH_DEFINES 1
#include <math.h>

#include <bit>

#include "../zero/FloatConstants.h"

#include "../zero/util.h"
//#include "../zero/custom_intrin.h"
#include "../zero/func_traits_basic.h"

//#define USE_FAST_REDUCE_ANGLE
#include "../reduce_angle_fast.h"

template <typename T>
using ZUNList = ZUNListBase<T, true>;
template <typename T>
using ZUNListHead = ZUNListHeadBase<T, true>;
template <typename T>
using ZUNListIter = ZUNListIterBase<T, true>;
template <typename T>
using ZUNListEnds = ZUNListEndsBase<T, true>;

#define GAME_VERSION UM_VER

#define ENGLISH_STRINGS

#ifndef ENGLISH_STRINGS
#define JpEnStr(jstring, estring) jstring
#else
#define JpEnStr(jstring, estring) estring
#endif

#define INCLUDE_PATCH_CODE 0

//#define USE_VOLATILES_AND_BARRIERS_FOR_ORIGINAL_CODEGEN 1

#if USE_VOLATILES_AND_BARRIERS_FOR_ORIGINAL_CODEGEN
#define codegen_volatile volatile
#define codegen_barrier() _ReadWriteBarrier()
#else
#define codegen_volatile
#define codegen_barrier() do {} while(false)
#endif

#define CHEAT_THE_LOADER

#undef WIN32_LEAN_AND_MEAN
#include <Windows.h>
#include <process.h>
#include <WinUser.h>
#include <wbemidl.h>
#include <winnls32.h>
#include <d3d9.h>
#include <dinput.h>
#include <dsound.h>
#define UNICODE
#include <Core/DXUT.h>
#include <Optional/SDKsound.h>
#undef UNICODE

#include "../zero/zun.h"

#pragma comment (lib, "wbemuuid.lib")
#pragma comment (lib, "Xinput9_1_0.lib")


#ifndef SAFE_FREE
#define SAFE_FREE(p)       { if (p) { free ((void*)p);     (p)=NULL; } }
#endif

#ifndef SAFE_FREE_FAST
#define SAFE_FREE_FAST(p)       { if (auto ptr = (p)) { free ((void*)ptr);     (p)=NULL; } }
#endif

/*
#ifdef cdecl
#undef cdecl
#endif
#define cdecl __cdecl
*/


dllexport gnu_noinline void* cdecl memset_force(void* dst, int val, size_t size) {
    gnu_attr(musttail) return memset(dst, val, size);
}

#define zero_this() memset_force(this, 0, sizeof(*this));

#define zero_this_inline() __builtin_memset(this, 0, sizeof(*this));

struct D3DMATRIXZ : D3DMATRIX {
    // D3DXMatrixIdentity
    inline void set_identity() {
        this->m[0][0] = 1.0f;
        this->m[0][1] = 0.0f;
        this->m[0][2] = 0.0f;
        this->m[0][3] = 0.0f;
        this->m[1][0] = 0.0f;
        this->m[1][1] = 1.0f;
        this->m[1][2] = 0.0f;
        this->m[1][3] = 0.0f;
        this->m[2][0] = 0.0f;
        this->m[2][1] = 0.0f;
        this->m[2][2] = 1.0f;
        this->m[2][3] = 0.0f;
        this->m[3][0] = 0.0f;
        this->m[3][1] = 0.0f;
        this->m[3][2] = 0.0f;
        this->m[3][3] = 1.0f;
    }

    // D3DXMatrixScaling
    inline void set_scaled(float X, float Y, float Z = 1.0f) {
        this->m[0][0] = X;
        this->m[0][1] = 0.0f;
        this->m[0][2] = 0.0f;
        this->m[0][3] = 0.0f;
        this->m[1][0] = 0.0f;
        this->m[1][1] = Y;
        this->m[1][2] = 0.0f;
        this->m[1][3] = 0.0f;
        this->m[2][0] = 0.0f;
        this->m[2][1] = 0.0f;
        this->m[2][2] = Z;
        this->m[2][3] = 0.0f;
        this->m[3][0] = 0.0f;
        this->m[3][1] = 0.0f;
        this->m[3][2] = 0.0f;
        this->m[3][3] = 1.0f;
    }
};
#pragma region // D3DMATRIXZ Validation
ValidateStructSize32(0x40, D3DMATRIXZ);
#pragma endregion

/*
// 0x4028F0
dllexport float vectorcall reduce_angle(float angle) asm_symbol_rel(0x4028F0);
dllexport float vectorcall reduce_angle(float angle) {
    int32_t counter = 0;
    while (angle > PI_f) {
        angle -= TWO_PI_f;
        if (counter++ > 32) break;
    }
    while (-PI_f > angle) {
        angle += TWO_PI_f;
        if (counter++ > 32) break;
    }
    return angle;
}

template <InlineState inline_state = DefaultInline>
static auto reduce_angle(float angle) {
    if constexpr (inline_state == ForceInline) {
        clang_forceinline return reduce_angle(angle);
    } else if constexpr (inline_state == NoInline) {
        clang_noinline return reduce_angle(angle);
    } else {
        return reduce_angle(angle);
    }
}

// 0x402890
// ZUN has always had this function... IDK why
dllexport float vectorcall reduce_angle_add(float angle, float value) asm_symbol_rel(0x402890);
dllexport float vectorcall reduce_angle_add(float angle, float value) {
    return reduce_angle(angle + value);
}
*/

/*
// 0x404BC0
dllexport float& vectorcall reduce_angle_add_write(float& angle_ref, float& out, float value) asm_symbol_rel(0x404BC0);
dllexport float& vectorcall reduce_angle_add_write(float& angle_ref, float& out, float value) {
    return out = reduce_angle_add(angle_ref, value);
}
*/
/*
// 0x404D10
dllexport float& vectorcall reduce_angle_add_assign_write(float& angle_ref, float value) asm_symbol_rel(0x404D10) {
    return angle_ref = reduce_angle_add_ref(angle_ref, value);
}
*/

inline float vectorcall __angle_diffB(float angle, float value, float temp) {
    if (temp > PI_f) {
        return angle - (value + TWO_PI_f);
    } else if (value - angle > PI_f) {
        return angle - (value - TWO_PI_f);
    } else {
        return temp;
    }
}

// 0x439FE0
dllexport float vectorcall reduced_angle_diff(float angle, float value) asm_symbol_rel(0x439FE0);
dllexport float vectorcall reduced_angle_diff(float angle, float value) {
    float temp = angle - value;
    if (temp > PI_f) {
        return angle - (value + TWO_PI_f);
    }
    else if (value - angle > PI_f) {
        return angle - (value - TWO_PI_f);
    }
    else {
        return temp;
    }
}


// 0x46F150
dllexport char* stdcall pbg_strdup(const char* str) asm_symbol_rel(0x46F150);
dllexport char* stdcall pbg_strdup(const char* str) {
    char* ret = (char*)malloc(byteloop_strlen(str));
    if (ret) {
        byteloop_strcpy(ret, str);
    }
    return ret;
}

/*
// 0x404C70
dllexport float& vectorcall reduce_angle_diff_write(float& angle_ref, float& out, float& value_ref) asm_symbol_rel(0x404C70) {
    return reduce_angle_write(out, reduced_angle_diff(angle_ref, value_ref));
}
*/

// size: 0x4
// Of course this exists...
struct ZUNAngle {
    float value; // 0x0

    inline constexpr ZUNAngle() {}

private:
    // 0x404C20
    dllexport gnu_noinline void vectorcall constructor(float, const float value) asm_symbol_rel(0x404C20) {
        this->value = reduce_angle(value);
    }
public:
    inline ZUNAngle(const float value) {
        this->constructor(UNUSED_FLOAT, value);
    }

private:
    // 0x404D70
    dllexport ZUNAngle& vectorcall set(float, const float value) asm_symbol_rel(0x404D70) {
        this->value = reduce_angle(value);
        return *this;
    }
public:
    // 0x404D70
    inline ZUNAngle& vectorcall operator=(const float value) asm_symbol_rel(0x404D70) {
        return this->set(UNUSED_FLOAT, value);
    }

    /*
    inline ZUNAngle& operator=(const ZUNAngle& value) {
        this->value = value.value;
        return *this;
    }
    */

    // 0x404DC0
    dllexport vectorcall operator float() const asm_symbol_rel(0x404DC0) {
        return this->value;
    }

private:
    // 0x404BC0
    dllexport ZUNAngle& vectorcall add(int, float, float, ZUNAngle& out, const float value) asm_symbol_rel(0x404BC0) {
        return out = this->value + value;
    }
public:
    inline ZUNAngle operator+(const float value) {
        ZUNAngle dummy;
        return this->add(UNUSED_DWORD, UNUSED_FLOAT, UNUSED_FLOAT, dummy, value);
    }

private:
    // 0x45E2A0
    dllexport ZUNAngle& thiscall add(ZUNAngle& out, const ZUNAngle& angle) asm_symbol_rel(0x45E2A0) {
        return out = this->value + angle.value;
    }
public:
    inline ZUNAngle operator+(const ZUNAngle& angle) {
        ZUNAngle dummy;
        return this->add(dummy, angle);
    }

private:
    // 0x404D10
    dllexport gnu_noinline ZUNAngle& vectorcall add_assign(float, const float value) asm_symbol_rel(0x404D10) {
        return *this = this->value + value;
    }
public:
    // 0x404D10
    inline ZUNAngle& vectorcall operator+=(const float value) {
        return this->add_assign(UNUSED_FLOAT, value);
    }

    // th14: 0x443D60
    inline ZUNAngle& thiscall operator+=(const ZUNAngle& angle) {
        return *this = this->value + angle.value;
    }

    /*
    inline ZUNAngle operator-(const float value) const {
        return this->value - value;
    }
    */

private:
    // 0x404C70
    dllexport ZUNAngle& thiscall sub(ZUNAngle& out, const ZUNAngle& angle) asm_symbol_rel(0x404C70) {
        return out = reduced_angle_diff(this->value, angle.value);
    }
public:
    inline ZUNAngle thiscall operator-(const ZUNAngle& angle) {
        ZUNAngle dummy;
        return this->sub(dummy, angle);
    }
    
    /*
    inline ZUNAngle& diff(float value) const {
        ZUNAngle temp;
        temp.value = value;
        return *this - temp;
    }
    */
    /*
    inline ZUNAngle& operator-=(const float value) {
        return *this = *this - value;
    }
    */

private:
    // 0x461540
    dllexport ZUNAngle& vectorcall mul(int, float, float, ZUNAngle& out, const float value) asm_symbol_rel(0x404BC0) {
        return out = this->value * value;
    }
public:
    inline ZUNAngle operator*(const float value) {
        ZUNAngle dummy;
        return this->mul(UNUSED_DWORD, UNUSED_FLOAT, UNUSED_FLOAT, dummy, value);
    }

private:
    // th14: 0x443D00
    inline ZUNAngle& vectorcall div(ZUNAngle& out, const float value) {
        return out = this->value / value;
    }
public:
    inline ZUNAngle vectorcall operator/(const float value) {
        ZUNAngle dummy;
        return this->div(dummy, value);
    }
};

struct DUMB_FUNCTIONS {
private:
    // 0x403BC0
    dllexport static gnu_noinline int32_t vectorcall __sub_403BC0(float* arg1, float* arg2, float, float, float arg3, float arg4, float, float, float arg5, float arg6, float arg7, float arg8) {
        float A = reduce_angle(arg5);
        float B = reduce_angle(arg8);
        float C = reduced_angle_diff(A, B);
        float D = reduce_angle(C);
        if (!(fabsf(D) < 0.001f)) {
            float E = reduce_angle(__angle_diffB(A, B, C));
            float F = reduce_angle(reduced_angle_diff(E, PI_f));
            if (!(fabsf(F) < 0.001f)) {
                Float2 G;
                G.make_from_vector(arg5, 10.0f);
                float H = G.x;
                float I;
                float J;
                float K = 0.0f;
                BOOL L;
                if (fabsf(H) < 0.01f) {
                    I = arg3;
                    J = 0.0f;
                    L = true;
                } else {
                    L = false;
                    J = G.y / H;
                    I = arg4 - J * arg3;
                }
                G.make_from_vector(arg8, 10.0f);
                H = G.x;
                float M;
                BOOL N;
                if (fabsf(H) < 0.01f) {
                    M = arg6;
                    N = true;
                } else {
                    N = false;
                    K = G.y / H;
                    M = arg7 - K * arg6;
                }
                float O;
                float P;
                if (!L) {
                    if (!N) {
                        O = M - I;
                        float Q = J - K;
                        P = O * J / Q + I;
                        O /= Q;
                    } else {
                        O = arg6;
                        P = J * arg6 + I;
                    }
                } else {
                    if (!N) {
                        P = K * arg3 + M;
                        O = arg3;
                    } else {
                        P = arg3;
                        if (fabsf(P - arg6) < 0.001f) {
                            return 0;
                        }
                        *arg2 = arg4;
                        *arg1 = P;
                        return 1;
                    }
                }
                *arg1 = O;
                *arg2 = P;
                return 1;
            }
        }
        *arg2 = arg4;
        *arg1 = arg3;
        return 0;
    }
public:
    forceinline static int32_t __sub_403BC0(float* arg1, float* arg2, float arg3, float arg4, float arg5, float arg6, float arg7, float arg8) {
        return __sub_403BC0(arg1, arg2, UNUSED_FLOAT, UNUSED_FLOAT, arg3, arg4, UNUSED_FLOAT, UNUSED_FLOAT, arg5, arg6, arg7, arg8);
    }
};

forceinline int32_t __sub_403BC0(float* arg1, float* arg2, float arg3, float arg4, float arg5, float arg6, float arg7, float arg8) {
    return DUMB_FUNCTIONS::__sub_403BC0(arg1, arg2, arg3, arg4, arg5, arg6, arg7, arg8);
}

enum CriticalSectionIndex {
    UpdateFuncRegistry_CS = 0,
    __unused_cs_1 = 1,
    FileIO_CS = 2,
    Logging_CS = 3,
    __unused_cs_2 = 4,
    Menu_CS = 5,
    __supervisor_thread_cs_1 = 6,
    __unused_cs_3 = 7,
    __unused_cs_4 = 8,
    AnmList_CS = 9,
    RNG_CS = 10,
    __unknown_cs_2 = 11,
    __unknown_cs_3 = 12,
    __unused_cs_5 = 13,
};

// size: 0x1D0
struct CriticalSectionManager {
    CRITICAL_SECTION sections[14]; // 0x0
    uint8_t section_depths[14]; // 0x1C0
    bool enable_sections; // 0x1CE

    // Pretty sure these aren't actually class methods, but whatever. Not the point.
    inline void initialize() {
        nounroll for (size_t i = 0; i < countof(this->sections); ++i) {
            InitializeCriticalSection(&this->sections[i]);
        }
        this->enable_sections = true;
    }

    // 0x404F60
    dllexport static inline void stdcall leave_section(CriticalSectionIndex index) asm_symbol_rel(0x404F60);
    
    // 0x404F90
    dllexport static inline void stdcall enter_section(CriticalSectionIndex index) asm_symbol_rel(0x404F90);

    static inline void leave_section_volatile(CriticalSectionIndex index);
    static inline void enter_section_volatile(CriticalSectionIndex index);
};
/*
#pragma region // CriticalSectionManager Validation
ValidateFieldOffset32(0x0, CriticalSectionManager, sections);
ValidateFieldOffset32(0x1C0, CriticalSectionManager, section_depths);
ValidateFieldOffset32(0x1CE, CriticalSectionManager, enable_sections);
ValidateStructSize32(0x1D0, CriticalSectionManager);
#pragma endregion
*/

extern "C" {
    // 0x521660
    extern CriticalSectionManager CRITICAL_SECTION_MANAGER asm("_CRITICAL_SECTION_MANAGER");
}

// 0x404F60
dllexport inline void stdcall CriticalSectionManager::leave_section(CriticalSectionIndex index) {
    if (CRITICAL_SECTION_MANAGER.enable_sections) {
        LeaveCriticalSection(&CRITICAL_SECTION_MANAGER.sections[index]);
        --CRITICAL_SECTION_MANAGER.section_depths[index];
    }
}
// 0x404F90
dllexport inline void stdcall CriticalSectionManager::enter_section(CriticalSectionIndex index) {
    if (CRITICAL_SECTION_MANAGER.enable_sections) {
        EnterCriticalSection(&CRITICAL_SECTION_MANAGER.sections[index]);
        ++CRITICAL_SECTION_MANAGER.section_depths[index];
    }
}
inline void CriticalSectionManager::leave_section_volatile(CriticalSectionIndex index) {
    if (*(volatile uint8_t*)&CRITICAL_SECTION_MANAGER.enable_sections) {
        LeaveCriticalSection(&CRITICAL_SECTION_MANAGER.sections[index]);
        --*(volatile uint8_t*)&CRITICAL_SECTION_MANAGER.section_depths[index];
    }
}
inline void CriticalSectionManager::enter_section_volatile(CriticalSectionIndex index) {
    if (*(volatile uint8_t*)&CRITICAL_SECTION_MANAGER.enable_sections) {
        EnterCriticalSection(&CRITICAL_SECTION_MANAGER.sections[index]);
        ++*(volatile uint8_t*)&CRITICAL_SECTION_MANAGER.section_depths[index];
    }
}

template<CriticalSectionIndex index>
struct ScopedCriticalSection {
    inline ScopedCriticalSection() {
        CRITICAL_SECTION_MANAGER.enter_section(index);
    }
    inline ~ScopedCriticalSection() {
        CRITICAL_SECTION_MANAGER.leave_section(index);
    }
};

static constexpr auto wkrwjher = sizeof(ScopedCriticalSection<UpdateFuncRegistry_CS>);

#define UniqueCriticalSectionLock(index) auto unique_name(critical_section_scope_guard_) = ScopedCriticalSection<index>()
#define CriticalSectionBlock(index) switch (UniqueCriticalSectionLock(index); 0) default:

// size: 0x4
struct DebugLogger {
    int __dword_0; // 0x0

    // 0x404E80
    dllexport static gnu_noinline void cdecl __debug_log_stub_4(const char* format, ...) asm_symbol_rel(0x404E80) {}

    // 0x404F50
    dllexport gnu_noinline int32_t thiscall __debug_log_stub_12(int32_t value, int, const char*) asm_symbol_rel(0x404F50) {
        return value;
    }

    // 0x43A280
    dllexport static gnu_noinline void cdecl __debug_log_stub_3(const char* format, ...) asm_symbol_rel(0x43A280) {}

    // 0x442440
    dllexport static gnu_noinline void cdecl __debug_log_stub_8(const char* format, ...) asm_symbol_rel(0x442440) {}

    // 0x4562A0
    dllexport static gnu_noinline void cdecl __debug_log_stub_7(const char* format, ...) asm_symbol_rel(0x4562A0) {}

    // 0x46F1D0
    dllexport static gnu_noinline void cdecl __debug_log_stub_2(const char* format, ...) asm_symbol_rel(0x46F1D0) {}

    // 0x471110
    dllexport static gnu_noinline void cdecl __debug_log_stub_11(const char* format, ...) asm_symbol_rel(0x471110) {}

    // 0x476310
    dllexport static gnu_noinline void cdecl __debug_log_stub_1(const char* format, ...) asm_symbol_rel(0x476310) {}

    // 0x477AF0
    dllexport static gnu_noinline void cdecl __debug_log_stub_10(const char* format, ...) asm_symbol_rel(0x477AF0) {}

    // 0x489590
    [[gnu::no_caller_saved_registers]] dllexport static gnu_noinline void cdecl __debug_log_stub_6(const char* format, ...) asm_symbol_rel(0x489590) {}

    // 0x48B010
    dllexport static gnu_noinline void cdecl __debug_log_stub_9(const char* format, ...) asm_symbol_rel(0x48B010) {}

    // 0x48B020
    dllexport static gnu_noinline void cdecl __debug_log_stub_5(const char* format, ...) asm_symbol_rel(0x48B020) {}
};

extern "C" {
    // 0x4CF290
    extern DebugLogger* DEBUG_LOG_PTR asm("_DEBUG_LOG_PTR");

    // 0x4CF2F0
    extern char UNKNOWN_TEXT_BUFFER_A[MAX_PATH] asm("_UNKNOWN_TEXT_BUFFER_A");
}

namespace Pbg {

    // size: 0x4
    struct IFile {
        // Method 0
        virtual gnu_noinline bool thiscall open_file(LPCSTR path, const char* mode) = 0;
        // Method 4
        virtual gnu_noinline void thiscall close_file() = 0;
        // Method 8
        virtual gnu_noinline DWORD thiscall read_file_to_buffer(LPVOID buffer, DWORD size) = 0;
        // Method C
        virtual gnu_noinline bool thiscall write_buffer_to_file(LPVOID buffer, DWORD size) = 0;
        // Method 10
        virtual gnu_noinline DWORD thiscall get_file_pointer() = 0;
        // Method 14
        virtual gnu_noinline DWORD thiscall get_file_size() = 0;
        // Method 18
        virtual gnu_noinline bool thiscall set_file_pointer(LONG offset, DWORD origin) = 0;
        
        // 0x46F580
        virtual ~IFile() {}
    };

    // size: 0xC
    struct File : IFile {

        HANDLE handle; // 0x4
        ACCESS_MASK access_mask; // 0x8
        // 0xC

        inline File() : handle(INVALID_HANDLE_VALUE), access_mask(0) {}

        // 0x46F230
        // Method 0
        virtual gnu_noinline bool thiscall open_file(LPCSTR path_in, const char* mode_str) asm_symbol_rel(0x46F230) {
            BOOL is_append = false;
            DWORD create_type = 0;
            this->close_file();
            const char* read_mode = mode_str;
            for (
                char c;
                (c = *read_mode);
                ++read_mode
            ) {
                switch (c) {
                    case 'r':
                        this->access_mask = GENERIC_READ;
                        create_type = OPEN_EXISTING;
                        goto valid_mode;
                    case 'w':
                        this->access_mask = GENERIC_WRITE;
                        create_type = CREATE_ALWAYS;
                        goto valid_mode;
                    case 'a':
                        is_append = true;
                        this->access_mask = GENERIC_WRITE;
                        create_type = OPEN_ALWAYS;
                        goto valid_mode;
                }
            }
            return false;
        valid_mode:
            if (!*read_mode) {
                return false;
            }
            const char* path_no_drive = strchr(path_in, ':');
            char path_buffer[MAX_PATH];
            if (path_no_drive) {
                byteloop_strcpy(path_buffer, path_in);
            }
            else {
                GetModuleFileNameA(NULL, path_buffer, MAX_PATH);
                char* filename = strrchr(path_buffer, '\\');
                path_buffer[0] = filename ? '\0' : path_buffer[0];
                filename[1] = '\0';
                byteloop_strcat(path_buffer, path_in);
            }
            HANDLE file_handle = CreateFileA(
                path_buffer,
                this->access_mask,
                FILE_SHARE_READ,
                NULL,
                create_type,
                FILE_ATTRIBUTE_NORMAL | FILE_FLAG_SEQUENTIAL_SCAN,
                NULL
            );
            this->handle = file_handle;
            if (file_handle == INVALID_HANDLE_VALUE) {
                return false;
            }
            if (is_append) {
                SetFilePointer(file_handle, 0, NULL, FILE_END);
            }
            return true;
        }

        // 0x46F3E0
        // Method 4
        virtual gnu_noinline void thiscall close_file() asm_symbol_rel(0x46F3E0) {
            HANDLE file_handle = this->handle;
            if (file_handle != INVALID_HANDLE_VALUE) {
                CloseHandle(file_handle);
            }
            this->handle = INVALID_HANDLE_VALUE;
            this->access_mask = 0;
        }

        // 0x46F410
        // Method 8
        virtual gnu_noinline DWORD thiscall read_file_to_buffer(LPVOID buffer, DWORD size) asm_symbol_rel(0x46F410) {
            DWORD read_size = 0;
            if (this->access_mask != GENERIC_READ) {
                return 0;
            }
            ReadFile(this->handle, buffer, size, &read_size, NULL);
            return read_size;
        }

        // 0x46F450
        // Method C
        virtual gnu_noinline bool thiscall write_buffer_to_file(LPVOID buffer, DWORD size) asm_symbol_rel(0x46F450) {
            DWORD read_size = 0;
            if (this->access_mask != GENERIC_WRITE) {
                return false;
            }
            WriteFile(this->handle, buffer, size, &read_size, NULL);
            return size == read_size;
        }

        // 0x46F490
        // Method 10
        virtual gnu_noinline DWORD thiscall get_file_pointer() asm_symbol_rel(0x46F490) {
            HANDLE file_handle = this->handle;
            if (file_handle == INVALID_HANDLE_VALUE) {
                return 0;
            }
            return SetFilePointer(file_handle, 0, NULL, FILE_CURRENT);
        }

        // 0x46F4B0
        // Method 14
        virtual gnu_noinline DWORD thiscall get_file_size() asm_symbol_rel(0x46F4B0) {
            HANDLE file_handle = this->handle;
            if (file_handle == INVALID_HANDLE_VALUE) {
                return 0;
            }
            return GetFileSize(file_handle, NULL);
        }

        // 0x46F4D0
        // Method 18
        virtual gnu_noinline bool thiscall set_file_pointer(LONG offset, DWORD origin) asm_symbol_rel(0x46F4D0) {
            HANDLE file_handle = this->handle;
            if (file_handle == INVALID_HANDLE_VALUE) {
                return false;
            }
            SetFilePointer(file_handle, offset, NULL, origin);
            return true;
        }

        // 0x46F1E0
        // Method 1C
        virtual ~File() {
            HANDLE file_handle = this->handle;
            if (file_handle != INVALID_HANDLE_VALUE) {
                CloseHandle(file_handle);
                this->handle = INVALID_HANDLE_VALUE;
                this->access_mask = 0;
            }
        }

        // 0x46F500
        // Method 20
        virtual gnu_noinline LPVOID copy_file_to_new_buffer(LONG file_offset) asm_symbol_rel(0x46F500) {
            if (this->access_mask == GENERIC_READ) {
                DWORD file_size = this->get_file_size();
                if ((DWORD)file_offset <= file_size) {
                    if (LPVOID buffer = malloc(file_size)) {
                        file_offset = this->get_file_pointer();
                        if (this->set_file_pointer(file_offset, FILE_BEGIN)) {
                            if (!this->read_file_to_buffer(buffer, file_size)) {
                                // Yes, this free is misplaced and can leak memory
                                free(buffer);
                            } else {
                                this->set_file_pointer(file_offset, FILE_BEGIN);
                                return buffer;
                            }
                        }
                    }
                }
            }
            return NULL;
        }
    };

};

// size: 0x10(?)
struct ArcFileInner {
    char* __string_0; // 0x0
    int __dword_4; // 0x4
    int32_t file_size; // 0x8
    int __dword_C; // 0xC
    // 0x10

    // 0x46F1C0
    ArcFileInner() : __string_0(NULL) {}

    // 0x46F1A0
    ~ArcFileInner() {
        SAFE_FREE(this->__string_0);
    }
};

// size: 0xC
struct UnknownP {
    uint8_t xor_mask; // 0x0
    uint8_t xor_accel; // 0x1
    uint8_t __ubyte_2; // 0x2
    probably_padding_bytes(0x1); // 0x3
    int32_t __int_4; // 0x4
    int32_t __int_8; // 0x8
    // 0xC
};

/*
extern "C" {
    // 0x4C5360
    extern UnknownP UNKNOWN_P[] asm("_UNKNOWN_P");
}
*/

// 0x4C5360
static UnknownP UNKNOWN_P[] = {
    [0] = {
        .xor_mask = 0x1B,
        .xor_accel = 0x73,
        .__ubyte_2 = 0xAA,
        .__int_4 = 256,
        .__int_8 = 0x3800
    },
    [1] = {
        .xor_mask = 0x12,
        .xor_accel = 0x43,
        .__ubyte_2 = 0xFF,
        .__int_4 = 512,
        .__int_8 = 0x3E00
    },
    [2] = {
        .xor_mask = 0x35,
        .xor_accel = 0x79,
        .__ubyte_2 = 0x11,
        .__int_4 = 1024,
        .__int_8 = 0x3C00
    },
    [3] = {
        .xor_mask = 0x03,
        .xor_accel = 0x91,
        .__ubyte_2 = 0xDD,
        .__int_4 = 128,
        .__int_8 = 0x6400
    },
    [4] = {
        .xor_mask = 0xAB,
        .xor_accel = 0xDC,
        .__ubyte_2 = 0xEE,
        .__int_4 = 128,
        .__int_8 = 0x7000
    },
    [5] = {
        .xor_mask = 0x51,
        .xor_accel = 0x9E,
        .__ubyte_2 = 0xBB,
        .__int_4 = 256,
        .__int_8 = 0x4000
    },
    [6] = {
        .xor_mask = 0xC1,
        .xor_accel = 0x15,
        .__ubyte_2 = 0xCC,
        .__int_4 = 1024,
        .__int_8 = 0x2C00
    },
    [7] = {
        .xor_mask = 0x99,
        .xor_accel = 0x7D,
        .__ubyte_2 = 0x77,
        .__int_4 = 128,
        .__int_8 = 0x4400
    }
};

// 0x401F50
dllexport gnu_noinline void* fastcall __crypt_buffer(void* buffer, int32_t buffer_size, uint8_t xor_mask, uint8_t xor_accel, int32_t arg3, int32_t arg4) asm_symbol_rel(0x401F50);
dllexport gnu_noinline void* fastcall __crypt_buffer(void* buffer, int32_t buffer_size, uint8_t xor_mask, uint8_t xor_accel, int32_t arg3, int32_t arg4) {
    use_var(buffer);
    use_var(buffer_size);
    use_var(xor_mask);
    use_var(xor_accel);
    use_var(arg3);
    use_var(arg4);
    return (void*)rand();
}

// 0x401E40
dllexport gnu_noinline void* fastcall __decrypt_buffer(void* buffer, int32_t buffer_size, uint8_t xor_mask, uint8_t xor_accel, int32_t arg3, int32_t arg4) asm_symbol_rel(0x401E40);
dllexport gnu_noinline void* fastcall __decrypt_buffer(void* buffer, int32_t buffer_size, uint8_t xor_mask, uint8_t xor_accel, int32_t arg3, int32_t arg4) {
    int32_t intA = buffer_size % arg3; // EBX
    uint8_t* input_buffer = (uint8_t*)buffer; // ESI
    uint8_t* buffer_write_offset = input_buffer; // EBP-4
    int32_t intB = arg3 / 4; // EBP-C
    // Definitely not a min func since those use <
    int32_t temp_size = arg4 > buffer_size ? buffer_size : arg4; // EBP-10
    void* temp_buffer = malloc(temp_size);
    input_buffer = (uint8_t*)temp_buffer;
    if (temp_buffer) {
        buffer_size = (buffer_size & ~1) - (intA >= intB ? 0 : intA);
        memcpy(temp_buffer, buffer, temp_size);
        while (buffer_size > 0) {
            if (arg4 <= 0) {
                break;
            }
            arg3 = buffer_size >= arg3 ? arg3 : buffer_size;
            buffer_write_offset += arg3;
            uint8_t* buffer_write = buffer_write_offset - 1;
            for (
                int32_t i = (arg3 + 1) / 2;
                i > 0;

            ) {
                uint8_t val = *input_buffer;
                buffer_write -= 2;
                val ^= xor_mask;
                --i;
                xor_mask += xor_accel;
                buffer_write[2] = val;
                ++input_buffer;
            }
            buffer_write = buffer_write_offset - 2;
            for (
                int32_t i = arg3 / 2;
                i > 0;

            ) {
                uint8_t val = *input_buffer;
                buffer_write -= 2;
                val ^= xor_mask;
                --i;
                xor_mask += xor_accel;
                buffer_write[2] = val;
                ++input_buffer;
            }
            buffer_size -= arg3;
            arg4 -= arg3;
        }
        free(temp_buffer);
    }
    return buffer;
}

extern "C" {
    // 0x51F660
    extern uint8_t DECOMPRESS_BUFFER[0x2000] asm("_DECOMPRESS_BUFFER");
}

// 0x46F5B0
dllexport gnu_noinline void* fastcall __compress_buffer(void* buffer_in, int32_t buffer_size, int32_t* out_buffer_size) asm_symbol_rel(0x46F5B0);
dllexport gnu_noinline void* fastcall __compress_buffer(void* buffer_in, int32_t buffer_size, int32_t* out_buffer_size) {
    use_var(buffer_in);
    use_var(buffer_size);
    *out_buffer_size = rand();
    return (void*)rand();
}

// 0x46F840
// This function looks like handwritten assembly. Compilers don't emit shift instructions that modify flags like this, right?
dllexport gnu_noinline void* fastcall __decompress_buffer(void* buffer_in, int32_t buffer_size, void* out_buffer, int32_t out_buffer_size) asm_symbol_rel(0x46F840);
dllexport gnu_noinline void* fastcall __decompress_buffer(void* buffer_in, int32_t buffer_size, void* out_buffer, int32_t out_buffer_size) {
    codegen_barrier();
    uint32_t uintA = 0; // EBP-8
    uint8_t* buffer = (uint8_t*)buffer_in;
    uint8_t byteA = 0x80;
    if (!out_buffer) {
        if (!(out_buffer = malloc(out_buffer_size))) {
            return NULL;
        }
        uintA = 0; // EBP-8
    }
    uint8_t* buffer_read = buffer; // EBP-1C
    uint8_t* out_buffer_write = (uint8_t*)out_buffer; // EBP-10
    uint32_t decompress_buffer_offset = 1; // EBP-14
    uint32_t uintC = 0x80; // EBP-20
    ptrdiff_t sizeA;

    auto common_loop = [&](uint32_t arg) {
        int32_t ret = 0;
        nounroll do {
            if (byteA == 0x80) {
                uintA = *buffer_read;
                if (sizeA >= buffer_size) {
                    uintA = 0;
                } else {
                    ++buffer_read;
                    ++sizeA;
                }
            }
            // The argument order gets flipped here without the cast
            if ((uint8_t)uintA & byteA) {
                codegen_barrier();
                ret |= arg;
            }
            if (!(byteA >>= 1)) {
                byteA = uintC;
            }
        } while (arg >>= 1);
        return ret;
    };

    for (;;) {
        uint8_t byteB = byteA >> 1; // EBP+F
        codegen_barrier();
        codegen_volatile uint8_t byteC = byteA; // EBP+1
        uint32_t uintB; // this was optimized out, see below
        if (byteA == 0x80) {
            uintA = *buffer_read;
            sizeA = buffer_read - buffer;
            byteA = byteB;
            if (sizeA >= buffer_size) {
                uintA = 0;
                uintB = 0;
                // the compiler figured out that the uintB != 0 branch
                // around loop A is impossible from here and skipped it
            }
            else {
                uintB = byteC;
                ++buffer_read;
                uintB &= uintA;
            }
        }
        else {
            uintB = byteA;
            byteA = byteB;
            uintB &= uintA;
            if (!byteA) {
                byteA = 0x80;
            }
        }
        sizeA = buffer_read - buffer;
        if (uintB) {
            // loop A
            uint32_t val = common_loop(0b10000000); // 0x80
            DECOMPRESS_BUFFER[decompress_buffer_offset++] = val;
            *out_buffer_write++ = val;
            decompress_buffer_offset %= countof(DECOMPRESS_BUFFER);
        }
        else {
            // loop B
            int32_t intD = common_loop(0b1000000000000); // 0x1000
            if (!intD) {
                return out_buffer;
            }
            sizeA = buffer_read - buffer;
            // loop C
            int32_t iters = common_loop(0b1000) + 2; // 0x8
            // loop D
            for (int32_t i = 0; i <= iters; ++i) {
                uint8_t val = DECOMPRESS_BUFFER[(intD + i) % countof(DECOMPRESS_BUFFER)];
                DECOMPRESS_BUFFER[decompress_buffer_offset++] = val;
                *out_buffer_write++ = val;
                decompress_buffer_offset %= countof(DECOMPRESS_BUFFER);
            }
        }
    }
}

// size: 0x10
struct ArcFile {
    ArcFileInner* __pointer_0; // 0x0
    int32_t __int_4; // 0x4
    char* __string_8; // 0x8
    Pbg::File* file; // 0xC
    // 0x10

    // 0x46EC50
    ~ArcFile() {
        if (char* str = this->__string_8) {
            DebugLogger::__debug_log_stub_2("info : %s close arcfile\r\n", str);
            free(this->__string_8);
        }
        this->__string_8 = NULL;
        SAFE_DELETE_ARRAY(this->__pointer_0);
        SAFE_DELETE(this->file);
        this->__int_4 = 0;
    }

    // 0x46EB80
    dllexport static gnu_noinline bool stdcall __sub_46EB80(int32_t = UNUSED_DWORD) asm_symbol_rel(0x46EB80);

    // 0x46EE90
    dllexport static gnu_noinline bool stdcall __sub_46EE90(int32_t = UNUSED_DWORD) asm_symbol_rel(0x46EE90);

    // 0x46ED10
    dllexport gnu_noinline void* thiscall __sub_46ED10(const char* filename, void* file_buffer) asm_symbol_rel(0x46ED10) {
        if (!this->file) {
            return NULL;
        }
        ArcFileInner* ptrA = this->__pointer_0;
        if (ptrA) {
            for (int32_t i = this->__int_4; i > 0; --i, ++ptrA) {
                if (!stricmp(filename, ptrA->__string_0)) {
                    goto found_in_cache;
                }
            }
        }
        DebugLogger::__debug_log_stub_2("info : %s error\r\n", this->__string_8);
        return NULL;
found_in_cache:
        int32_t new_file_size = (intptr_t)(ptrA + 1)->__string_0 - ptrA->__dword_4;
        size_t cached_file_size = ptrA->file_size;
        void* cached_file_buffer;
        if (new_file_size == cached_file_size && file_buffer) {
            cached_file_buffer = file_buffer;
        } else {
            cached_file_buffer = malloc(new_file_size);
        }
        if (!cached_file_buffer) {
            goto error_free;
        }
        if (!this->file->set_file_pointer(this->__int_4, FILE_BEGIN)) {
            goto error_free;
        }
        if (!this->file->read_file_to_buffer(cached_file_buffer, new_file_size)) {
            goto error_free;
        }
        const char* strA = ptrA->__string_0;
        uint8_t string_sum = 0;
        for (
            size_t string_length = byteloop_strlen(strA);
            string_length;
            --string_length
        ) {
            string_sum += *strA++;
        }
        UnknownP& xor_data = UNKNOWN_P[string_sum % countof(UNKNOWN_P)];
        __decrypt_buffer(cached_file_buffer, new_file_size, xor_data.xor_mask, xor_data.xor_accel, xor_data.__int_4, xor_data.__int_8);
        void* ret;
        if (cached_file_size != new_file_size) {
            ret = __decompress_buffer(cached_file_buffer, new_file_size, file_buffer, cached_file_size);
        } else {
            ret = cached_file_buffer;
        }
        if (ret != file_buffer && file_buffer) {
            free(file_buffer);
        }
        return ret;
error_free:
        DebugLogger::__debug_log_stub_2("info : %s error\r\n", this->__string_8);
        if (cached_file_buffer) {
            free(cached_file_buffer);
        }
        return NULL;
    }
};
extern "C" {
    // 0x5217C0
    extern ArcFile THDAT_ARCFILE asm("_THDAT_ARCFILE");
}

// size: 0x10
struct DatFileHeader {
    ZUNMagic magic; // 0x0
    uint32_t decompressed_size; // 0x4
    uint32_t compressed_size; // 0x8
    int __dword_C; // 0xC
    // 0x10
};
#pragma region // DatFileHeader Validation
ValidateFieldOffset32(0x0, DatFileHeader, magic);
ValidateFieldOffset32(0x4, DatFileHeader, decompressed_size);
ValidateFieldOffset32(0x8, DatFileHeader, compressed_size);
ValidateFieldOffset32(0xC, DatFileHeader, __dword_C);
ValidateStructSize32(0x10, DatFileHeader);
#pragma endregion

// 0x46EE90
dllexport gnu_noinline bool stdcall ArcFile::__sub_46EE90(int32_t) {
    if (Pbg::File* pbg_file = THDAT_ARCFILE.file) {
        if (pbg_file->open_file("th18.dat", "r")) {
            DatFileHeader dat_header;
            if (THDAT_ARCFILE.file->read_file_to_buffer(&dat_header, sizeof(DatFileHeader))) {
                __decrypt_buffer(&dat_header, sizeof(DatFileHeader), 0x1B, 0x37, 0x10, 0x10);
                if (dat_header.magic.as_uint == PackUInt('T', 'H', 'A', '1')) {
                    uint32_t uintA = dat_header.__dword_C + 0xF7E7F8AC; // IDK what this value is
                    dat_header.decompressed_size -= 123456789;
                    dat_header.compressed_size -= 987654321;
                    THDAT_ARCFILE.__int_4 = uintA;
                    int32_t data_offset = THDAT_ARCFILE.file->get_file_size() - dat_header.compressed_size;
                    THDAT_ARCFILE.file->set_file_pointer(data_offset, FILE_BEGIN);
                    size_t compressed_size = dat_header.compressed_size;
                    if (void* compressed_buffer = malloc(compressed_size)) {
                        void* buffer = NULL;
                        if (THDAT_ARCFILE.file->read_file_to_buffer(compressed_buffer, compressed_size)) {
                            __decrypt_buffer(compressed_buffer, compressed_size, 0x3E, 0x9B, 0x80, compressed_size);
                            buffer = __decompress_buffer(compressed_buffer, compressed_size, buffer, dat_header.decompressed_size);
                            if (buffer) {
                                int32_t intA = THDAT_ARCFILE.__int_4;
                                ArcFileInner* arcfile_inner_array = new ArcFileInner[intA + 1];
                                if (!arcfile_inner_array) {
                                    THDAT_ARCFILE.__pointer_0 = NULL;
                                    free(compressed_buffer);
                                    goto free_buffer;
                                }
                                char* buffer_read = (char*)buffer;
                                ArcFileInner* arcfile_inner_array_write = arcfile_inner_array;
                                for (int32_t i = intA; i > 0; --i) {
                                    arcfile_inner_array_write->__string_0 = pbg_strdup(buffer_read);
                                    int32_t length = byteloop_strlen(buffer_read) + 1;
                                    if (int32_t temp = length % 4) {
                                        length += 4 - temp;
                                    }
                                    buffer_read += length;
                                    arcfile_inner_array_write->__dword_4 = ((uint32_t*)buffer_read)[0];
                                    arcfile_inner_array_write->file_size = ((uint32_t*)buffer_read)[1];
                                    arcfile_inner_array_write->__dword_C = ((uint32_t*)buffer_read)[2];
                                    buffer_read += sizeof(uint32_t[3]);
                                    ++arcfile_inner_array_write;
                                }
                                arcfile_inner_array[intA].__dword_4 = data_offset;
                                arcfile_inner_array[intA].file_size = 0;
                                THDAT_ARCFILE.__pointer_0 = arcfile_inner_array;
                                free(compressed_buffer);
                                free(buffer);
                                return true;
                            }
                        }
                        free(compressed_buffer);
                        if (buffer) {
free_buffer:
                            free(buffer);
                        }
                    }
                }
            }
        }
        SAFE_DELETE(THDAT_ARCFILE.file);
    }
    return false;
}

// 0x46EB80
dllexport gnu_noinline bool stdcall ArcFile::__sub_46EB80(int32_t) {
    THDAT_ARCFILE.~ArcFile();
    char current_directory[512];
    GetCurrentDirectoryA(countof(current_directory), current_directory);
    DebugLogger::__debug_log_stub_2("info : CurrentDirectory %s \r\n", current_directory);
    Pbg::File* pbg_file = new Pbg::File();
    THDAT_ARCFILE.file = pbg_file;
    if (ArcFile::__sub_46EE90()) {
        char* str;
        clang_noinline str = pbg_strdup("th18.dat");
        THDAT_ARCFILE.__string_8 = str;
        if (str) {
            THDAT_ARCFILE.file->open_file(str, "r");
            return true;
        }
    }
    THDAT_ARCFILE.~ArcFile();
    return false;
}

// size: 0x10
struct ArcFileEx : ArcFile {
    // 0x46EB50
    dllexport gnu_noinline ArcFileEx() {
        this->__pointer_0 = NULL;
        this->__int_4 = 0;
        this->__string_8 = NULL;
        this->file = NULL;
    }

    // 0x46EB70
    dllexport gnu_noinline ~ArcFileEx() asm_symbol_rel(0x46EB70) {}
};

extern "C" {
    // 0x568AF0
    extern ArcFileEx ARCFILE_ARRAY[20] asm("_ARCFILE_ARRAY");
}

// 0x402060
dllexport gnu_noinline void* fastcall read_file_to_buffer(const char* path, int32_t* file_size_out, bool is_not_in_dat) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    DWORD file_size;
    void* ret = NULL;
    if (!is_not_in_dat) {
        const char* filename = strrchr(path, '\\');
        filename = strrchr(filename ? ++filename : path, '/');
        filename = filename ? ++filename : path;
        if (ArcFileInner* ptrA = THDAT_ARCFILE.__pointer_0) {
            for (int32_t i = THDAT_ARCFILE.__int_4; i > 0; --i, ++ptrA) {
                if (!stricmp(filename, ptrA->__string_0)) {
                    file_size = ptrA->file_size;
                    goto decode_file;
                }
            }
        }
        file_size = 0;
decode_file:
        if (file_size_out) {
            *file_size_out = file_size;
        }
        if (file_size) {
            DebugLogger::__debug_log_stub_4("%s Decode ... \r\n", filename);
            if ((ret = malloc(file_size))) {
                THDAT_ARCFILE.__sub_46ED10(filename, ret);
            }
        }
    } else {
        DebugLogger::__debug_log_stub_4("%s Load ... \r\n", path);
        HANDLE file_handle = CreateFileA(
            path,
            GENERIC_READ,
            FILE_SHARE_READ,
            NULL,
            OPEN_EXISTING,
            FILE_ATTRIBUTE_NORMAL | FILE_FLAG_SEQUENTIAL_SCAN,
            NULL
        );
        if (file_handle == INVALID_HANDLE_VALUE) {
            DebugLogger::__debug_log_stub_4("error : %s is not found.\r\n", path);
        }
        else {
            file_size = GetFileSize(file_handle, NULL);
            if (!(ret = malloc(file_size))) {
                DebugLogger::__debug_log_stub_4("error : %s allocation error.\r\n", path);
            }
            else {
                ReadFile(file_handle, ret, file_size, &file_size, NULL);
                if (file_size_out) {
                    *file_size_out = file_size;
                }
            }
            CloseHandle(file_handle);
        }
    }
    CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
    return ret;
}

extern "C" {
    // 0x570EA0
    extern char PATH_BUFFER[MAX_PATH] asm("_PATH_BUFFER");
}
inline void* read_file_from_dat(const char* path) {
    PATH_BUFFER[0] = '\0';
    byteloop_strcat(PATH_BUFFER, path);
    return read_file_to_buffer(PATH_BUFFER, NULL, false);
}

// 0x402220
dllexport gnu_noinline BOOL fastcall zun_file_exists(const char* filename) asm_symbol_rel(0x402220);
dllexport gnu_noinline BOOL fastcall zun_file_exists(const char* filename) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    HANDLE file_handle = CreateFileA(
        filename, // lpFileName
        GENERIC_READ, // dwDesiredAccess
        FILE_SHARE_READ, // dwShareMode
        NULL, // lpSecurityFeatures
        OPEN_EXISTING, // dwCreationDisposition
        FILE_ATTRIBUTE_NORMAL | FILE_FLAG_SEQUENTIAL_SCAN, // dwFlagsAndAttributes
        NULL // hTemplateFile
    );
    if (file_handle != INVALID_HANDLE_VALUE) {
        CloseHandle(file_handle);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return TRUE;
    }
    else {
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return FALSE;
    }
}
// 0x4022A0
dllexport gnu_noinline ZUNResult fastcall __zun_create_new_file_from_buffer(const char* filename, void* buffer, size_t buffer_size) asm_symbol_rel(0x4022A0);
dllexport gnu_noinline ZUNResult fastcall __zun_create_new_file_from_buffer(const char* filename, void* buffer, size_t buffer_size) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    HANDLE file_handle = CreateFileA(
        filename, // lpFileName
        GENERIC_WRITE, // dwDesiredAccess
        FILE_SHARE_READ, // dwShareMode
        NULL, // lpSecurityFeatures
        CREATE_ALWAYS, // dwCreationDisposition
        FILE_ATTRIBUTE_NORMAL, // dwFlagsAndAttributes
        NULL // hTemplateFile
    );
    if (file_handle == INVALID_HANDLE_VALUE) {
        FormatMessageA(
            FORMAT_MESSAGE_ALLOCATE_BUFFER | FORMAT_MESSAGE_IGNORE_INSERTS | FORMAT_MESSAGE_FROM_SYSTEM, // dwFlags
            NULL, // lpSource
            GetLastError(), // dwMessageId,
            LANG_USER_DEFAULT, // dwLanguageId,
            (LPSTR)&buffer_size, // lpBuffer
            0, // nSize
            NULL // Arguments
        );
        DebugLogger::__debug_log_stub_4("error : %s write error %s\r\n", filename, (char*)buffer_size);
        LocalFree((HLOCAL)buffer_size);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR;
    }
    DWORD bytes_written;
    WriteFile(
        file_handle, // hFile
        buffer, // lpBuffer
        buffer_size, // nNumberOfBytesToWrite
        &bytes_written, // lpNumberOfBytesWritten
        NULL // lpOverlapped
    );
    if (buffer_size != bytes_written) {
        CloseHandle(file_handle);
        DebugLogger::__debug_log_stub_4("error : %s write error\r\n", filename);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR2;
    }
    CloseHandle(file_handle);
    DebugLogger::__debug_log_stub_4("%s write ... \r\n", filename);
    CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
    return ZUN_SUCCESS;
}

extern "C" {
    // 0x4CA96C
    extern HANDLE STATIC_FILE_HANDLE asm("_STATIC_FILE_HANDLE");
}

inline ZUNResult __zun_open_file(const char* filename) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    HANDLE file_handle = CreateFileA(
        filename, // lpFileName
        GENERIC_READ, // dwDesiredAccess
        FILE_SHARE_READ, // dwShareMode
        NULL, // lpSecurityFeatures
        OPEN_EXISTING, // dwCreationDisposition
        FILE_ATTRIBUTE_NORMAL | FILE_FLAG_SEQUENTIAL_SCAN, // dwFlagsAndAttributes
        NULL // hTemplateFile
    );
    STATIC_FILE_HANDLE = file_handle;
    if (file_handle == INVALID_HANDLE_VALUE) {
        char* message;
        FormatMessageA(
            FORMAT_MESSAGE_ALLOCATE_BUFFER | FORMAT_MESSAGE_IGNORE_INSERTS | FORMAT_MESSAGE_FROM_SYSTEM, // dwFlags
            NULL, // lpSource
            GetLastError(), // dwMessageId,
            LANG_USER_DEFAULT, // dwLanguageId,
            (LPSTR)&message, // lpBuffer
            0, // nSize
            NULL // Arguments
        );
        DebugLogger::__debug_log_stub_4("error : %s write error %s\r\n", filename, message);
        LocalFree((HLOCAL)message);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR;
    }
    DebugLogger::__debug_log_stub_4("%s open ...\r\n", filename);
    return ZUN_SUCCESS;
}

// 0x4023E0
dllexport gnu_noinline ZUNResult fastcall __zun_open_new_file(const char* filename) asm_symbol_rel(0x4023E0);
dllexport gnu_noinline ZUNResult fastcall __zun_open_new_file(const char* filename) {
    CRITICAL_SECTION_MANAGER.enter_section(FileIO_CS);
    HANDLE file_handle = CreateFileA(
        filename, // lpFileName
        GENERIC_WRITE, // dwDesiredAccess
        FILE_SHARE_READ, // dwShareMode
        NULL, // lpSecurityFeatures
        CREATE_ALWAYS, // dwCreationDisposition
        FILE_ATTRIBUTE_NORMAL, // dwFlagsAndAttributes
        NULL // hTemplateFile
    );
    STATIC_FILE_HANDLE = file_handle;
    if (file_handle == INVALID_HANDLE_VALUE) {
        char* message;
        FormatMessageA(
            FORMAT_MESSAGE_ALLOCATE_BUFFER | FORMAT_MESSAGE_IGNORE_INSERTS | FORMAT_MESSAGE_FROM_SYSTEM, // dwFlags
            NULL, // lpSource
            GetLastError(), // dwMessageId,
            LANG_USER_DEFAULT, // dwLanguageId,
            (LPSTR)&message, // lpBuffer
            0, // nSize
            NULL // Arguments
        );
        DebugLogger::__debug_log_stub_4("error : %s write error %s\r\n", filename, message);
        LocalFree((HLOCAL)message);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR;
    }
    DebugLogger::__debug_log_stub_4("%s open ...\r\n", filename);
    return ZUN_SUCCESS;
}

// 0x4024A0
dllexport gnu_noinline void* fastcall __zun_read_file(size_t bytes) asm_symbol_rel(0x4024A0);
dllexport gnu_noinline void* fastcall __zun_read_file(size_t bytes) {
    if (STATIC_FILE_HANDLE == INVALID_HANDLE_VALUE) {
        return NULL;
    }
    void* buffer = malloc(bytes);
    if (!buffer) {
        CloseHandle(STATIC_FILE_HANDLE);
        return NULL;
    }
    DWORD idgaf;
    ReadFile(
        STATIC_FILE_HANDLE, // hFile
        buffer, // lpBuffer
        bytes, // nNumberOfBytesToRead
        &idgaf, // lpNumberOfBytesRead
        NULL // lpOverlapped
    );
    return buffer;
}

inline ZUNResult fastcall __zun_write_file(void* buffer, size_t bytes) {
    if (STATIC_FILE_HANDLE == INVALID_HANDLE_VALUE) {
        return ZUN_ERROR;
    }
    DWORD written;
    WriteFile(
        STATIC_FILE_HANDLE, // hFile
        buffer, // lpBuffer
        bytes, // nNumberOfBytesToRead
        &written, // lpNumberOfBytesRead
        NULL // lpOverlapped
    );
    if (bytes != written) {
        CloseHandle(STATIC_FILE_HANDLE);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
        return ZUN_ERROR2;
    }
    return ZUN_SUCCESS;
}

// 0x402500
dllexport gnu_noinline ZUNResult fastcall __zun_close_file() asm_symbol_rel(0x402500);
dllexport gnu_noinline ZUNResult fastcall __zun_close_file() {
    HANDLE file_handle = STATIC_FILE_HANDLE;
    if (file_handle != INVALID_HANDLE_VALUE) {
        CloseHandle(file_handle);
        CRITICAL_SECTION_MANAGER.leave_section(FileIO_CS);
    }
    return ZUN_SUCCESS;
}

// size: 0x2008
template <size_t buffer_size>
struct LogBuffer {
    char buffer[buffer_size]; // 0x0
    char* buffer_write; // 0x2000
    bool is_error; // 0x2004

    LogBuffer() {
        this->buffer_write = this->buffer;
    }

    // 0x402530
    dllexport gnu_noinline const char* cdecl write(const char* format, ...) asm_symbol_rel(0x402530) {
        char stupid_stack_buffer[buffer_size];

        CRITICAL_SECTION_MANAGER.enter_section(Logging_CS);
        {
            va_list va;
            va_start(va, format);
            vsprintf(stupid_stack_buffer, format, va_use(va));
            size_t written_length = byteloop_strlen(stupid_stack_buffer);
            char* buffer_write = this->buffer_write;
            if (&buffer_write[written_length] < array_end_addr(this->buffer)) {
                byteloop_strcpy(buffer_write, stupid_stack_buffer);
                this->buffer_write += written_length;
                *this->buffer_write = '\0';
            }
        }
        CRITICAL_SECTION_MANAGER.leave_section(Logging_CS);
        return format;
    }

    // 0x402600
    dllexport gnu_noinline const char* cdecl write_error(const char* format, ...) asm_symbol_rel(0x402600) {
        char stupid_stack_buffer[0x200];

        CRITICAL_SECTION_MANAGER.enter_section(Logging_CS);
        {
            va_list va;
            va_start(va, format);
            vsprintf(stupid_stack_buffer, format, va_use(va));
            size_t written_length = byteloop_strlen(stupid_stack_buffer);
            char* buffer_write = this->buffer_write;
            if (&buffer_write[written_length] < array_end_addr(this->buffer)) {
                byteloop_strcpy(buffer_write, stupid_stack_buffer);
                this->buffer_write += written_length;
                *this->buffer_write = '\0';
            }
            this->is_error = true;
        }
        CRITICAL_SECTION_MANAGER.leave_section(Logging_CS);
        return format;
    }
};
extern "C" {
    // 0x4CABE8
    extern LogBuffer<0x2000> LOG_BUFFER asm("_LOG_BUFFER");
}

enum UpdateFuncRet : int32_t {
    UpdateFuncDeleteCurrentThenNext = 0,
    UpdateFuncNext = 1,
    UpdateFuncRepeatCurrent = 2,
    UpdateFuncEnd1 = 3,
    UpdateFuncEnd0 = 4,
    UpdateFuncEndN1 = 5,
    UpdateFuncRestartTick = 6,
    UpdateFuncCleanupThenNext = 7,
    UpdateFuncEnd0Dupe = 8,
};

typedef UpdateFuncRet(fastcall UpdateFunction)(void*);
typedef ZUNResult(fastcall UpdateFuncInit)(void*);
typedef ZUNResult(fastcall UpdateFuncCleanup)(void*);

// size: 0x28
struct UpdateFunc {
    int32_t priority; // 0x0
    union {
        uint32_t flags; // 0x4
        struct {
            uint32_t initialized : 1; // 1
            uint32_t run_on_update : 1; // 2
        };
    };
    UpdateFunction* on_update_func; // 0x8
    UpdateFuncInit* on_init_func; // 0xC
    UpdateFuncCleanup* on_cleanup_func; // 0x10
    ZUNList<UpdateFunc> list_node; // 0x14
    void* func_arg; // 0x24
    // 0x28

    // 0x401530
    UpdateFunc(UpdateFunction* tick_func) : initialized(false), on_update_func(NULL), on_init_func(NULL), on_cleanup_func(NULL) {
        this->priority = 0;
        this->list_node.initialize_with(this);
        this->initialized = true;
        this->on_update_func = tick_func;
        this->on_init_func = NULL;
        this->on_cleanup_func = NULL;
    }

    inline UpdateFunc(UpdateFunction* tick_func, bool run_on_update, void* arg) : initialized(false), on_update_func(NULL), on_init_func(NULL), on_cleanup_func(NULL) {
        this->priority = 0;
        this->list_node.initialize_with(this);
        this->initialized = true;
        this->run_on_update = run_on_update;
        this->on_update_func = tick_func;
        this->on_init_func = NULL;
        this->on_cleanup_func = NULL;
        this->func_arg = arg;
    }

#define declare_on_func(ret, func_name, func_field, ...) \
    inline ret func_name() { \
        if (auto* func = this->func_field) { \
            return func(this->func_arg); \
        } else return (ret)0; \
    }
    declare_on_func(ZUNResult, run_init, on_init_func)
    declare_on_func(ZUNResult, run_cleanup, on_cleanup_func)

#undef declare_on_func

    inline UpdateFuncRet run_update() {
        UpdateFuncRet ret;
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        ret = this->on_update_func(this->func_arg);
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        return ret;
    }
};
#pragma region // UpdateFunc Validation
ValidateFieldOffset32(0x0, UpdateFunc, priority);
ValidateFieldOffset32(0x4, UpdateFunc, flags);
ValidateFieldOffset32(0x8, UpdateFunc, on_update_func);
ValidateFieldOffset32(0xC, UpdateFunc, on_init_func);
ValidateFieldOffset32(0x10, UpdateFunc, on_cleanup_func);
ValidateFieldOffset32(0x14, UpdateFunc, list_node);
ValidateFieldOffset32(0x24, UpdateFunc, func_arg);
ValidateStructSize32(0x28, UpdateFunc);
#pragma endregion

typedef struct UpdateFuncRegistry UpdateFuncRegistry;
extern "C" {
    // 0x4CF294
    extern UpdateFuncRegistry* UPDATE_FUNC_REGISTRY_PTR asm("_UPDATE_FUNC_REGISTRY_PTR");
}
// size: 0x58
struct UpdateFuncRegistry {
    UpdateFunc on_tick_funcs; // 0x0
    UpdateFunc on_draw_funcs; // 0x28
    ZUNList<UpdateFunc>* __next_node; // 0x50
    int __dword_54; // 0x54
    // 0x58


    UpdateFuncRegistry() : on_tick_funcs(NULL), on_draw_funcs(NULL) {
        this->__next_node->data = NULL;
    }

    // 0x401180
    dllexport static gnu_noinline ZUNResult stdcall register_on_tick(UpdateFunc* update_tick, int32_t new_func_priority) asm_symbol_rel(0x401180) {
        ZUNResult ret = update_tick->run_init();
        UpdateFuncRegistry* update_func_registry = UPDATE_FUNC_REGISTRY_PTR;
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        {
            update_tick->priority = new_func_priority;
            auto* prev_priority_node = update_func_registry->on_tick_funcs.list_node.as_head().find_node_before([=](UpdateFunc* update_func) {
                return update_func->priority >= new_func_priority;
            });
            prev_priority_node->append(&update_tick->list_node);
        }
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        return ret;
    }

    // 0x401230
    dllexport static gnu_noinline int32_t stdcall register_on_draw(UpdateFunc* update_draw, int32_t new_func_priority) asm_symbol_rel(0x401230) {
        int32_t ret = update_draw->run_init();
        UpdateFuncRegistry* update_func_registry = UPDATE_FUNC_REGISTRY_PTR;
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        {
            update_draw->priority = new_func_priority;
            auto* prev_priority_node = update_func_registry->on_draw_funcs.list_node.as_head().find_node_before([=](UpdateFunc* update_func) {
                return update_func->priority >= new_func_priority;
            });
            prev_priority_node->append(&update_draw->list_node);
        }
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        return ret;
    }

    // 0x4015A0
    dllexport gnu_noinline void thiscall delete_func(UpdateFunc* update_func) asm_symbol_rel(0x4015A0) {
        if (update_func) {
            auto data_match = [=](UpdateFunc* data) {
                return data == update_func;
            };
            ZUNList<UpdateFunc>* update_func_node;
            if (!(update_func_node = this->on_tick_funcs.list_node.find_node_if(data_match)) &&
                !(update_func_node = this->on_draw_funcs.list_node.find_node_if(data_match))
            ) {
                return;
            }
            update_func_node->unlink_from_head(this->__next_node);
            if (update_func_node->prev) { // Don't try to delete the list heads
                update_func_node->unlink();
                update_func->on_update_func = NULL;
                if (update_func->initialized) {
                    update_func->on_init_func = NULL;
                    update_func->on_cleanup_func = NULL;
                    delete update_func;
                }
            }
        }
    }

#if GAME_VERSION == 190
    // 0x401650
    dllexport gnu_noinline void thiscall delete_func_locked(UpdateFunc* update_func) asm_symbol_rel(0x401650) {
        if (update_func) {
            CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
            {
                this->delete_func(update_func);
            }
            CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        }
    }
#endif

    // 0x4012E0
    dllexport gnu_noinline int32_t thiscall run_all_on_tick() asm_symbol_rel(0x4012E0) {
        int32_t ret;
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        {
RestartOnTick:
            ret = 0;
            ZUNList<UpdateFunc>* node = this->on_tick_funcs.list_node.next;
            while (node) {
                ZUNList<UpdateFunc>* next_node = node->next;
                this->__next_node = next_node;
                UpdateFunc* update_tick = node->data;
                node = next_node;
                if (!update_tick->on_update_func) {
                    continue;
                }
                if (update_tick->run_on_update) {
                    do {
                        if (this->__dword_54) {
                            goto CleanupThenNext;
                        }
                        int32_t update_ret;
                        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
                        {
                            update_ret = update_tick->on_update_func(update_tick->func_arg);
                        }
                        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
                        switch (expect_chance(update_ret, UpdateFuncRepeatCurrent, 0.05)) {
                            case UpdateFuncDeleteCurrentThenNext:
                                goto DeleteCurrentThenNext;
                            case UpdateFuncNext: default:
                                goto NextFunc;
                            case UpdateFuncRepeatCurrent:
                                continue;
                            case UpdateFuncEnd0: case UpdateFuncEnd0Dupe:
                                ret = 0;
                                goto EndOnTick;
                            case UpdateFuncEnd1:
                                ret = 1;
                                goto EndOnTick;
                            case UpdateFuncEndN1:
                                ret = -1;
                                goto EndOnTick;
                            case UpdateFuncRestartTick:
                                goto RestartOnTick;
                            case UpdateFuncCleanupThenNext:
                                goto CleanupThenNext;
                        }
                    } while (update_tick->run_on_update);
                    jump_only_block{
DeleteCurrentThenNext:
                        this->delete_func(update_tick);
                    }
                    jump_only_block{
CleanupThenNext:
                        update_tick->run_cleanup();
                    }
                }
NextFunc:
                node = this->__next_node;
                ++ret;
            }
        }
EndOnTick:
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        return ret;
    }

    // 0x401420
    dllexport static gnu_noinline int32_t run_all_on_draw() asm_symbol_rel(0x401420) {
        UpdateFuncRegistry* update_func_registry = UPDATE_FUNC_REGISTRY_PTR;
        int32_t ret;
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        {
//RestartOnTick:
            ret = 0;
            ZUNList<UpdateFunc>* node = update_func_registry->on_draw_funcs.list_node.next;
            while (expect(node != NULL, true)) {
                ZUNList<UpdateFunc>* next_node = node->next;
                update_func_registry->__next_node = next_node;
                UpdateFunc* update_draw = node->data;
                node = next_node;
                if (!update_draw->on_update_func) {
                    continue;
                }
                if (update_draw->run_on_update) {
                    do {
                        /*if (update_func_registry->__dword_54) {
                            goto CleanupThenNext;
                        }*/
                        int32_t update_ret;
                        CRITICAL_SECTION_MANAGER.enter_section_volatile(UpdateFuncRegistry_CS);
                        {
                            update_ret = update_draw->on_update_func(update_draw->func_arg);
                        }
                        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
                        switch (expect_chance(update_ret, UpdateFuncNext, 0.95)) {
                            case UpdateFuncDeleteCurrentThenNext:
                                goto DeleteCurrentThenNext;
                            case UpdateFuncNext: default:
                                goto NextFunc;
                            case UpdateFuncRepeatCurrent:
                                continue;
                            case UpdateFuncEnd0: //case UpdateFuncEnd0Dupe:
                                ret = 0;
                                goto EndOnDraw;
                            case UpdateFuncEnd1:
                                ret = 1;
                                goto EndOnDraw;
                            case UpdateFuncEndN1:
                                ret = -1;
                                goto EndOnDraw;
                            /*case UpdateFuncRestartTick:
                                goto RestartOnTick;
                            case UpdateFuncCleanupThenNext:
                                goto CleanupThenNext;*/
                        }
                    } while (update_draw->run_on_update);
                    jump_only_block{
DeleteCurrentThenNext:
                        update_func_registry->delete_func(update_draw);
                    }
                    /*jump_only_block{
CleanupThenNext:
                        update_tick->run_cleanup();
                    }*/
                }
            NextFunc:
                node = update_func_registry->__next_node;
                ++ret;
            }
        }
EndOnDraw:
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
        return ret;
    }
};
#pragma region // UpdateFuncRegistry Validation
ValidateFieldOffset32(0x0, UpdateFuncRegistry, on_tick_funcs);
ValidateFieldOffset32(0x28, UpdateFuncRegistry, on_draw_funcs);
ValidateFieldOffset32(0x50, UpdateFuncRegistry, __next_node);
ValidateFieldOffset32(0x54, UpdateFuncRegistry, __dword_54);
ValidateStructSize32(0x58, UpdateFuncRegistry);
#pragma endregion

// size: 0x8
struct Rng {
    uint16_t value; // 0x0
    uint32_t index; // 0x4
    // 0x8
    
    // 0x4026D0
    dllexport gnu_noinline uint16_t thiscall rand_ushort() asm_symbol_rel(0x4026D0) {
        CRITICAL_SECTION_MANAGER.enter_section(RNG_CS);
        {
            this->index++;
            uint16_t temp = (this->value ^ 0x9630) - 0x6553;
            this->value = ((temp & 0xC000) >> 14) + (temp << 2) & 0xFFFF;
        }
        CRITICAL_SECTION_MANAGER.leave_section(RNG_CS);
        return this->value;
    }
    
    // 0x402740
    dllexport gnu_noinline uint32_t thiscall rand_uint() asm_symbol_rel(0x402740) {
        uint16_t tempA, tempB;
        CRITICAL_SECTION_MANAGER.enter_section(RNG_CS);
        {
            this->index += 2;
            tempA = (this->value ^ 0x9630) - 0x6553;
            tempB = ((tempA & 0xC000) >> 14) + (tempA << 2) & 0xFFFF;
            tempB = (tempB ^ 0x9630) - 0x6553;
            this->value = ((tempB & 0xC000) >> 14) + (tempB << 2) & 0xFFFF;
        }
        CRITICAL_SECTION_MANAGER.leave_section(RNG_CS);
        return (tempA << 16) | tempB;
    }
    
    // 0x4027D0
    dllexport gnu_noinline float thiscall rand_float() asm_symbol_rel(0x4027D0) {
        __asm FINIT;
        float temp = this->rand_uint();
        return temp / (float)UINT32_MAX; // float jank rounds this to UINT32_MAX+1
    }
    // 0x402810
    dllexport gnu_noinline float thiscall rand_float_signed() asm_symbol_rel(0x402810) {
        __asm FINIT;
        float temp = this->rand_uint();
        return temp / (float)INT32_MAX - 1.0f; // float jank rounds this to INT32_MAX+1
    }
    // 0x405B90
    dllexport gnu_noinline float vectorcall rand_angle() asm_symbol_rel(0x405B90) {
        return this->rand_float_signed() * PI_f;
    }
    // 0x402850
    dllexport gnu_noinline float thiscall rand_angle_2() asm_symbol_rel(0x402850) {
        __asm FINIT;
        float temp = this->rand_uint();
        return temp / TWO_PI_f - PI_f;
    }
    
    // 0x406AB0
    dllexport gnu_noinline float vectorcall rand_float_range(float range) asm_symbol_rel(0x406AB0) {
        return this->rand_float() * range;
    }
    
    inline float rand_float_signed_range(float range) {
        return this->rand_float_signed() * range;
    }
    // 0x4615A0
    dllexport gnu_noinline uint32_t thiscall rand_uint_range(uint32_t range) asm_symbol_rel(0x4615A0) {
        if (range != 0) {
            return this->rand_uint() % range;
        } else {
            return 0;
        }
    }
};
#pragma region // Rng Validation
ValidateFieldOffset32(0x0, Rng, value);
ValidateFieldOffset32(0x4, Rng, index);
ValidateStructSize32(0x8, Rng);
#pragma endregion

extern "C" {
    // 0x4CF280
    extern Rng RNG asm("_RNG");
    // 0x4CF288
    extern Rng REPLAY_RNG asm("_REPLAY_RNG");
}

enum Difficulty {
    EASY = 0,
    NORMAL = 1,
    HARD = 2,
    LUNATIC = 3,
    EXTRA = 4,
    OVERDRIVE = 5
};

typedef struct Float3 Float3;
typedef struct Enemy Enemy;

// 0x4237F0
dllexport gnu_noinline Enemy* get_boss_by_index(int32_t boss_id) asm_symbol_rel(0x4237F0);

// size: 0x8
struct GameSpeed {
    float value = 1.0f; // 0x0
    int __counter_4; // 0x4
    // 0x8

    // 0x43A200
    dllexport gnu_noinline void vectorcall set(float new_speed) asm_symbol_rel(0x43A200);
};
#pragma region // GameSpeed Validation
ValidateFieldOffset32(0x0, GameSpeed, value);
ValidateFieldOffset32(0x4, GameSpeed, __counter_4);
ValidateStructSize32(0x8, GameSpeed);
#pragma endregion

extern "C" {
    // 0x4CCBF0
    extern GameSpeed GAME_SPEED asm("_GAME_SPEED");
}
// 0x43A200
dllexport gnu_noinline void vectorcall GameSpeed::set(float new_speed) {
    GAME_SPEED.value = new_speed;
}

static const float* TIME_SCALING_TABLE[] = {
    &GAME_SPEED.value
};

// size: 0x14
struct Timer {
    int32_t previous; // 0x0
    int32_t current; // 0x4
    float current_f; // 0x8
    uint32_t scale_table_index; // 0xC
    union {
        uint32_t flags; // 0x10
        struct {
            uint32_t initialized : 1;
        };
    };
    // 0x14

    inline operator int32_t() {
        return this->current;
    }
    inline operator float() {
        return this->current_f;
    }

    inline Timer() : initialized(false) {};

    inline void default_values() {
        this->current = 0;
        this->previous = -999999;
        this->current_f = 0.0f;
    }

private:
    inline void initialize_previous_force(int32_t value) volatile {
        this->previous = value;
    }
public:

    inline void initialize() {
        if (!this->initialized) {
            this->initialize_previous_force(-999999);
            this->scale_table_index = 0;
            this->initialized = true;
        }
    }

    inline void initialize_important() {
        if (!this->initialized) {
            this->scale_table_index = 0;
            this->initialized = true;
        }
    }
    inline void set_raw(int32_t time) {
        this->current = time;
        this->current_f = (float)time;
        this->previous = time - 1;
    }
    inline void set_raw(float time) {
        this->current_f = time;
        int32_t int_time = (int32_t)time;
        this->current = int_time;
        this->previous = int_time - 1;
    }
    // 0x405D10
    dllexport inline void thiscall set(int32_t time) asm_symbol_rel(0x405D10) {
        this->initialize_important();
        this->set_raw(time);
    }
    inline void set(float time) {
        this->initialize_important();
        this->set_raw(time);
    }
    inline void reset() {
        this->set(0);
    }

    inline void initialize_and_reset() {
        this->initialize();
        this->set_raw(0);
    }
    inline void initialize_and_set(int32_t time) {
        this->initialize();
        this->set_raw(time);
    }

    // 0x418C40
    // Yes, this really does copy a whole timer to the stack
    // Possibly an assignment operator...?
    dllexport gnu_noinline void set_from_timer(Timer timer) asm_symbol_rel(0x418C40) {
        this->set(timer.current);
    }

    // Just in case that is an assignment operator, check for warnings in current uses
    Timer& operator=(Timer timer) = delete;

    inline uint32_t get_scaling_index() {
        uint32_t time_scaling_index = this->scale_table_index;
        if (time_scaling_index >= countof(TIME_SCALING_TABLE)) {
            time_scaling_index = this->scale_table_index = 0;
        }
        return time_scaling_index;
    }

    inline float get_scale_unsafe() {
        return *TIME_SCALING_TABLE[this->scale_table_index];
    }

    // 0x402A60
    dllexport int32_t vectorcall add_raw(float value) asm_symbol_rel(0x402A60) {
        this->previous = this->current;
        return this->current = this->current_f += value;
    }

    inline int32_t vectorcall add_float(float amount) {
        const float* time_scale_ptr = TIME_SCALING_TABLE[this->get_scaling_index()];
        this->previous = this->current;
        if (time_scale_ptr) {
            float time_scale = *time_scale_ptr;
            if (!(time_scale > 0.99f) || !(time_scale < 1.01f)) {
                return this->current = this->current_f += time_scale * amount;
            }
        }
        return this->current = this->current_f += amount;
    }

    inline int32_t vectorcall sub_float(float amount) {
        const float* time_scale_ptr = TIME_SCALING_TABLE[this->get_scaling_index()];
        this->previous = this->current;
        if (time_scale_ptr) {
            float time_scale = *time_scale_ptr;
            if (!(time_scale > 0.99f) || !(time_scale < 1.01f)) {
                return this->current = this->current_f -= time_scale * amount;
            }
        }
        return this->current = this->current_f -= amount;
    }

    inline int32_t add_int(int32_t amount) {
        return this->add_float(amount);
    }

    // 0x452BF0
    dllexport int32_t thiscall sub_int(int32_t amount) asm_symbol_rel(0x452BF0) {
        return this->add_float(-amount);
    }
    
    inline int32_t increment() {
        const float* time_scale_ptr = TIME_SCALING_TABLE[this->get_scaling_index()];
        int32_t current = this->current;
        this->previous = current;
        if (time_scale_ptr) {
            float time_scale = *time_scale_ptr;
            if (!(time_scale > 0.99f) || !(time_scale < 1.01f)) {
                return this->current = this->current_f += time_scale;
            }
        }
        this->current_f += 1.0f;
        return this->current = ++current;
    }

    inline int32_t decrement() {
        return this->sub_float(1.0f);
    }
    
    // 0x405990
    dllexport int32_t thiscall operator++(int) asm_symbol_rel(0x405990) {
        clang_forceinline return this->increment();
    }

    // 0x402A80
    dllexport int32_t thiscall operator++() asm_symbol_rel(0x402A80) {
        clang_forceinline return this->increment();
    }

    // 0x409750
    dllexport int32_t thiscall operator--(int) asm_symbol_rel(0x409750) {
        clang_forceinline return this->decrement();
    }

    dllexport int32_t thiscall operator--() {
        clang_forceinline return this->decrement();
    }

    inline int32_t operator+=(int32_t amount) {
        return this->add_int(amount);
    }

    inline int32_t operator+=(float amount) {
        return this->add_float(amount);
    }

    inline int32_t operator-=(int32_t amount) {
        return this->sub_int(amount);
    }

    inline int32_t operator-=(float amount) {
        return this->sub_float(amount);
    }

    inline int32_t operator+(int32_t amount) {
        return this->current + amount;
    }
    inline float operator+(float amount) {
        return this->current_f + amount;
    }
    inline int32_t operator-(int32_t amount) {
        return this->current - amount;
    }
    inline float operator-(float amount) {
        return this->current_f - amount;
    }
    inline int32_t operator*(int32_t amount) {
        return this->current * amount;
    }
    inline float operator*(float amount) {
        return this->current_f * amount;
    }
    inline int32_t operator/(int32_t amount) {
        return this->current / amount;
    }
    inline float operator/(float amount) {
        return this->current_f / amount;
    }

    inline int32_t operator%(int32_t amount) {
        return this->current % amount;
    }

    friend inline int32_t operator-(int32_t amount, const Timer& self) {
        return amount - self.current;
    }
    friend inline float operator-(float amount, const Timer& self) {
        return amount - self.current_f;
    }
    friend inline int32_t operator/(int32_t amount, const Timer& self) {
        return amount / self.current;
    }
    friend inline float operator/(float amount, const Timer& self) {
        return amount / self.current_f;
    }

    friend inline int32_t operator%(int32_t amount, const Timer& self) {
        return amount % self.current;
    }

    // 0x4210A0
    dllexport BOOL thiscall __is_multiple_of_not_paused(int32_t value) asm_symbol_rel(0x4210A0) {
        int32_t current = this->current;
        if (
            current != this->previous &&
            !(current % value)
        ) {
            return TRUE;
        }
        return FALSE;
    }

    inline bool is_multiple_of(int32_t value) {
        return !(this->current % value);
    }

    inline bool les(int32_t time) {
        return this->current < time;
    }
    inline bool les(float time) {
        return this->current_f < time;
    }
    inline bool leq(int32_t time) {
        return this->current <= time;
    }
    inline bool leq(float time) {
        return this->current_f <= time;
    }
    inline bool gre(int32_t time) {
        return this->current > time;
    }
    inline bool gre(float time) {
        return this->current_f > time;
    }
    inline bool geq(int32_t time) {
        return this->current >= time;
    }
    inline bool geq(float time) {
        return this->current_f >= time;
    }
    inline bool equ(int32_t time) {
        return this->current == time;
    }
    inline bool equ(float time) {
        return this->current_f == time;
    }
    inline bool neq(int32_t time) {
        return this->current != time;
    }
    inline bool neq(float time) {
        return this->current_f != time;
    }
    inline bool is_zero() {
        return this->equ(0);
    }
    inline bool is_not_zero() {
        return this->neq(0);
    }

    inline bool operator<(int32_t time) {
        return this->les(time);
    }
    inline bool operator<(float time) {
        return this->les(time);
    }
    inline bool operator<=(int32_t time) {
        return this->leq(time);
    }
    inline bool operator<=(float time) {
        return this->leq(time);
    }
    inline bool operator>(int32_t time) {
        return this->gre(time);
    }
    inline bool operator>(float time) {
        return this->gre(time);
    }
    inline bool operator>=(int32_t time) {
        return this->geq(time);
    }
    inline bool operator>=(float time) {
        return this->geq(time);
    }
    inline bool operator==(int32_t time) {
        return this->equ(time);
    }
    inline bool operator==(float time) {
        return this->equ(time);
    }
    inline bool operator!=(int32_t time) {
        return this->neq(time);
    }
    inline bool operator!=(float time) {
        return this->neq(time);
    }
    inline bool operator!() {
        return this->is_zero();
    }
    inline operator bool() {
        return this->is_not_zero();
    }
};
#pragma region // Timer Validation
ValidateFieldOffset32(0x0, Timer, previous);
ValidateFieldOffset32(0x4, Timer, current);
ValidateFieldOffset32(0x8, Timer, current_f);
ValidateFieldOffset32(0xC, Timer, scale_table_index);
ValidateFieldOffset32(0x10, Timer, flags);
ValidateStructSize32(0x14, Timer);
#pragma endregion

// size: 0x14
struct InputMapping {
    int16_t shoot; // 0x0
    int16_t bomb; // 0x2
    int16_t focus; // 0x4
    int16_t pause; // 0x6
    int16_t __button4; // 0x8
    int16_t __button5; // 0xA
    int16_t __button6; // 0xC
    int16_t __button7; // 0xE
    int16_t use_card; // 0x10
    int16_t switch_card; // 0x12
    // 0x14
};
#pragma region // InputMapping Validation
ValidateFieldOffset32(0x0, InputMapping, shoot);
ValidateFieldOffset32(0x2, InputMapping, bomb);
ValidateFieldOffset32(0x4, InputMapping, focus);
ValidateFieldOffset32(0x6, InputMapping, pause);
ValidateFieldOffset32(0x10, InputMapping, use_card);
ValidateFieldOffset32(0x12, InputMapping, switch_card);
ValidateStructSize32(0x14, InputMapping);
#pragma endregion

static inline constexpr size_t BUTTON_COUNT = 32;

static inline constexpr uint32_t BUTTON_SHOOT       = 0x00000001; // 'Z'
static inline constexpr uint32_t BUTTON_BOMB        = 0x00000002; // 'X'

static inline constexpr uint32_t BUTTON_FOCUS       = 0x00000008; // VK_SHIFT
static inline constexpr uint32_t BUTTON_UP          = 0x00000010;
static inline constexpr uint32_t BUTTON_DOWN        = 0x00000020;
static inline constexpr uint32_t BUTTON_LEFT        = 0x00000040;
static inline constexpr uint32_t BUTTON_RIGHT       = 0x00000080;
static inline constexpr uint32_t BUTTON_PAUSE       = 0x00000100; // VK_ESCAPE
static inline constexpr uint32_t BUTTON_SKIP        = 0x00000200;
static inline constexpr uint32_t BUTTON_USE_CARD    = 0x00000400; // 'C'
static inline constexpr uint32_t BUTTON_SWITCH_CARD = 0x00000800; // 'D'

static inline constexpr uint32_t BUTTON_UNKNOWN_A   = 0x00010000;

static inline constexpr uint32_t BUTTON_SCREENSHOT  = 0x00040000; // 'P', VK_HOME
static inline constexpr uint32_t BUTTON_ENTER       = 0x00080000; // VK_RETURN

static inline constexpr uint32_t BUTTON_RESTART     = 0x00200000; // 'R', VK_END

static inline constexpr uint32_t BUTTON_SELECT      = BUTTON_SHOOT | BUTTON_ENTER; // 'Z', VK_RETURN
static inline constexpr uint32_t BUTTON_CANCEL      = BUTTON_BOMB; // 'X'

static inline constexpr uint32_t BUTTON_SHOOT_INDEX = 0;
static inline constexpr uint32_t BUTTON_BOMB_INDEX = 1;
static inline constexpr uint32_t BUTTON_FOCUS_INDEX = 3;
static inline constexpr uint32_t BUTTON_UP_INDEX = 4;
static inline constexpr uint32_t BUTTON_DOWN_INDEX = 5;
static inline constexpr uint32_t BUTTON_LEFT_INDEX = 6;
static inline constexpr uint32_t BUTTON_RIGHT_INDEX = 7;
static inline constexpr uint32_t BUTTON_PAUSE_INDEX = 8;
static inline constexpr uint32_t BUTTON_SKIP_INDEX = 9;
static inline constexpr uint32_t BUTTON_USE_CARD_INDEX = 10;
static inline constexpr uint32_t BUTTON_SWITCH_CARD_INDEX = 11;
static inline constexpr uint32_t BUTTON_SCREENSHOT_INDEX = 18;
static inline constexpr uint32_t BUTTON_ENTER_INDEX = 19;
static inline constexpr uint32_t BUTTON_RESTART_INDEX = 21;

#define XINPUT_GAMEPAD_LEFT_TRIGGER 0x10000
#define XINPUT_GAMEPAD_RIGHT_TRIGGER 0x20000

// 0x4B4320
// Is this actually an array of 20 with extra blanks?
static inline constexpr uint32_t XINPUT_PAD_MAPPINGS[] = {
    XINPUT_GAMEPAD_A,
    XINPUT_GAMEPAD_B,
    XINPUT_GAMEPAD_X,
    XINPUT_GAMEPAD_Y,
    XINPUT_GAMEPAD_LEFT_SHOULDER,
    XINPUT_GAMEPAD_RIGHT_SHOULDER,
    XINPUT_GAMEPAD_LEFT_TRIGGER,
    XINPUT_GAMEPAD_RIGHT_TRIGGER,
    XINPUT_GAMEPAD_LEFT_THUMB,
    XINPUT_GAMEPAD_RIGHT_THUMB,
    XINPUT_GAMEPAD_START,
    XINPUT_GAMEPAD_BACK
};

enum InputMode : int32_t {
    InputXInput = 0,
    InputJoypad = 1,
    InputKeyboard = 2,
};

// This matches UnknownV in the th19 repo
struct InputState {
    union {
        uint32_t hardware_inputs_current; // 0x0
        struct {

        };
    };
    union {
        uint32_t hardware_inputs_previous; // 0x4
        struct {

        };
    };
    union {
        uint32_t hardware_inputs_held_26_frames; // 0x8
        struct {

        };
    };
    union {
        uint32_t hardware_inputs_rising_edge; // 0xC
        struct {

        };
    };
    union {
        uint32_t hardware_inputs_falling_edge; // 0x10
        struct {

        };
    };
    uint32_t hardware_inputs_held_for_repeat[BUTTON_COUNT]; // 0x14
    uint32_t inputs_held_for_repeat[BUTTON_COUNT]; // 0x94
    uint32_t hardware_inputs_held[BUTTON_COUNT]; // 0x114
    uint32_t inputs_held[BUTTON_COUNT]; // 0x194
    int __dword_214; // 0x214
    union {
        uint32_t inputs_current; // 0x218
        struct {
            
        };
    };
    union {
        uint32_t inputs_previous; // 0x21C
        struct {
            
        };
    };
    union {
        uint32_t inputs_held_26_frames; // 0x220
        struct {
            
        };
    };
    union {
        uint32_t inputs_rising_edge; // 0x224
        struct {
            
        };
    };
    union {
        uint32_t inputs_falling_edge; // 0x228
        struct {
            
        };
    };
    union {
        uint32_t hardware_inputs_held_8_frames; // 0x22C
        struct {

        };
    };
    union {
        uint32_t inputs_held_8_frames; // 0x230
        struct {
            
        };
    };
    InputMode __device_type; // 0x234
    InputMapping joypad_mapping; // 0x238
    InputMapping xinput_mapping; // 0x24C
    InputMapping keyboard_mapping; // 0x260
    // 0x274

    // 0x418CE0
    dllexport gnu_noinline void thiscall __reset_inputs() asm_symbol_rel(0x418CE0) {
        memset(this->inputs_held_for_repeat, 0, sizeof(this->inputs_held_for_repeat));
        memset(this->inputs_held, 0, sizeof(this->inputs_held));
        this->__dword_214 = 0;
        this->inputs_current = 0;
        this->inputs_previous = 0;
        this->inputs_held_26_frames = 0;
        this->inputs_rising_edge = 0;
        this->inputs_falling_edge = 0;
        this->inputs_held_8_frames = 0;
    }

    // 0x404E90
    dllexport gnu_noinline void thiscall __update_hardware_input() asm_symbol_rel(0x404E90) {
        uint32_t current = this->hardware_inputs_current;
        uint32_t mask = 1;

        for (size_t i = 0; i < BUTTON_COUNT; ++i) {
            if (current & 1) {
                ++this->hardware_inputs_held_for_repeat[i];
                ++this->hardware_inputs_held[i];
                if (this->hardware_inputs_held_for_repeat[i] >= 8) {
                    this->hardware_inputs_held_8_frames |= mask;
                }
                if (this->hardware_inputs_held_for_repeat[i] >= 26) {
                    this->hardware_inputs_held_26_frames |= mask;
                    this->hardware_inputs_held_for_repeat[i] -= 8;
                }
            } else {
                this->hardware_inputs_held_for_repeat[i] = 0;
                this->hardware_inputs_held[i] = 0;
            }
            current >>= 1;
            mask <<= 1;
        }
        current = this->hardware_inputs_current;
        uint32_t changed = current ^ this->hardware_inputs_previous;
        this->hardware_inputs_rising_edge = current & changed;
        this->hardware_inputs_falling_edge = ~current & changed;
    }

    inline void __update_input() {
        uint32_t current = this->inputs_current;
        uint32_t mask = 1;

        for (size_t i = 0; i < BUTTON_COUNT; ++i) {
            if (current & 1) {
                ++this->inputs_held_for_repeat[i];
                ++this->inputs_held[i];
                if (this->inputs_held_for_repeat[i] >= 8) {
                    this->inputs_held_8_frames |= mask;
                }
                if (this->inputs_held_for_repeat[i] >= 26) {
                    this->inputs_held_26_frames |= mask;
                    this->inputs_held_for_repeat[i] -= 8;
                }
            } else {
                this->inputs_held_for_repeat[i] = 0;
                this->inputs_held[i] = 0;
            }
            current >>= 1;
            mask <<= 1;
        }
        current = this->inputs_current;
        uint32_t changed = current ^ this->inputs_previous;
        this->inputs_rising_edge = current & changed;
        this->inputs_falling_edge = ~current & changed;
    }

    inline BOOL check_inputs(uint32_t mask) {
        if (!(this->inputs_current & mask)) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_inputs_no_repeat(uint32_t mask) {
        if (!(this->inputs_rising_edge & mask)) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_inputs_repeating(uint32_t mask) {
        if (
            !(this->inputs_rising_edge & mask) &&
            !(this->inputs_held_26_frames & mask)
        ) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_hardware_inputs(uint32_t mask) {
        if (!(this->hardware_inputs_current & mask)) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_hardware_inputs_no_repeat(uint32_t mask) {
        if (!(this->hardware_inputs_rising_edge & mask)) {
            return FALSE;
        }
        return TRUE;
    }

    inline BOOL check_hardware_inputs_repeating(uint32_t mask) {
        if (
            !(this->hardware_inputs_rising_edge & mask) &&
            !(this->hardware_inputs_held_26_frames & mask)
        ) {
            return FALSE;
        }
        return TRUE;
    }

    inline uint32_t get_xinput(uint32_t buttons) {
        uint32_t prev_buttons = buttons;

        nounroll for (DWORD i = 0; i < 4; ++i) {
            XINPUT_STATE state = {};
            if (XInputGetState(i, &state) == ERROR_SUCCESS) {
                uint32_t pad_buttons = state.Gamepad.wButtons;
                if (state.Gamepad.bLeftTrigger >= XINPUT_GAMEPAD_TRIGGER_THRESHOLD) {
                    pad_buttons |= XINPUT_GAMEPAD_LEFT_TRIGGER;
                }
                if (state.Gamepad.bRightTrigger >= XINPUT_GAMEPAD_TRIGGER_THRESHOLD) {
                    pad_buttons |= XINPUT_GAMEPAD_RIGHT_TRIGGER;
                }
                if (state.Gamepad.sThumbLY >= XINPUT_GAMEPAD_LEFT_THUMB_DEADZONE) {
                    pad_buttons |= XINPUT_GAMEPAD_DPAD_UP;
                }
                if (state.Gamepad.sThumbLY <= -XINPUT_GAMEPAD_LEFT_THUMB_DEADZONE) {
                    pad_buttons |= XINPUT_GAMEPAD_DPAD_DOWN;
                }
                if (state.Gamepad.sThumbLX >= XINPUT_GAMEPAD_LEFT_THUMB_DEADZONE) {
                    pad_buttons |= XINPUT_GAMEPAD_DPAD_RIGHT;
                }
                if (state.Gamepad.sThumbLX <= -XINPUT_GAMEPAD_LEFT_THUMB_DEADZONE) {
                    pad_buttons |= XINPUT_GAMEPAD_DPAD_LEFT;
                }

                if (pad_buttons & XINPUT_GAMEPAD_DPAD_UP) {
                    buttons |= BUTTON_UP;
                }
                if (pad_buttons & XINPUT_GAMEPAD_DPAD_DOWN) {
                    buttons |= BUTTON_DOWN;
                }
                if (pad_buttons & XINPUT_GAMEPAD_DPAD_LEFT) {
                    buttons |= BUTTON_LEFT;
                }
                if (pad_buttons & XINPUT_GAMEPAD_DPAD_RIGHT) {
                    buttons |= BUTTON_RIGHT;
                }

                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.shoot]) {
                    buttons |= BUTTON_SHOOT;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.bomb]) {
                    buttons |= BUTTON_BOMB;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.focus]) {
                    buttons |= BUTTON_FOCUS;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.use_card]) {
                    buttons |= BUTTON_USE_CARD;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.switch_card]) {
                    buttons |= BUTTON_SWITCH_CARD;
                }
                if (pad_buttons & XINPUT_PAD_MAPPINGS[this->xinput_mapping.pause]) {
                    buttons |= BUTTON_PAUSE;
                }
            }
        }

        if (buttons != prev_buttons) {
            this->__device_type = InputXInput;
        }
        return buttons;
    }

    inline uint32_t get_joypad(uint32_t buttons);

    inline uint32_t get_keyboard(uint32_t buttons) {
        uint32_t prev_buttons = buttons;

        BYTE keys[256];
        GetKeyboardState(keys);

        // Again, this original code is *bad*.
        // I'm not going to attempt to match it.

        int32_t bomb = this->keyboard_mapping.bomb;
        int32_t shoot = this->keyboard_mapping.shoot;

        uint32_t pressed = keys[shoot]; // becomes 0x1
        pressed >>= 1;

        pressed |= keys[bomb] & 0x80; // becomes 0x2
        pressed >>= 1;

        // mystery key
        pressed >>= 1;

        int32_t focus = this->keyboard_mapping.focus;
        pressed |= keys[focus] & 0x80; // becomes 0x8
        pressed >>= 1;

        pressed |= (keys[VK_UP] | keys[VK_NUMPAD8]) & 0x80; // becomes 0x10
        pressed >>= 1;
        pressed |= (keys[VK_DOWN] | keys[VK_NUMPAD2]) & 0x80; // becomes 0x20
        pressed >>= 1;
        pressed |= (keys[VK_LEFT] | keys[VK_NUMPAD4]) & 0x80; // becomes 0x40
        pressed >>= 1;

        uint32_t pressed2 = (keys[VK_END] | keys['R']) & 0x80; // becomes 0x200000
        pressed2 <<= 1;

        // mystery key
        pressed2 <<= 1;

        pressed2 |= keys[VK_RETURN] & 0x80; // becomes 0x80000
        pressed2 <<= 1;

        pressed2 |= (keys[VK_HOME] | keys['P']) & 0x80; // becomes 0x40000
        pressed2 <<= 7;

        int32_t switch_card = this->keyboard_mapping.switch_card;
        pressed2 |= keys[switch_card] & 0x80; // becomes 0x800
        pressed2 <<= 1;

        int32_t use_card = this->keyboard_mapping.use_card;
        pressed2 |= keys[use_card] & 0x80; // becomes 0x400
        pressed2 <<= 1;

        // mystery key
        pressed2 <<= 1;

        int32_t pause = this->keyboard_mapping.pause;
        pressed2 |= keys[pause] & 0x80; // becomes 0x100
        pressed2 <<= 1;

        pressed |= pressed2;

        pressed |= (keys[VK_RIGHT] | keys[VK_NUMPAD6]) & 0x80; // becomes 0x80

        pressed |= keys[VK_NUMPAD3] & 0x80 ? BUTTON_DOWN | BUTTON_RIGHT : 0;
        pressed |= keys[VK_NUMPAD9] & 0x80 ? BUTTON_UP | BUTTON_RIGHT : 0;
        pressed |= keys[VK_NUMPAD1] & 0x80 ? BUTTON_DOWN | BUTTON_LEFT : 0;
        pressed |= keys[VK_NUMPAD7] & 0x80 ? BUTTON_UP | BUTTON_LEFT : 0;

        buttons |= pressed;

        if (buttons != prev_buttons) {
            this->__device_type = InputKeyboard;
        }
        return buttons;
    }
};
#pragma region // InputState Validation
ValidateFieldOffset32(0x0, InputState, hardware_inputs_current);
ValidateFieldOffset32(0x4, InputState, hardware_inputs_previous);
ValidateFieldOffset32(0x8, InputState, hardware_inputs_held_26_frames);
ValidateFieldOffset32(0xC, InputState, hardware_inputs_rising_edge);
ValidateFieldOffset32(0x14, InputState, hardware_inputs_held_for_repeat);
ValidateFieldOffset32(0x94, InputState, inputs_held_for_repeat);
ValidateFieldOffset32(0x114, InputState, hardware_inputs_held);
ValidateFieldOffset32(0x194, InputState, inputs_held);
ValidateFieldOffset32(0x214, InputState, __dword_214);
ValidateFieldOffset32(0x218, InputState, inputs_current);
ValidateFieldOffset32(0x21C, InputState, inputs_previous);
ValidateFieldOffset32(0x220, InputState, inputs_held_26_frames);
ValidateFieldOffset32(0x224, InputState, inputs_rising_edge);
ValidateFieldOffset32(0x228, InputState, inputs_falling_edge);
ValidateFieldOffset32(0x22C, InputState, hardware_inputs_held_8_frames);
ValidateFieldOffset32(0x230, InputState, inputs_held_8_frames);
ValidateFieldOffset32(0x234, InputState, __device_type);
ValidateFieldOffset32(0x238, InputState, joypad_mapping);
ValidateFieldOffset32(0x24C, InputState, xinput_mapping);
ValidateFieldOffset32(0x260, InputState, keyboard_mapping);
ValidateStructSize32(0x274, InputState);
#pragma endregion


extern "C" {
    // 0x4CA210
    extern InputState INPUT_STATES[3] asm("_INPUT_STATES");
}

// 0x42ABC0
dllexport gnu_noinline void __update_input0() asm_symbol_rel(0x42ABC0);
dllexport gnu_noinline void __update_input0() {
    INPUT_STATES[0].__update_input();
}

// 0x416B70
dllexport gnu_noinline BOOL stdcall __hardware_input0_pressed_or_held(uint32_t mask) asm_symbol_rel(0x416B70);
dllexport gnu_noinline BOOL stdcall __hardware_input0_pressed_or_held(uint32_t mask) {
    return INPUT_STATES[0].check_hardware_inputs_repeating(mask);
}

// size : 0x88
struct Config {
    int __dword_0; // 0x0
    InputMapping joypad_mapping; // 0x4
    InputMapping xinput_mapping; // 0x18
    InputMapping keyboard_mapping; // 0x2C
    int16_t deadzone_x; // 0x40
    int16_t deadzone_y; // 0x42
    uint8_t __ubyte_44; // 0x44
    uint8_t __ubyte_45; // 0x45
    uint8_t __ubyte_46; // 0x46
    uint8_t __ubyte_47; // 0x47
    uint8_t __ubyte_48; // 0x48
    uint8_t __ubyte_49; // 0x49
    int8_t __sbyte_4A; // 0x4A
    int8_t __sbyte_4B; // 0x4B
    char __byte_4C; // 0x4C
    char __byte_4D; // 0x4D
    uint8_t __ubyte_4E; // 0x4E
    unknown_fields(0x1); // 0x4F
    union {
        int32_t flags; // 0x50
        struct {
            int32_t __unknown_flag_B : 1; // 1
            int32_t reference_rasterizer : 1; // 2
            int32_t disable_fog : 1; // 3
            int32_t disable_direct_input : 1; // 4
            int32_t preload_bgm : 1; // 5
            int32_t disable_vsync : 1; // 6
            int32_t __disable_locale_detection : 1; // 7
            int32_t : 1; // 8
            int32_t __unknown_flag_A : 1; // 9
            int32_t __unknown_flag_C : 1; // 10
        };
    };
    int32_t window_x; // 0x54
    int32_t window_y; // 0x58
    unknown_fields(0x2C); // 0x5C
    
    inline void zero_contents() {
        zero_this();
    }
    
    // 0x444DD0
    dllexport gnu_noinline void initialize() asm_symbol_rel(0x444DD0) {
        this->zero_contents();
        this->__unknown_flag_A = true;
        this->__dword_0 = 0x180002;
        this->deadzone_x = 0x258;
        this->deadzone_y = 0x258;
        this->__ubyte_45 = 1;
        this->__ubyte_46 = 1;
        this->__ubyte_47 = 8;
        this->joypad_mapping = INPUT_STATES[0].joypad_mapping;
        this->xinput_mapping = INPUT_STATES[0].xinput_mapping;
        this->keyboard_mapping = INPUT_STATES[0].keyboard_mapping;
        this->__ubyte_49 = 2;
        this->__sbyte_4A = 0x64;
        this->__byte_4C = 0;
        this->__byte_4D = 2;
        this->__sbyte_4B = 50;
        this->window_x = INT32_MIN;
        this->window_y = INT32_MIN;
    }

    inline Config() {
        this->initialize();
    }
};
#pragma region // Config Validation
ValidateFieldOffset32(0x0, Config, __dword_0);
ValidateFieldOffset32(0x4, Config, joypad_mapping);
ValidateFieldOffset32(0x18, Config, xinput_mapping);
ValidateFieldOffset32(0x2C, Config, keyboard_mapping);
ValidateFieldOffset32(0x40, Config, deadzone_x);
ValidateFieldOffset32(0x42, Config, deadzone_y);
ValidateFieldOffset32(0x44, Config, __ubyte_44);
ValidateFieldOffset32(0x45, Config, __ubyte_45);
ValidateFieldOffset32(0x46, Config, __ubyte_46);
ValidateFieldOffset32(0x47, Config, __ubyte_47);
ValidateFieldOffset32(0x48, Config, __ubyte_48);
ValidateFieldOffset32(0x49, Config, __ubyte_49);
ValidateFieldOffset32(0x4A, Config, __sbyte_4A);
ValidateFieldOffset32(0x4B, Config, __sbyte_4B);
ValidateFieldOffset32(0x4C, Config, __byte_4C);
ValidateFieldOffset32(0x4D, Config, __byte_4D);
ValidateFieldOffset32(0x4E, Config, __ubyte_4E);
ValidateFieldOffset32(0x50, Config, flags);
ValidateFieldOffset32(0x54, Config, window_x);
ValidateFieldOffset32(0x58, Config, window_y);
ValidateStructSize32(0x88, Config);
#pragma endregion


// size: 0x1C
struct StageSky {
    float begin_distance; // 0x0
    float end_distance; // 0x4
    D3DCOLORVALUE color_components; // 0x8
    D3DCOLOR color; // 0x18

private:
    // 0x41F830
    dllexport gnu_noinline StageSky& add(StageSky& out, const StageSky& value) asm_symbol_rel(0x41F830) {
        out.begin_distance = this->begin_distance + value.begin_distance;
        out.begin_distance = this->begin_distance + value.end_distance;
        out.color_components.r = this->color_components.r + value.color_components.r;
        out.color_components.g = this->color_components.g + value.color_components.g;
        out.color_components.b = this->color_components.b + value.color_components.b;
        out.color_components.a = this->color_components.a + value.color_components.a;
        for (size_t i = 0; i < 4; ++i) {
            ((int8_t*)&out.color)[i] = ((float*)&out.color_components)[i];
        }
        return out;
    }
public:
    inline StageSky operator+(const StageSky& value) {
        StageSky dummy;
        return this->add(dummy, value);
    }

private:
    inline StageSky& sub(StageSky& out, const StageSky& value) {
        out.begin_distance = this->begin_distance - value.begin_distance;
        out.begin_distance = this->begin_distance - value.end_distance;
        out.color_components.r = this->color_components.r - value.color_components.r;
        out.color_components.g = this->color_components.g - value.color_components.g;
        out.color_components.b = this->color_components.b - value.color_components.b;
        out.color_components.a = this->color_components.a - value.color_components.a;
        for (size_t i = 0; i < 4; ++i) {
            ((int8_t*)&out.color)[i] = ((float*)&this->color_components)[i] - ((float*)&out.color_components)[i];
        }
        return out;
    }
public:
    inline StageSky operator-(const StageSky& value) {
        StageSky dummy;
        return this->sub(dummy, value);
    }

private:
    inline StageSky& mul(StageSky& out, const float value) {
        out.begin_distance = this->begin_distance * value;
        out.begin_distance = this->begin_distance * value;
        out.color_components.r = this->color_components.r * value;
        out.color_components.g = this->color_components.g * value;
        out.color_components.b = this->color_components.b * value;
        out.color_components.a = this->color_components.a * value;
        for (size_t i = 0; i < 4; ++i) {
            ((int8_t*)&out.color)[i] = ((float*)&this->color_components)[i] * value;
        }
        return out;
    }
public:
    inline StageSky operator*(const float value) {
        StageSky dummy;
        return this->mul(dummy, value);
    }
};
#pragma region // StageSky Validation
ValidateFieldOffset32(0x0, StageSky, begin_distance);
ValidateFieldOffset32(0x4, StageSky, end_distance);
ValidateFieldOffset32(0x8, StageSky, color_components);
ValidateFieldOffset32(0x18, StageSky, color);
ValidateStructSize32(0x1C, StageSky);
#pragma endregion

// size: 0x164
struct StageCamera {
    Float3 position; // 0x0
    Float3 facing; // 0xC
    Float3 rotation; // 0x18
    Float3 facing_normalized; // 0x24
    Float3 __float3_30; // 0x30
    Float3 __shaking_float3_A; // 0x3C
    Float3 __shaking_float3_B; // 0x48
    float fov; // 0x54
    Int2 window_resolution; // 0x58
    D3DMATRIXZ view_matrix; // 0x60
    D3DMATRIXZ projection_matrix; // 0xA0
    D3DVIEWPORT9 viewport; // 0xE0
    int32_t camera_index; // 0xF8
    Int2 __int2_FC; // 0xFC
    Int2 __int2_104; // 0x104
    D3DVIEWPORT9 __viewport_10C; // 0x10C
    D3DVIEWPORT9 __viewport_124; // 0x124
    Float3 __float3_13C; // 0x13C
    StageSky sky; // 0x148
    // 0x164

    inline void __copy_int2_FC_to_anm_manager();
};
#pragma region // StageCamera Validation
ValidateFieldOffset32(0x0, StageCamera, position);
ValidateFieldOffset32(0xC, StageCamera, facing);
ValidateFieldOffset32(0x18, StageCamera, rotation);
ValidateFieldOffset32(0x24, StageCamera, facing_normalized);
ValidateFieldOffset32(0x30, StageCamera, __float3_30);
ValidateFieldOffset32(0x3C, StageCamera, __shaking_float3_A);
ValidateFieldOffset32(0x48, StageCamera, __shaking_float3_B);
ValidateFieldOffset32(0x54, StageCamera, fov);
ValidateFieldOffset32(0x58, StageCamera, window_resolution);
ValidateFieldOffset32(0x60, StageCamera, view_matrix);
ValidateFieldOffset32(0xA0, StageCamera, projection_matrix);
ValidateFieldOffset32(0xE0, StageCamera, viewport);
ValidateFieldOffset32(0xF8, StageCamera, camera_index);
ValidateFieldOffset32(0xFC, StageCamera, __int2_FC);
ValidateFieldOffset32(0x104, StageCamera, __int2_104);
ValidateFieldOffset32(0x10C, StageCamera, __viewport_10C);
ValidateFieldOffset32(0x124, StageCamera, __viewport_124);
ValidateFieldOffset32(0x13C, StageCamera, __float3_13C);
ValidateFieldOffset32(0x148, StageCamera, sky);
ValidateStructSize32(0x164, StageCamera);
#pragma endregion

// size: 0x124
struct ScreenshotManager {
    BITMAPFILEHEADER bmp_header; // 0x0
    padding_bytes(0x2); // 0xE
    LPBITMAPINFOHEADER info_header; // 0x10
    unknown_fields(0x8); // 0x14
    int32_t __int_1C; // 0x1C
    char filename[MAX_PATH]; // 0x20
};
#pragma region // ScreenshotManager Validation
ValidateFieldOffset32(0x0, ScreenshotManager, bmp_header);
ValidateFieldOffset32(0x10, ScreenshotManager, info_header);
ValidateFieldOffset32(0x1C, ScreenshotManager, __int_1C);
ValidateFieldOffset32(0x20, ScreenshotManager, filename);
ValidateStructSize32(0x124, ScreenshotManager);
#pragma endregion

typedef struct AnmVM AnmVM;
typedef struct AnmLoaded AnmLoaded;

// size: 0x1C
struct ZUNThread {
    //void* vtable; // 0x0
    HANDLE thread; // 0x4
    uint32_t tid; // 0x8
    BOOL __bool_C; // 0xC
    BOOL __bool_10; // 0x10
    HMODULE* phModule; // 0x14
    _beginthreadex_proc_type start_func; // 0x18
    // 0x1C

    // 0x402B30
    // Might be destructor?
    dllexport gnu_noinline void stop_and_cleanup() asm_symbol_rel(0x402B30) {
        if (HANDLE thread_handle = this->thread) {
            this->__bool_C = true;
            this->__bool_10 = false;
            if (WaitForSingleObject(thread_handle, 200) == WAIT_TIMEOUT) {
                do {
                    this->__bool_C = true;
                    this->__bool_10 = false;
                    Sleep(1);
                } while (WaitForSingleObject(this->thread, 200) == WAIT_TIMEOUT);
            }
            CloseHandle(this->thread);
            this->thread = NULL;
            this->start_func = NULL;
        }
    }

    // 0x402BB0
    dllexport gnu_noinline void start(_beginthreadex_proc_type func, void* arg_list) asm_symbol_rel(0x402BB0) {
        this->stop_and_cleanup();
        this->start_func = func;
        this->__bool_10 = true;
        this->__bool_C = false;
        this->thread = (HANDLE)_beginthreadex(NULL, 0, func, arg_list, 0, &this->tid);
    }

    virtual ~ZUNThread() {
        this->stop_and_cleanup();
    }
};
#pragma region // ZUNThread Validation
//ValidateVirtualFieldOffset32(0x0, ZUNThread, vtable);
ValidateVirtualFieldOffset32(0x4, ZUNThread, thread);
ValidateVirtualFieldOffset32(0x8, ZUNThread, tid);
ValidateVirtualFieldOffset32(0xC, ZUNThread, __bool_C);
ValidateVirtualFieldOffset32(0x10, ZUNThread, __bool_10);
ValidateVirtualFieldOffset32(0x14, ZUNThread, phModule);
ValidateVirtualFieldOffset32(0x18, ZUNThread, start_func);
ValidateStructSize32(0x1C, ZUNThread);
#pragma endregion

// Couldn't figure out how to get the constructor right otherwise...
struct ZUNThreadB : ZUNThread {
    inline ZUNThreadB() {
        this->thread = NULL;
        this->tid = 0;
        this->__bool_C = FALSE;
        this->__bool_10 = FALSE;
    }
};

// size: 0x58
struct D3DThread : ZUNThread {
    unknown_fields(0x3C); // 0x1C
    // 0x58

    // 0x46FDD0
    virtual ~D3DThread() {

    }
};
#pragma region // D3DThread Validation
ValidateStructSize32(0x58, D3DThread);
#pragma endregion

extern "C" {
    // 0x4CD950
    extern D3DThread D3D_THREAD_A asm("_D3D_THREAD_A");
    // 0x4CDAE0
    extern ZUNThread UNKNOWN_THREAD_A asm("_UNKNOWN_THREAD_A");
}

// size: 0xC
struct ZUNTask {
    union {
        uint32_t task_flags; // 0x0
        struct {
            uint32_t : 1;
            uint32_t __unknown_task_flag_A : 1;
        };
    };
    UpdateFunc* on_tick_func; // 0x4
    UpdateFunc* on_draw_func; // 0x8
    // 0xC

    // 0x42A9A0
    dllexport void enable_funcs() {
        if (UpdateFunc* on_tick = this->on_tick_func) {
            on_tick->run_on_update = true;
        }
        if (UpdateFunc* on_draw = this->on_draw_func) {
            on_draw->run_on_update = true;
        }
    }

    inline BOOL on_tick_enabled() {
        UpdateFunc* on_tick = this->on_tick_func;
        if (on_tick && on_tick->run_on_update) {
            return TRUE;
        }
        return FALSE;
    }

    inline BOOL on_draw_enabled() {
        UpdateFunc* on_draw = this->on_draw_func;
        if (on_draw && on_draw->run_on_update) {
            return TRUE;
        }
        return FALSE;
    }
};

extern "C" {
    // 0x57095C
    extern size_t JOYPAD_INDEX asm("_JOYPAD_INDEX");
}

static constexpr LONG JOYPAD_MIN_RANGE = -1000;
static constexpr LONG JOYPAD_MAX_RANGE = 1000;

// size: 0x38
struct FpsCounter : ZUNTask {
    //ZUNTask base; // 0x0
    int __dword_C; // 0xC
    unknown_fields(0x10); // 0x10
    double __double_20; // 0x20
    double __double_28; // 0x28
    float __float_30; // 0x30
    unknown_fields(0x4); // 0x34
    // 0x38

    inline void zero_contents() {
        zero_this();
    }

    inline FpsCounter() {
        this->zero_contents();
        this->__unknown_task_flag_A = true;

    }

    inline float calc_slowdown_rate() {
        return 100.0f - (float)(this->__double_20 / this->__double_28) * 100.0f;
    }

    // 0x43A2D0
    dllexport gnu_noinline FpsCounter* stdcall destroy() asm_symbol_rel(0x43A2D0);
};

extern "C" {
    // 0x4CF2DC
    extern FpsCounter* FPS_COUNTER_PTR asm("_FPS_COUNTER_PTR");
    // 0x507644
}

// 0x43A2D0
dllexport gnu_noinline FpsCounter* stdcall FpsCounter::destroy() {
    UpdateFuncRegistry* update_func_registry = UPDATE_FUNC_REGISTRY_PTR;
    if (UpdateFunc* update_func = this->on_draw_func) {
        CRITICAL_SECTION_MANAGER.enter_section(UpdateFuncRegistry_CS);
        update_func_registry->delete_func(update_func);
        CRITICAL_SECTION_MANAGER.leave_section(UpdateFuncRegistry_CS);
    }
    FPS_COUNTER_PTR = NULL;
    delete this;
    return this;
}

static inline constexpr size_t msg_variant_count = 4;

// size: 0x28
struct StageDataInner {
    int32_t __spell_anm_indexA; // 0x0 (0x34)
    int32_t __spell_anm_scriptA; // 0x4 (0x38)
    int32_t __spell_flag_state; // 0x8 (0x3C)
    int32_t __spell_anm_indexB; // 0xC (0x40)
    int32_t __spell_anm_scriptB; // 0x10 (0x44)
    int32_t __intro_anm_index; // 0x14 (0x48)
    int32_t __intro_anm_script; // 0x18 (0x4C)
    int32_t __portrait_anm_file_index; // 0x1C (0x50)
    int32_t __portrait_anm_script; // 0x20 (0x54)
    unknown_fields(0x4); // 0x24
    // 0x28
};

// size: 0xD4
struct StageData {
    int32_t stage_number; // 0x0
    const char* std_filename; // 0x4
    const char* ecl_filename; // 0x8
    const char* __string_array_C[2]; // 0xC
    const char* msg_filenames[msg_variant_count]; // 0x14
    const char* logo_anm_filename; // 0x24
    unknown_fields(0x4); // 0x28
    int32_t music_index; // 0x2C
    unknown_fields(0x4); // 0x30
    StageDataInner innner[1]; // 0x34 this may actually be shifted up by 1 dword

    int32_t __anm_file_index_78; // 0x78
    int32_t __anm_script_7C; // 0x7C
    int32_t __anm_script_80; // 0x80
    // 0x84
};

extern "C" {
    // 0x4CF428
    extern StageData* STAGE_DATA_PTR asm("_STAGE_DATA_PTR");
}

typedef struct AnmManager AnmManager;

#define ANM_FULL_ID_BITS (32)
#define ANM_FAST_ID_BITS (15)
#define ANM_SLOW_ID_BITS (ANM_FULL_ID_BITS - ANM_FAST_ID_BITS)
#define INVALID_FAST_ID uint_width_max(ANM_FAST_ID_BITS)

// size: 0x4
union AnmID {
    uint32_t full;
    struct {
        uint32_t fast_id : ANM_FAST_ID_BITS;
        uint32_t slow_id : ANM_SLOW_ID_BITS;
    };

    inline constexpr AnmID() : full(0) {}

    inline constexpr AnmID(const AnmID& id) : full(id.full) {}

    template<typename T> requires(std::is_integral_v<T>)
    inline constexpr AnmID(const T& raw) : full(raw) {}

    // 0x488E30
    dllexport AnmVM* get_vm_ptr() asm_symbol_rel(0x488E30);

    inline int32_t run_vm();

    // 0x488E50
    dllexport void interrupt_tree(int32_t interrupt_index) asm_symbol_rel(0x488E50);

    // 0x488E70
    dllexport void __unknown_tree_set_J() asm_symbol_rel(0x488E70);

    inline void __unknown_tree_set_J(AnmManager* anm_manager);

    // 0x488EB0
    dllexport void __unknown_tree_clear_J() asm_symbol_rel(0x488EB0);

    // 0x488F50
    dllexport void mark_tree_for_delete() asm_symbol_rel(0x488F50);

    inline void mark_tree_for_delete(AnmManager* anm_manager);

    inline void set_position(Float3* position);

    // 0x488F70
    dllexport void thiscall set_controller_position(Float3* position) asm_symbol_rel(0x488F70);

    // 0x488FD0
    dllexport void thiscall __sub_488FD0(int32_t script) asm_symbol_rel(0x488FD0);

    // 0x4892F0
    dllexport void thiscall set_color1(D3DCOLOR color) asm_symbol_rel(0x4892F0);

    // 0x489230
    dllexport gnu_noinline AnmVM* thiscall __wtf_child_list_jank_A(int32_t script, uint32_t arg2) asm_symbol_rel(0x489230);

    inline constexpr operator uint32_t() const {
        return this->full;
    }
    template<typename T> requires(std::is_integral_v<T>)
    inline constexpr AnmID& operator=(const T& raw) {
        this->full = raw;
        return *this;
    }

    AnmID thiscall __sub_489140();
};
#pragma region // AnmID Validation
ValidateFieldOffset32(0x0, AnmID, full);
ValidateStructSize32(0x4, AnmID);
#pragma endregion

extern "C" {
    // 0x4C5F90
    extern int32_t ACHIEVEMENT_MODE_STATE asm("_ACHIEVEMENT_MODE_STATE");
}

// size: 0xB60
struct Supervisor {
    HINSTANCE current_instance; // 0x0
    LPDIRECT3D9 d3d; // 0x4
    LPDIRECT3DDEVICE9 d3d_device; // 0x8
    LPDIRECTINPUT8 dinput; // 0xC
    RECT window_rect; // 0x10
    LPDIRECTINPUTDEVICE8 keyboard_device; // 0x20;
    LPDIRECTINPUTDEVICE8 joypad_devices[1]; // 0x24;
    unknown_fields(0x4); // 0x28
    DIDEVCAPS __joypad_caps; // 0x2C
    HWND main_window_handle; // 0x58
    D3DMATRIXZ __view_matrix_5C; // 0x5C
    D3DMATRIXZ __projection_matrix_9C; // 0x9C
    D3DVIEWPORT9 __viewport_DC; // 0xDC
    D3DPRESENT_PARAMETERS present_parameters; // 0xF4
    unknown_fields(0x70); // 0x12C
    D3DDISPLAYMODE display_mode; // 0x19C
    LPDIRECT3DSURFACE9 __surface_1AC; // 0x1AC
    LPDIRECT3DSURFACE9 __surface_1B0; // 0x1B0
    LPDIRECT3DSURFACE9 back_buffer; // 0x1B4
    unknown_fields(0x4); // 0x1B8
    AnmVM* __arcade_vm_ptr_A; // 0x1BC
    AnmVM* __arcade_vm_ptr_B; // 0x1C0
    AnmVM* __arcade_vm_ptr_C; // 0x1C4
    AnmVM* __arcade_vm_ptr_D; // 0x1C8
    unknown_fields(0x4); // 0x1CC
    AnmID __vm_id_1D0; // 0x1D0
    Config config; // 0x1D4
    StageCamera cameras[4]; // 0x25C
    StageCamera* current_camera_ptr; // 0x7EC
    int32_t current_camera_index; // 0x7F0
    int32_t gamemode_current; // 0x7F4
    int32_t gamemode_switch; // 0x7F8
    int32_t gamemode_previous; // 0x7FC
    int __dword_800; // 0x800
    int32_t __int_804; // 0x804
    unknown_fields(0x10); // 0x808
    int __int_818; // 0x818
    unknown_fields(0x4); // 0x81C
    BOOL disable_vsync; // 0x820
    int __dword_824; // 0x824
    int __dword_828; // 0x828
    AnmLoaded* text_anm; // 0x82C
    unknown_fields(0x4); // 0x830
    union {
        uint32_t flags; // 0x834
        struct {
            uint32_t __unknown_flag_D : 1; // 1
            uint32_t __unknown_flag_C : 1; // 2
            uint32_t __unknown_flag_E : 1; // 3
            uint32_t : 1; // 4
            uint32_t __unknown_flag_F : 1; // 5
            uint32_t : 1; // 6
            uint32_t __unknown_flag_A : 1; // 7
            uint32_t __unknown_bitfield_A : 2; // 8-9
            uint32_t : 4; // 10-13
            uint32_t __unknown_flag_B : 1; // 14
        };
    };
    uint32_t initial_rng_seed; // 0x838
    unknown_fields(0x4); // 0x83C
    D3DCAPS9 d3dcaps; // 0x840
    ScreenshotManager screenshot_manager; // 0x970
    ZUNThread __thread_A94; // 0xA94
    ZUNThread __thread_AB0; // 0xAB0
    unknown_fields(0x4); // 0xACC
    int32_t __int_AD0; // 0xAD0
    unknown_fields(0x54); // 0xAD4
    BOOL fog_enabled; // 0xB28
    BOOL zwrite_enabled; // 0xB2C
    int32_t game_exe_checksum; // 0xB30
    int32_t game_exe_file_size; // 0xB34
    int32_t ver_file_size; // 0xB38
    void* ver_file_buffer; // 0xB3C
    unknown_fields(0x10); // 0xB40
    double __double_B50; // 0xB50
    D3DCOLOR background_color; // 0xB58
    probably_padding_bytes(0x4); // 0xB5C
    // 0xB60

    // 0x456180
    dllexport static gnu_noinline void __release_rendering_surfaces() asm_symbol_rel(0x456180);
    
    // 0x453460
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_tick_A(void* self) asm_symbol_rel(0x453460) {

    }

    // 0x4553B0
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_A(void* self) asm_symbol_rel(0x4553B0) {

    }

    // 0x455610
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_B(void* self) asm_symbol_rel(0x455610) {

    }

    // 0x455530
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_C(void* self) asm_symbol_rel(0x455530) {

    }

    // 0x455A70
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_D(void* self) asm_symbol_rel(0x455A70) {

    }

    // 0x4559A0
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_E(void* self) asm_symbol_rel(0x4559A0) {

    }
    
    // 0x455BC0
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_F(void* self) asm_symbol_rel(0x455BC0) {

    }

    // 0x455B10
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_G(void* self) asm_symbol_rel(0x455B10) {

    }

    // 0x455CF0
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_H(void* self) asm_symbol_rel(0x455CF0) {

    }

    // 0x455C90
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_I(void* self) asm_symbol_rel(0x455C90) {

    }

    // 0x455D40
    dllexport static gnu_noinline UpdateFuncRet fastcall __unknown_on_draw_J(void* self) asm_symbol_rel(0x455D40) {

    }

    // 0x453640
    dllexport static gnu_noinline ZUNResult fastcall on_registration(void* self) asm_symbol_rel(0x453640);
    
    // 0x453DB0
    dllexport static gnu_noinline ZUNResult initialize() asm_symbol_rel(0x453DB0);

    // 0x4543A0
    dllexport gnu_noinline ZUNResult thiscall load_config_file(int) asm_symbol_rel(0x4543A0);

    // 0x454760
    dllexport HRESULT thiscall d3d_enable_fog() asm_symbol_rel(0x454760);

    // 0x4547A0
    dllexport HRESULT thiscall d3d_disable_fog() asm_symbol_rel(0x4547A0);

    // 0x4547E0
    dllexport HRESULT thiscall d3d_enable_zwrite() asm_symbol_rel(0x4547E0);

    // 0x454820
    dllexport HRESULT thiscall d3d_disable_zwrite() asm_symbol_rel(0x454820);

private:
    // 0x454860
    dllexport static gnu_noinline int32_t stdcall __start_thread_A94(_beginthreadex_proc_type func, int) asm_symbol_rel(0x454860);
public:
    inline static int32_t __start_thread_A94(_beginthreadex_proc_type func) {
        return __start_thread_A94(func, UNUSED_DWORD);
    }

    // 0x4548E0
    dllexport static gnu_noinline void stdcall __sub_4548E0(StageCamera* camera) asm_symbol_rel(0x4548E0);

    // 0x454950
    dllexport static gnu_noinline void stdcall __sub_454950(StageCamera* camera) asm_symbol_rel(0x454950) {
        uint32_t height = camera->viewport.Height;
        float x = (float)camera->viewport.X + (float)camera->viewport.Width * 0.5f;
        float viewport_height = (float)height;
        height /= 2;
        float y = (float)camera->viewport.Y + viewport_height * 0.5f;
        float eye_z = (float)height / ztanf(camera->fov * 0.5f);
        D3DXVECTOR3 eye;
        D3DXVECTOR3 at;
        D3DXVECTOR3 up;
        up.x = 0.0f;
        up.y = -1.0f;
        up.z = 0.0f;
        eye.z = eye_z;
        eye.x = x;
        eye.y = y;
        at.x = x;
        at.y = y;
        at.z = 0.0f;
        D3DXMatrixLookAtLH((D3DXMATRIX*)&camera->view_matrix, &eye, &at, &up);
        float aspect = (float)camera->viewport.Width / (float)camera->viewport.Height;
        D3DXMatrixPerspectiveFovLH((D3DXMATRIX*)&camera->projection_matrix, camera->fov, aspect, 1.0f, 10000.0f);
    }

    // 0x454B20
    dllexport gnu_noinline void thiscall __initialize_cameras() asm_symbol_rel(0x454B20);

    // 0x454F50
    dllexport static gnu_noinline void __camera2_sub_454F50() asm_symbol_rel(0x454F50);

    // 0x41B330
    dllexport void thiscall set_camera_by_index(uint32_t index) asm_symbol_rel(0x41B330);
    // 0x41B3B0
    dllexport static gnu_noinline void stdcall set_camera2_alt(uint32_t = UNUSED_DWORD) asm_symbol_rel(0x41B3B0);

    inline void thiscall set_camera_by_index_disable_fog(uint32_t index);
    inline void thiscall set_camera_by_index_disable_zwrite(uint32_t index);
};
#pragma region // Supervisor Validation
ValidateFieldOffset32(0x0, Supervisor, current_instance);
ValidateFieldOffset32(0x4, Supervisor, d3d);
ValidateFieldOffset32(0x8, Supervisor, d3d_device);
ValidateFieldOffset32(0xC, Supervisor, dinput);
ValidateFieldOffset32(0x10, Supervisor, window_rect);
ValidateFieldOffset32(0x20, Supervisor, keyboard_device);
ValidateFieldOffset32(0x24, Supervisor, joypad_devices);
ValidateFieldOffset32(0x2C, Supervisor, __joypad_caps);
ValidateFieldOffset32(0x58, Supervisor, main_window_handle);
ValidateFieldOffset32(0x5C, Supervisor, __view_matrix_5C);
ValidateFieldOffset32(0x9C, Supervisor, __projection_matrix_9C);
ValidateFieldOffset32(0xDC, Supervisor, __viewport_DC);
ValidateFieldOffset32(0xF4, Supervisor, present_parameters);
ValidateFieldOffset32(0x19C, Supervisor, display_mode);
ValidateFieldOffset32(0x1AC, Supervisor, __surface_1AC);
ValidateFieldOffset32(0x1B0, Supervisor, __surface_1B0);
ValidateFieldOffset32(0x1B4, Supervisor, back_buffer);
ValidateFieldOffset32(0x1BC, Supervisor, __arcade_vm_ptr_A);
ValidateFieldOffset32(0x1C0, Supervisor, __arcade_vm_ptr_B);
ValidateFieldOffset32(0x1C4, Supervisor, __arcade_vm_ptr_C);
ValidateFieldOffset32(0x1C8, Supervisor, __arcade_vm_ptr_D);
ValidateFieldOffset32(0x1D0, Supervisor, __vm_id_1D0);
ValidateFieldOffset32(0x1D4, Supervisor, config);
ValidateFieldOffset32(0x25C, Supervisor, cameras);
ValidateFieldOffset32(0x7EC, Supervisor, current_camera_ptr);
ValidateFieldOffset32(0x7F0, Supervisor, current_camera_index);
ValidateFieldOffset32(0x7F4, Supervisor, gamemode_current);
ValidateFieldOffset32(0x7F8, Supervisor, gamemode_switch);
ValidateFieldOffset32(0x7FC, Supervisor, gamemode_previous);
ValidateFieldOffset32(0x800, Supervisor, __dword_800);
ValidateFieldOffset32(0x804, Supervisor, __int_804);
ValidateFieldOffset32(0x818, Supervisor, __int_818);
ValidateFieldOffset32(0x820, Supervisor, disable_vsync);
ValidateFieldOffset32(0x824, Supervisor, __dword_824);
ValidateFieldOffset32(0x828, Supervisor, __dword_828);
ValidateFieldOffset32(0x82C, Supervisor, text_anm);
ValidateFieldOffset32(0x834, Supervisor, flags);
ValidateFieldOffset32(0x838, Supervisor, initial_rng_seed);
ValidateFieldOffset32(0x840, Supervisor, d3dcaps);
ValidateFieldOffset32(0x970, Supervisor, screenshot_manager);
ValidateFieldOffset32(0xA94, Supervisor, __thread_A94);
ValidateFieldOffset32(0xAB0, Supervisor, __thread_AB0);
ValidateFieldOffset32(0xAD0, Supervisor, __int_AD0);
ValidateFieldOffset32(0xB28, Supervisor, fog_enabled);
ValidateFieldOffset32(0xB2C, Supervisor, zwrite_enabled);
ValidateFieldOffset32(0xB30, Supervisor, game_exe_checksum);
ValidateFieldOffset32(0xB34, Supervisor, game_exe_file_size);
ValidateFieldOffset32(0xB38, Supervisor, ver_file_size);
ValidateFieldOffset32(0xB3C, Supervisor, ver_file_buffer);
ValidateFieldOffset32(0xB50, Supervisor, __double_B50);
ValidateFieldOffset32(0xB58, Supervisor, background_color);
ValidateStructSize32(0xB60, Supervisor);
#pragma endregion

extern "C" {
    // 0x4CCDF0
    extern Supervisor SUPERVISOR asm("_SUPERVISOR");
}

// 0x456180
dllexport gnu_noinline void Supervisor::__release_rendering_surfaces() {
    SAFE_RELEASE(SUPERVISOR.__surface_1AC);
    SAFE_RELEASE(SUPERVISOR.__surface_1B0);
    SAFE_RELEASE(SUPERVISOR.back_buffer);
    SUPERVISOR.__surface_1AC = NULL; // why tho
}

// 0x453DB0
dllexport gnu_noinline ZUNResult Supervisor::initialize() {
    SUPERVISOR.gamemode_current = -2;
    SUPERVISOR.gamemode_switch = 0;
    SUPERVISOR.__dword_800 = 0;
    UpdateFunc* update_func = new UpdateFunc(&Supervisor::__unknown_on_tick_A, true, &SUPERVISOR);
    update_func->on_init_func = &Supervisor::on_registration;
    ZUNResult ret = UpdateFuncRegistry::register_on_tick(update_func, 1);
    if (ZUN_SUCCEEDED(ret)) {
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_A, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 1);
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_B, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 14);
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_C, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 15);
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_D, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 25);
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_E, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 26);
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_F, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 44);
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_G, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 45);
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_H, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 58);
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_I, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 59);
        update_func = new UpdateFunc(&Supervisor::__unknown_on_draw_J, true, &SUPERVISOR);
        UpdateFuncRegistry::register_on_draw(update_func, 92);
        SUPERVISOR.d3d_device->GetBackBuffer(0, 0, D3DBACKBUFFER_TYPE_MONO, &SUPERVISOR.back_buffer);
        ret = ZUN_SUCCESS;
    }
    return ret;
}

// 0x454860
dllexport gnu_noinline int32_t Supervisor::__start_thread_A94(_beginthreadex_proc_type func, int) {
    CRITICAL_SECTION_MANAGER.enter_section(__supervisor_thread_cs_1);
    {
        clang_forceinline SUPERVISOR.__thread_A94.start(func, NULL);
    }
    CRITICAL_SECTION_MANAGER.leave_section(__supervisor_thread_cs_1);
    return 0;
}

inline uint32_t InputState::get_joypad(uint32_t buttons) {
    uint32_t prev_buttons = buttons;
    if (SUPERVISOR.joypad_devices[0]) {
        if (FAILED(SUPERVISOR.joypad_devices[0]->Poll())) {
            for (size_t i = 0; i < 400; ++i) {
                // This isn't even listed as a valid return value in the docs?
                if (SUPERVISOR.joypad_devices[0]->Acquire() != DIERR_INPUTLOST) {
                    break;
                }
            }
        }
        else {
            DIJOYSTATE2 state = {};
            if (SUCCEEDED(SUPERVISOR.joypad_devices[0]->GetDeviceState(sizeof(state), &state))) {
                // This code is mangled AF to the point that no sane compiler will ever
                // output it, so I'm not even going to attempt to match the codegen.

                int32_t mapping;

                mapping = this->joypad_mapping.shoot;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_SHOOT;
                }

                mapping = this->joypad_mapping.bomb;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_BOMB;
                }

                mapping = this->joypad_mapping.pause;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_PAUSE;
                }

                mapping = this->joypad_mapping.focus;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_FOCUS;
                }

                mapping = this->joypad_mapping.use_card;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_USE_CARD;
                }

                mapping = this->joypad_mapping.switch_card;
                if (mapping >= 0 && (int8_t)state.rgbButtons[mapping] < 0) {
                    buttons |= BUTTON_SWITCH_CARD;
                }

                uint32_t axes = 0;

                int32_t deadzone_x = SUPERVISOR.config.deadzone_x;
                int32_t deadzone_y = SUPERVISOR.config.deadzone_y;

                if (state.lX < -deadzone_x) {
                    axes |= BUTTON_LEFT;
                }
                if (state.lY < -deadzone_y) {
                    axes |= BUTTON_UP;
                }
                if (state.lX > deadzone_x) {
                    axes |= BUTTON_RIGHT;
                }
                if (state.lY > SUPERVISOR.config.deadzone_y) {
                    axes |= BUTTON_DOWN;
                }

                buttons |= axes;

                if (buttons != prev_buttons) {
                    this->__device_type = InputJoypad;
                }
            }
        }
    }
    return buttons;
}

static inline constexpr size_t CHARACTER_COUNT = 4;
static inline constexpr size_t SHOTTYPES_PER_CHARACTER = 1;
static inline constexpr size_t SHOTTYPE_COUNT = CHARACTER_COUNT * SHOTTYPES_PER_CHARACTER;
static inline constexpr size_t DIFFICULTY_COUNT = 6;
static inline constexpr int32_t STAGE_COUNT = 8;

static inline constexpr int32_t RANK_BOUND = 1024;
static inline constexpr int32_t MAX_RANK = +RANK_BOUND; // 1024
static inline constexpr int32_t MIN_RANK = -RANK_BOUND; // -1024
static inline constexpr int32_t RANK_RANGE = RANK_BOUND * 2; // 2048

// This is used as an index into the scorefile section B array
static inline constexpr size_t SCOREFILE_TOTALS = SHOTTYPE_COUNT;

static inline void __update_bomb_ui();

// size: 0xFC
struct Globals {
    int32_t current_stage; // 0x0
    int32_t __stage_number_related_4; // 0x4
    int32_t chapter; // 0x8
    int32_t __counter_C; // 0xC (Sound related?)
    int32_t __counter_10; // 0x10 (Sound related?)
    int32_t __counter_14; // 0x14 (Sound related?)
    int32_t character; // 0x18
    int32_t shottype; // 0x1C
    int32_t score; // 0x20
    int32_t difficulty; // 0x24
    int32_t continues; // 0x28
    int32_t rank; // 0x2C
    int32_t graze_in_stage; // 0x30
    int32_t graze; // 0x34
    int32_t __ecl_var_9907; // 0x38
    int32_t miss_count_in_game; // 0x3C
    int __dword_40; // 0x40 (Maybe point_items_collected_in_stage?)
    int32_t point_items_collected_in_game; // 0x44
    int32_t point_item_value; // 0x48
    int32_t min_point_item_value; // 0x4C
    int32_t max_point_item_value; // 0x50
    int32_t money_collected_in_game; // 0x54
    int32_t current_money; // 0x58
    int32_t current_power; // 0x5C
    int32_t max_power; // 0x60
    int32_t power_per_level; // 0x64
    int __dword_68; // 0x68
    int32_t life_stocks; // 0x6C
    int32_t life_fragments; // 0x70
    int32_t lives_added; // 0x74
    int32_t life_stock_max; // 0x78
    int32_t bomb_stocks; // 0x7C
    int32_t bomb_fragments; // 0x80
    int32_t bomb_stocks_for_new_life; // 0x84
    int32_t bomb_stock_max; // 0x88
    int32_t __int_8C; // 0x8C
    int32_t __int_90; // 0x90
    int __dword_94; // 0x94
    int __dword_98; // 0x98
    int __dword_9C; // 0x9C
    int __dword_A0; // 0xA0
    int __dword_A4; // 0xA4
    int __dword_A8; // 0xA8
    int __dword_AC; // 0xAC
    int __dword_B0; // 0xB0
    int __dword_B4; // 0xB4
    int __dword_B8; // 0xB8
    int __dword_BC; // 0xBC
    int __dword_C0; // 0xC0
    Timer __timer_C4; // 0xC4
    Timer __timer_D8; // 0xD8
    int __dword_EC; // 0xEC
    int __dword_F0; // 0xF0
    int __dword_F4; // 0xF4
    union {
        uint32_t flags; // 0xF8
        struct {
            uint32_t : 4; // 1-4
            uint32_t __unknown_field_A : 2; // 5-6
            uint32_t : 5; // 7-11
            uint32_t __unknown_flag_A : 1; // 12
        };
    };
    // 0xFC

    inline int32_t shottype_index() const {
        return this->character + this->shottype * SHOTTYPES_PER_CHARACTER;
    }

    // 0x417A60
    dllexport gnu_noinline Globals& thiscall operator=(const Globals& rhs) {
        this->current_stage = rhs.current_stage;
        this->__stage_number_related_4 = rhs.__stage_number_related_4;
        this->chapter = rhs.chapter;
        this->__counter_C = rhs.__counter_C;
        this->__counter_10 = rhs.__counter_10;
        this->__counter_14 = rhs.__counter_14;
        this->character = rhs.character;
        this->shottype = rhs.shottype;
        this->score = rhs.score;
        this->difficulty = rhs.difficulty;
        this->continues = rhs.continues;
        this->rank = rhs.rank;
        this->graze_in_stage = rhs.graze_in_stage;
        this->graze = rhs.graze;
        this->__ecl_var_9907 = rhs.__ecl_var_9907;
        this->miss_count_in_game = rhs.miss_count_in_game;
        this->__dword_40 = rhs.__dword_40;
        this->point_items_collected_in_game = rhs.point_items_collected_in_game;
        this->point_item_value = rhs.point_item_value;
        this->min_point_item_value = rhs.min_point_item_value;
        this->max_point_item_value = rhs.max_point_item_value;
        this->money_collected_in_game = rhs.money_collected_in_game;
        this->current_money = rhs.current_money;
        this->current_power = rhs.current_power;
        this->max_power = rhs.max_power;
        this->power_per_level = rhs.power_per_level;
        this->__dword_68 = rhs.__dword_68;
        this->life_stocks = rhs.life_stocks;
        this->life_fragments = rhs.life_fragments;
        this->lives_added = rhs.lives_added;
        this->life_stock_max = rhs.life_stock_max;
        this->bomb_stocks = rhs.bomb_stocks;
        this->bomb_fragments = rhs.bomb_fragments;
        this->bomb_stocks_for_new_life = rhs.bomb_stocks_for_new_life;
        this->bomb_stock_max = rhs.bomb_stock_max;
        this->__int_8C = rhs.__int_8C;
        this->__int_90 = rhs.__int_90;
        this->__dword_94 = rhs.__dword_94;
        this->__dword_98 = rhs.__dword_98;
        this->__dword_9C = rhs.__dword_9C;
        this->__dword_A0 = rhs.__dword_A0;
        this->__dword_A4 = rhs.__dword_A4;
        this->__dword_A8 = rhs.__dword_A8;
        this->__dword_AC = rhs.__dword_AC;
        this->__dword_B0 = rhs.__dword_B0;
        this->__dword_B4 = rhs.__dword_B4;
        this->__dword_B8 = rhs.__dword_B8;
        this->__dword_BC = rhs.__dword_BC;
        this->__dword_C0 = rhs.__dword_C0;
        this->__timer_C4.set_from_timer(rhs.__timer_C4);
        this->__timer_D8.set_from_timer(rhs.__timer_D8);
        this->__dword_EC = rhs.__dword_EC;
        this->__dword_F0 = rhs.__dword_F0;
        this->__dword_F4 = rhs.__dword_F4;
        this->flags = rhs.flags;
        return *this;
    }

    // 0x412FA0
    dllexport gnu_noinline void thiscall set_power(int32_t value) asm_symbol_rel(0x412FA0) {
        this->current_power = value;
        int32_t power = this->max_power;
        if (value <= power) {
            power = __max(power, this->power_per_level); // Effectively clamps to level 1 power
        }
        this->current_power = power;
    }

    // 0x42A970
    dllexport gnu_noinline void thiscall __set_unknown_flag_A(int32_t value) asm_symbol_rel(0x42A970) {
        this->__unknown_flag_A = value;
    }

    // 0x439EA0
    dllexport gnu_noinline int32_t thiscall get_rank() asm_symbol_rel(0x439EA0) {
        return this->rank;
    }

    template <typename T>
    inline T rank_lerp(const T& min_val, const T& max_val) {
        int32_t rank = this->get_rank();
        return min_val + ((rank + (T)RANK_BOUND) * (max_val - min_val)) / (T)RANK_RANGE;
    }

    // 0x439EB0
    dllexport gnu_noinline void thiscall __add_to_int_90(int32_t value) asm_symbol_rel(0x439EB0) {
        this->__int_90 += value;
    }

    // 00439EC0
    dllexport gnu_noinline void thiscall __add_to_int_8C(int32_t value) asm_symbol_rel(0x439EC0) {
        this->__int_8C += value;
    }

    // 0x4573F0
    dllexport gnu_noinline BOOL thiscall __add_power(int32_t value) asm_symbol_rel(0x4573F0);

private:
    // 0x457690
    dllexport gnu_noinline void thiscall add_bombs(int32_t) asm_symbol_rel(0x457690) {
        this->bomb_stocks += 1;
        int32_t max_bombs = this->bomb_stock_max;
        if (this->bomb_stocks >= max_bombs) {
            this->bomb_fragments = 0;
            if (this->bomb_stocks > max_bombs) {
                this->bomb_stocks = max_bombs;
            }
        }
        else {
            //SOUND_MANAGER.play_sound(46);
        }
        __update_bomb_ui();
    }
public:
    inline void add_bomb() {
        return this->add_bombs(UNUSED_DWORD);
    }

private:
    // 0x4576E0
    dllexport gnu_noinline void thiscall add_bomb_fragments(int32_t) asm_symbol_rel(0x4576E0) {
        if (this->bomb_stocks >= this->bomb_stock_max) {
            this->bomb_fragments = 0;
            return;
        }
        this->bomb_fragments += 1;
        if (this->bomb_fragments >= 3) {
            this->bomb_fragments = 0;
            this->add_bomb();
        }
        __update_bomb_ui();
    }
public:
    inline void add_bomb_fragment() {
        return this->add_bomb_fragments(UNUSED_DWORD);
    }

    // 0x457480
    dllexport gnu_noinline BOOL thiscall subtract_power(int32_t amount) asm_symbol_rel(0x457480) {
        int32_t power = this->current_power;
        int32_t min_power = this->power_per_level;
        if (power <= min_power) {
            return false;
        }
        power -= amount;
        this->current_power = power;
        if (power < min_power) {
            this->current_power = min_power;
            power = min_power;
        }

        int32_t prev_level = (power + amount) / min_power;
        int32_t new_level = power / min_power;
        return prev_level != new_level;
    }

    // 0x4574D0
    dllexport gnu_noinline void thiscall __subtract_bomb() asm_symbol_rel(0x4574D0) {
        if (--this->bomb_stocks < 0) {
            this->bomb_stocks = 0;
        }
        int32_t max_bombs = this->bomb_stock_max;
        if (this->bomb_stocks > max_bombs) {
            this->bomb_stocks = max_bombs;
        }
        __update_bomb_ui();
    }

    inline void add_graze() {
        int32_t stage_graze = this->graze_in_stage;
        int32_t total_graze = this->graze;
        ++stage_graze;
        ++total_graze;
        this->graze_in_stage = __min(stage_graze, 99999999);
        this->graze = __min(total_graze, 99999999);
    }
};

// 0x130
struct GameManager {
    int32_t __high_score; // 0x0
    int32_t __high_score_continues; // 0x4
    union {
        uint32_t flags; // 0x8
        struct {
            uint32_t __unknown_flag_A : 1; // 1
            uint32_t __unknown_flag_B : 1; // 2
            uint32_t __unknown_flag_C : 1; // 3
            uint32_t __unknown_flag_D : 1; // 4
            uint32_t __unknown_field_A : 2; // 5-6
            uint32_t __unknown_flag_E : 1; // 7
        };
    };
    int32_t __int_C; // 0xC
    int32_t continue_credits; // 0x10
    int32_t __int_14; // 0x14
    int32_t __int_18; // 0x18
    Globals globals; // 0x1C
    int32_t __int_118; // 0x118
    probably_padding_bytes(0x4); // 0x11C
    double game_time_double; // 0x120
    int __dword_128; // 0x128
    probably_padding_bytes(0x4); // 0x12C
    // 0x130

    // 0x406AA0
    dllexport gnu_noinline int32_t thiscall get_chapter() asm_symbol_rel(0x406AA0) {
        return this->globals.chapter;
    }

    // 0x418D60
    dllexport gnu_noinline int32_t thiscall get_current_stage() asm_symbol_rel(0x418D60) {
        return this->globals.current_stage;
    }

    // 0x42A990
    dllexport bool thiscall __unknown_field_A_is_2() asm_symbol_rel(0x42A990) {
        return this->__unknown_field_A == 2;
    }

    // 0x42AA20
    dllexport gnu_noinline int32_t thiscall get_difficulty() asm_symbol_rel(0x42AA20) {
        return this->globals.difficulty;
    }

    // 0x4630B0
    dllexport gnu_noinline void __set_unknown_field_A(int32_t value) asm_symbol_rel(0x4630B0) {
        if (this->__unknown_field_A != 2) {
            this->globals.__ecl_var_9907 = -1;
        }
        this->__unknown_field_A = value;
    }

    inline void add_to_score(uint32_t value) {
        uint32_t new_score = this->globals.score + value / 10;
        if (new_score > 1000000000) {
            new_score = 999999999;
        }
        this->globals.score = new_score;
    }
};

extern "C" {
    // 0x4CCCC0
    extern GameManager GAME_MANAGER asm("_GAME_MANAGER");
}

// size: 0x2108
struct WindowData {
    HWND window; // 0x0
    HWND resolution_dialogue; // 0x4
    int __dword_8; // 0x8
    HINSTANCE current_instance; // 0xC
    BOOL window_active; // 0x10
    int __dword_14; // 0x14
    int __dword_18; // 0x18
    int8_t __sbyte_1C; // 0x1C
    probably_padding_bytes(0x3); // 0x1D
    LARGE_INTEGER performance_counter_frequency; // 0x20
    LARGE_INTEGER startup_qpc_value; // 0x28
    bool __bool_30; // 0x30
    char appdata_path[0x1000]; // 0x31
    char exe_path[0x1000]; // 0x1031
    probably_padding_bytes(0x3); // 0x2031
    BOOL screen_saver_active; // 0x2034
    BOOL screen_saver_low_power_active; // 0x2038
    BOOL screen_saver_power_off_active; // 0x203C
    union {
        uint32_t flags; // 0x2040
        struct {
            uint32_t __unknown_flag_A : 1; // 1
            uint32_t __unknown_flag_B : 1; // 2
            uint32_t __unknown_bitfield_A : 5; // 3-7
            uint32_t __unknown_flag_C : 1; // 8
            uint32_t __unknown_bitfield_B : 2; // 9-10
        };
    };
    uint32_t __counter_2044; // 0x2044
    unknown_fields(0x8); // 0x2048
    int32_t __int_2050; // 0x2050 scaled_width
    int32_t __int_2054; // 0x2054 scaled_height
    int32_t window_width; // 0x2058
    int32_t window_height; // 0x205C
    int __dword_2060; // 0x2060 display_width
    int __dword_2064; // 0x2064 display_height
    int32_t __int_2068; // 0x2068 backbuffer_width
    int32_t __int_206C; // 0x206C backbuffer_height
    float __float_2070; // 0x2070 game_scale
    int32_t __int_2074; // 0x2074
    int32_t __int_2078; // 0x2078
    int32_t __int_207C; // 0x207C
    int32_t __int_2080; // 0x2080
    int32_t __int_2084; // 0x2084
    int32_t __int_2088; // 0x2088
    int32_t __int_208C; // 0x208C
    int32_t __int_2090; // 0x2090
    probably_padding_bytes(0x4); // 0x2094
    double __double_2098; // 0x2098
    double __double_20A0; // 0x20A0
    double __double_20A8; // 0x20A8
    double __double_20B0; // 0x20B0
    double __double_20B8; // 0x20B8
    double __double_20C0; // 0x20C0
    unknown_fields(0x4); // 0x20C8
    int __dword_20CC; // 0x20CC
    int __int_20D0; // 0x20D0
    int __dword_array_20D4[12]; // 0x20D4 (This might be an array of 4 Int3...?)
    probably_padding_bytes(0x4); // 0x2104
    // 0x2108

    // 0x4726A0
    dllexport gnu_noinline ZUNResult __save_properties_and_configure_paths() asm_symbol_rel(0x4726A0);

    template <typename L>
    inline int32_t update_window_common(const L& lambda);
    
    // 0x472DD0
    dllexport gnu_noinline int32_t thiscall update_window__normal_version() asm_symbol_rel(0x472DD0);

    // 0x472FD0
    dllexport gnu_noinline int32_t thiscall update_window__alt_version() asm_symbol_rel(0x472FD0);

    inline int32_t thiscall update_window__alt_version2();
    
    // 0x4734E0
    dllexport gnu_noinline void __sub_4734E0(int arg1) asm_symbol_rel(0x4734E0);
    
    // 0x473890
    dllexport gnu_noinline BOOL __create_window(HINSTANCE instance) asm_symbol_rel(0x473890);

    // 0x472B50
    dllexport gnu_noinline void thiscall __sub_472B50() asm_symbol_rel(0x472B50);

    // 0x4731B0
    dllexport gnu_noinline void thiscall __sub_4731B0() asm_symbol_rel(0x4731B0);
};
#pragma region // WindowData Verification
ValidateFieldOffset32(0x0, WindowData, window);
ValidateFieldOffset32(0x4, WindowData, resolution_dialogue);
ValidateFieldOffset32(0x8, WindowData, __dword_8);
ValidateFieldOffset32(0xC, WindowData, current_instance);
ValidateFieldOffset32(0x10, WindowData, window_active);
ValidateFieldOffset32(0x14, WindowData, __dword_14);
ValidateFieldOffset32(0x18, WindowData, __dword_18);
ValidateFieldOffset32(0x1C, WindowData, __sbyte_1C);
ValidateFieldOffset32(0x20, WindowData, performance_counter_frequency);
ValidateFieldOffset32(0x28, WindowData, startup_qpc_value);
ValidateFieldOffset32(0x30, WindowData, __bool_30);
ValidateFieldOffset32(0x31, WindowData, appdata_path);
ValidateFieldOffset32(0x1031, WindowData, exe_path);
ValidateFieldOffset32(0x2034, WindowData, screen_saver_active);
ValidateFieldOffset32(0x2038, WindowData, screen_saver_low_power_active);
ValidateFieldOffset32(0x203C, WindowData, screen_saver_power_off_active);
ValidateFieldOffset32(0x2040, WindowData, flags);
ValidateFieldOffset32(0x2044, WindowData, __counter_2044);

ValidateFieldOffset32(0x2050, WindowData, __int_2050);
ValidateFieldOffset32(0x2054, WindowData, __int_2054);
ValidateFieldOffset32(0x2058, WindowData, window_width);
ValidateFieldOffset32(0x205C, WindowData, window_height);
ValidateFieldOffset32(0x2060, WindowData, __dword_2060);
ValidateFieldOffset32(0x2064, WindowData, __dword_2064);
ValidateFieldOffset32(0x2068, WindowData, __int_2068);
ValidateFieldOffset32(0x206C, WindowData, __int_206C);
ValidateFieldOffset32(0x2070, WindowData, __float_2070);
ValidateFieldOffset32(0x2074, WindowData, __int_2074);
ValidateFieldOffset32(0x2078, WindowData, __int_2078);
ValidateFieldOffset32(0x207C, WindowData, __int_207C);
ValidateFieldOffset32(0x2080, WindowData, __int_2080);
ValidateFieldOffset32(0x2084, WindowData, __int_2084);
ValidateFieldOffset32(0x2088, WindowData, __int_2088);
ValidateFieldOffset32(0x208C, WindowData, __int_208C);
ValidateFieldOffset32(0x2090, WindowData, __int_2090);
ValidateFieldOffset32(0x2098, WindowData, __double_2098);
ValidateFieldOffset32(0x20A0, WindowData, __double_20A0);
ValidateFieldOffset32(0x20A8, WindowData, __double_20A8);
ValidateFieldOffset32(0x20B0, WindowData, __double_20B0);
ValidateFieldOffset32(0x20B8, WindowData, __double_20B8);
ValidateFieldOffset32(0x20C0, WindowData, __double_20C0);

ValidateFieldOffset32(0x20CC, WindowData, __dword_20CC);
ValidateFieldOffset32(0x20D0, WindowData, __int_20D0);
ValidateFieldOffset32(0x20D4, WindowData, __dword_array_20D4);
#pragma endregion

extern "C" {
    // 0x568C30
    extern WindowData WINDOW_DATA asm("_WINDOW_DATA");
}

// Yes, I know I don't need explicit enum values. But it makes a quick lookup table visually.
enum CardId : int32_t {
    BLANK_CARD = 0,
    EXTEND_CARD = 1,
    BOMB_CARD = 2,
    EXTEND2_CARD = 3,
    BOMB2_CARD = 4,
    PENDULUM_CARD = 5,
    DANGO_CARD = 6,
    MOKOU_CARD = 7,
    REIMU_OP_CARD = 8,
    REIMU_OP2_CARD = 9,
    MARISA_OP_CARD = 10,
    MARISA_OP2_CARD = 11,
    SAKUYA_OP_CARD = 12,
    SAKUYA_OP2_CARD = 13,
    SANAE_OP_CARD = 14,
    SANAE_OP2_CARD = 15,
    YOUMU_OP_CARD = 16,
    ALICE_OP_CARD = 17,
    CIRNO_OP_CARD = 18,
    OKINA_OP_CARD = 19,
    NUE_OP_CARD = 20,
    ITEM_CATCH_CARD = 21,
    ITEM_LINE_CARD = 22,
    AUTOBOMB_CARD = 23,
    DBOMBEXTEND_CARD = 24,
    MAINSHOT_PU_CARD = 25,
    MAGICSCROLL_CARD = 26,
    KOISHI_CARD = 27,
    MAINSHOT_SP_CARD = 28,
    SPEEDQUEEN_CARD = 29,
    OPTION_BR_CARD = 30,
    DEAD_SPELL_CARD = 31,
    POWERMAX_CARD = 32,
    YUYUKO_CARD = 33,
    MONEY_CARD = 34,
    ROKUMON_CARD = 35,
    NARUMI_CARD = 36,
    PACHE_CARD = 37,
    MANEKI_CARD = 38,
    YAMAWARO_CARD = 39,
    KISERU_CARD = 40,
    WARP_CARD = 41,
    KOZUCHI_CARD = 42,
    KANAME_CARD = 43,
    MOON_CARD = 44,
    MIKOFLASH_CARD = 45,
    VAMPIRE_CARD = 46,
    SUN_CARD = 47,
    LILY_CARD = 48,
    BASSDRUM_CARD = 49,
    PSYCHO_CARD = 50,
    MAGATAMA_CARD = 51,
    CYLINDER_CARD = 52,
    RICEBALL_CARD = 53,
    MUKADE_CARD = 54,
    MAGATAMA2_CARD = 55,
    NULL_CARD = 56,
    BACK_CARD = 57,

    ENUM_VALUE_COUNT_DECLARE(CardId)
};

static inline constexpr size_t INTERNAL_CARD_COUNT = ENUM_VALUE_COUNT(CardId);
static inline constexpr size_t CARD_COUNT = INTERNAL_CARD_COUNT - 1;

// size: 0x34
struct CardData {
    const char* name; // 0x0
    CardId id; // 0x4
    unknown_fields(0x10); // 0x8
    int __int_18; // 0x18
    unknown_fields(0x4); // 0x1C
    uint8_t __byte_20; // 0x20
    unknown_fields(0x7); // 0x21
    BOOL __render_passive_in_hud; // 0x28
    int32_t sprite_large; // 0x2C
    int32_t sprite_small; // 0x30
    // 0x34

    // 0x416E10
    dllexport gnu_noinline int thiscall __sub_416E10() asm_symbol_rel(0x416E10);
};
#pragma region // CardData Validation
ValidateFieldOffset32(0x0, CardData, name);
ValidateFieldOffset32(0x4, CardData, id);
ValidateFieldOffset32(0x18, CardData, __int_18);
ValidateFieldOffset32(0x20, CardData, __byte_20);
ValidateFieldOffset32(0x28, CardData, __render_passive_in_hud);
ValidateFieldOffset32(0x2C, CardData, sprite_large);
ValidateFieldOffset32(0x30, CardData, sprite_small);
ValidateStructSize32(0x34, CardData);
#pragma endregion

extern "C" {
    // 0x4C53C0
    extern CardData CARD_DATA_TABLE[INTERNAL_CARD_COUNT] asm("_CARD_DATA_TABLE");
}

template <typename L>
static inline constexpr const CardData& find_in_card_data(const L& lambda) {
    for (int32_t i = 0; i < countof(CARD_DATA_TABLE); ++i) {
        if (lambda(CARD_DATA_TABLE[i])) {
            return CARD_DATA_TABLE[i];
        }
    }
    return CARD_DATA_TABLE[NULL_CARD];
}

// 0x407D70
dllexport const CardData& find_id_in_card_data(int32_t id) {
    return find_in_card_data([=](const CardData& card) {
        return card.id == id;
    });
}

static inline constexpr uint32_t SCOREFILE_MAGIC = PackUInt32('T', 'H', '8', '1'); // Yup, it's backwards
static inline constexpr uint16_t SCOREFILE_VERSION_NUMBER = 6;

static inline constexpr int32_t SPELL_COUNT = 97;

// 0x4B3F30
static const int8_t SPELL_DIFFICULTY_TABLE[SPELL_COUNT] = {
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EASY, NORMAL, HARD, LUNATIC,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA,
    EXTRA
};

// size: 0x18
struct ScorefileHeader {
    ZUNMagic magic; // 0x0
    uint32_t file_size; // 0x4
    uint16_t version_number; // 0x8
    short __short_A; // 0xA
    int __int_C; // 0xC
    int32_t compressed_size; // 0x10
    int32_t decompressed_size; // 0x14
    // 0x18

    inline void zero_contents() {
        zero_this();
    }
};
#pragma region // ScorefileHeader Validation
ValidateFieldOffset32(0x0, ScorefileHeader, magic);
ValidateFieldOffset32(0x4, ScorefileHeader, file_size);
ValidateFieldOffset32(0x8, ScorefileHeader, version_number);
ValidateFieldOffset32(0xC, ScorefileHeader, __int_C);
ValidateFieldOffset32(0x10, ScorefileHeader, compressed_size);
ValidateFieldOffset32(0x14, ScorefileHeader, decompressed_size);
ValidateStructSize32(0x18, ScorefileHeader);
#pragma endregion

// size: 0x20
struct ScorefileRecord {
    uint32_t score; // 0x0
    uint8_t __byte_4; // 0x4
    int8_t continues; // 0x5
    char name[10]; // 0x6
    time_t time; // 0x10
    float slowdown_rate; // 0x18
    unknown_fields(0x4); // 0x1C
    // 0x20
};
#pragma region // ScorefileRecord Validation
ValidateFieldOffset32(0x0, ScorefileRecord, score);
ValidateFieldOffset32(0x4, ScorefileRecord, __byte_4);
ValidateFieldOffset32(0x5, ScorefileRecord, continues);
ValidateFieldOffset32(0x6, ScorefileRecord, name);
ValidateFieldOffset32(0x10, ScorefileRecord, time);
ValidateFieldOffset32(0x18, ScorefileRecord, slowdown_rate);
ValidateStructSize32(0x20, ScorefileRecord);
#pragma endregion

// size: 0xDC
struct ScorefileSpellcard {
    char name[0]; // 0x0, 0x8D0, 0x8D8
    unknown_fields(0xC0); // 0x0
    int32_t captures[2]; // 0xC0, 0x990, 0x998 0 = Spell record menu, Spell practice menu GAME MODE line, 1 = Spell practice menu
    int32_t attempts[2]; // 0xC8, 0x998, 0x9A0 0 = Spell record menu, Spell practice menu GAME MODE line, 1 = Spell practice menu
    int32_t id; // 0xD0, 0x9A0, 0x9A8
    int32_t difficulty; // 0xD0, 0x9A0, 0x9A8
    int32_t spell_practice_score; // 0xD0, 0x9A8, 0x9B0
    // 0xDC

    //inline void 
};
#pragma region // ScorefileSpellcard
ValidateFieldOffset32(0x0, ScorefileSpellcard, name);
ValidateStructSize32(0xDC, ScorefileSpellcard);
#pragma endregion

// size: 0x8
struct ScorefileStagePractice {
    uint32_t score; // 0x0, 0x12EF0, 0x12EF8
    bool __bool_4; // 0x4, 0x12EF4, 0x12EFC
    bool unlocked; // 0x5, 0x12EF5, 0x12EFD
    unknown_fields(0x2); // 0x6, 0x12EF6, 0x12EFE
    // 0x8, 0x12EF8, 0x12F00
};
#pragma region // ScorefileStagePractice Validation
ValidateFieldOffset32(0x0, ScorefileStagePractice, score);
ValidateFieldOffset32(0x4, ScorefileStagePractice, __bool_4);
ValidateFieldOffset32(0x5, ScorefileStagePractice, unlocked);
ValidateStructSize32(0x8, ScorefileStagePractice);
#pragma endregion

// size: 0xC
struct ScorefileSectionHeader {
    ZUNMagic16 magic; // 0x0
    uint16_t __version_number; // 0x2
    uint32_t checksum; // 0x4
    uint32_t size; // 0x8
    // 0xC
};
#pragma region // ScorefileSectionHeader Validation
ValidateFieldOffset32(0x0, ScorefileSectionHeader, magic);
ValidateFieldOffset32(0x2, ScorefileSectionHeader, __version_number);
ValidateFieldOffset32(0x4, ScorefileSectionHeader, checksum);
ValidateFieldOffset32(0x8, ScorefileSectionHeader, size);
ValidateStructSize32(0xC, ScorefileSectionHeader);
#pragma endregion


struct ScorefileSection : ScorefileSectionHeader {
    uint8_t data[]; // 0xC

    // 0x463250
    dllexport gnu_noinline uint32_t thiscall calculate_checksum(int32_t data_size) asm_symbol_rel(0x463250) {
        const uint8_t* read = this->data;
        data_size -= sizeof(ScorefileSectionHeader);
        
        // This really just looks like MSVC trying to optimize a normal loop
        uint32_t sum = 0;
        for (int32_t i = 0; i < data_size; ++i) {
            sum += read[i];
        }
        return sum;
    }
};

static inline constexpr uint16_t SCOREFILE_SECTION_B_MAGIC = PackUInt16('C', 'R');
static inline constexpr uint16_t SCOREFILE_SECTION_B_VERSION_NUMBER = 3;
static inline constexpr int32_t RECORDS_PER_DIFFICULTY = 10;

/*
uint32_t score; //
bool __idk; // 0x12EF4, 0x12EFC
bool __seen; // 0x12EF5, 0x12EFD
// 0x12EFE
// 0x12F00
bool __idkB; // 0x12F05
// 0x12F06
*/

static inline constexpr size_t wekjbkrb = sizeof(ScorefileStagePractice[DIFFICULTY_COUNT][STAGE_COUNT + 1]);

// size: 0x130F0
struct ScorefileSectionB : ScorefileSectionHeader {
    // ScorefileSectionHeader base; // 0x0, 0x8
    int32_t index; // 0xC, 0x14
    ScorefileRecord records[DIFFICULTY_COUNT][RECORDS_PER_DIFFICULTY]; // 0x10, 0x18
    unknown_fields(0x140); // 0x790, 0x798
    ScorefileSpellcard spells[SPELL_COUNT]; // 0x8D0, 0x8D8
    unknown_fields(0x898); // 0x5C2C, 0x5C34
    int32_t __int_64C4; // 0x64C4, 0x64CC
    uint64_t __ulonglong_64C8; // 0x64C8, 0x64D0
    int32_t __total_clears[DIFFICULTY_COUNT]; // 0x64D0, 0x64D8
    unknown_fields(0x4); // 0x64E8, 0x64F0
    int32_t __1cc_clears[DIFFICULTY_COUNT]; // 0x64EC, 0x64F4
    unknown_fields(0xC9EC); // 0x6504, 0x650C
    ScorefileStagePractice practice[DIFFICULTY_COUNT][STAGE_COUNT + 1]; // 0x12EF0, 0x12EF8
    unknown_fields(0x50); // 0x130A0, 0x130A8
    // 0x130F0, 0x130F8

    inline void zero_contents() {
        zero_this();
    }

    inline ScorefileSectionHeader* next_section() {
        return this + 1;
    }

    inline uint32_t calculate_checksum() {
        return ((ScorefileSection*)this)->calculate_checksum(sizeof(ScorefileSectionB));
    }

    inline void __add_play_count() {
        int32_t count = this->__int_64C4;
        if (count < 9999999) {
            this->__int_64C4 = count + 1;
        }
    }

    // 0x463350
    dllexport gnu_noinline void thiscall initialize() asm_symbol_rel(0x463350) {
        this->zero_contents();
        this->magic.as_uint = SCOREFILE_SECTION_B_MAGIC;
        this->__version_number = SCOREFILE_SECTION_B_VERSION_NUMBER;
        this->size = sizeof(ScorefileSectionB);

        for (size_t i = 0; i < DIFFICULTY_COUNT; ++i) {
            for (size_t j = 0; j < RECORDS_PER_DIFFICULTY; ++j) {
                this->records[i][j].score = 100000 - j * 10000;
                this->records[i][j].__byte_4 = 1;
                memcpy(this->records[i][j].name, "--------", sizeof("--------"));
                this->records[i][j].time = 0;
                this->records[i][j].continues = 0;
                this->records[i][j].slowdown_rate = 0.0f;
            }
        }

        for (int32_t i = 0; i < SPELL_COUNT; ++i) {
            int32_t difficulty = SPELL_DIFFICULTY_TABLE[i];
            this->spells[i].id = i;
            this->spells[i].difficulty = difficulty;
        }
    }

    // 0x457870
    dllexport gnu_noinline int32_t thiscall __sub_457870() asm_symbol_rel(0x457870) {
        ScorefileRecord* cur_record = &this->records[GAME_MANAGER.globals.difficulty][0];
        int32_t cur_score = GAME_MANAGER.globals.score;

        int32_t found_index;
        for (found_index = 0; found_index < RECORDS_PER_DIFFICULTY; ++found_index) {
            if (cur_score >= cur_record->score) {
                goto found_record;
            }
            ++cur_record;
        }
        return -1;
    found_record:
        for (size_t i = RECORDS_PER_DIFFICULTY - 1; found_index < i; --i) {
            this->records[GAME_MANAGER.globals.difficulty][i] = this->records[GAME_MANAGER.globals.difficulty][i - 1];
        }

        cur_record->score = GAME_MANAGER.globals.score;
        cur_record->continues = GAME_MANAGER.globals.continues;
        cur_record->__byte_4 = GAME_MANAGER.globals.current_stage;
        time(&cur_record->time);
        cur_record->slowdown_rate = FPS_COUNTER_PTR->calc_slowdown_rate();

        return found_index;
    }
};
#pragma region // ScorefileSectionB Validation
ValidateFieldOffset32(0x0, ScorefileSectionB, magic);
ValidateFieldOffset32(0x2, ScorefileSectionB, __version_number);
ValidateFieldOffset32(0x4, ScorefileSectionB, checksum);
ValidateFieldOffset32(0x8, ScorefileSectionB, size);
ValidateFieldOffset32(0xC, ScorefileSectionB, index);
ValidateFieldOffset32(0x10, ScorefileSectionB, records);
ValidateFieldOffset32(0x8D0, ScorefileSectionB, spells);
ValidateFieldOffset32(0x64C4, ScorefileSectionB, __int_64C4);
ValidateFieldOffset32(0x64C8, ScorefileSectionB, __ulonglong_64C8);
ValidateFieldOffset32(0x64D0, ScorefileSectionB, __total_clears);
ValidateFieldOffset32(0x64EC, ScorefileSectionB, __1cc_clears);
ValidateFieldOffset32(0x12EF0, ScorefileSectionB, practice);
ValidateStructSize32(0x130F0, ScorefileSectionB);
#pragma endregion

static inline constexpr uint16_t SCOREFILE_SECTION_A_MAGIC = PackUInt16('S', 'T');
static inline constexpr uint16_t SCOREFILE_SECTION_A_VERSION_NUMBER = 6;

// size: 0x3D0
struct ScorefileSectionA : ScorefileSectionHeader {
    // ScorefileSectionHeader base; // 0x0, 0x5F4B8
    char __text_buffer_C[10]; // 0xC, 0x5F4C4
    unknown_fields(0x32); // 0x16, 0x5F4CE
    uint64_t __ulonglong_48; // 0x48, 0x5F500
    bool trophies[30]; // 0x50, 0x5F508
    unknown_fields(0x62); // 0x6E, 0x5F526
    uint8_t __byte_array_D0[CARD_COUNT]; // 0xD0, 0x5F588
    unknown_fields(0x47); // 0x109, 0x5F5C1
    uint8_t __card_ids_150[SHOTTYPE_COUNT][16]; // 0x150, 0x5F608
    unknown_fields(0x30); // 0x190, 0x5F648
    int32_t __int_array_1C0[4]; // 0x1C0, 0x5F678
    short __short_array_1D0[0x100]; // 0x1D0, 0x5F688
    // 0x3D0, 0x5F888

    inline void zero_contents() {
        zero_this();
    }

    inline ScorefileSectionHeader* next_section() {
        return this + 1;
    }

    inline uint32_t calculate_checksum() {
        return ((ScorefileSection*)this)->calculate_checksum(sizeof(ScorefileSectionA));
    }

    // 0x463670
    dllexport gnu_noinline void thiscall initialize() asm_symbol_rel(0x463670) {
        this->zero_contents();
        this->magic.as_uint = SCOREFILE_SECTION_A_MAGIC;
        this->__version_number = SCOREFILE_SECTION_A_VERSION_NUMBER;
        this->size = sizeof(ScorefileSectionA);

        memcpy(this->__text_buffer_C, "        ", sizeof("        "));
        for (int32_t i = 0; i < CARD_COUNT; ++i) {
            this->__byte_array_D0[i] = find_id_in_card_data(i).__byte_20;
        }
        memset(this->__card_ids_150, NULL_CARD, sizeof(__card_ids_150));
        this->__card_ids_150[0][0] = KOZUCHI_CARD;
        this->__int_array_1C0[0] = 1;
        this->__int_array_1C0[1] = 3;
        this->__card_ids_150[1][0] = KOZUCHI_CARD;
        this->__card_ids_150[1][1] = YOUMU_OP_CARD;
        this->__card_ids_150[1][2] = DBOMBEXTEND_CARD;
        this->__int_array_1C0[2] = 5;
        this->__card_ids_150[2][0] = KOZUCHI_CARD;
        this->__int_array_1C0[3] = 0;
        for (size_t i = 0; i < countof(this->__short_array_1D0); ++i) {
            this->__short_array_1D0[i] = REPLAY_RNG.rand_ushort();
        }
    }
};
#pragma region // ScorefileInnerA Validation
ValidateFieldOffset32(0x0, ScorefileSectionA, magic);
ValidateFieldOffset32(0x2, ScorefileSectionA, __version_number);
ValidateFieldOffset32(0x4, ScorefileSectionA, checksum);
ValidateFieldOffset32(0x8, ScorefileSectionA, size);
ValidateFieldOffset32(0xC, ScorefileSectionA, __text_buffer_C);
ValidateFieldOffset32(0x48, ScorefileSectionA, __ulonglong_48);
ValidateFieldOffset32(0x50, ScorefileSectionA, trophies);
ValidateFieldOffset32(0xD0, ScorefileSectionA, __byte_array_D0);
ValidateFieldOffset32(0x150, ScorefileSectionA, __card_ids_150);
ValidateFieldOffset32(0x1C0, ScorefileSectionA, __int_array_1C0);
ValidateFieldOffset32(0x1D0, ScorefileSectionA, __short_array_1D0);
ValidateStructSize32(0x3D0, ScorefileSectionA);
#pragma endregion

struct ScorefileBuffer {
    ScorefileHeader header; // 0x0
    uint8_t file_body[]; // 0x18
};

// size: 0x5F888
struct Scorefile {
    ScorefileBuffer* buffer; // 0x0
    void* decompressed_buffer; // 0x4
    ScorefileSectionB shottypes[SHOTTYPE_COUNT + 1]; // 0x8, 0x130F8, 0x251E8, 0x392D8, 0x4C3C8
    ScorefileSectionA __sectionA; // 0x5F4B8
    // 0x5F888

private:
    // 0x463B30
    dllexport gnu_noinline ZUNResult stdcall save_to_file(const char* filename, Scorefile* scorefile) {
        if (!scorefile->buffer) {
            return ZUN_ERROR;
        }

        // bad ZUN, don't do BS like this!
        uint8_t* big_buffer = (uint8_t*)malloc(0x200000);
        uint32_t written_size = 0;

        *(ScorefileHeader*)big_buffer = scorefile->buffer->header;
        written_size += sizeof(ScorefileHeader);
        
        ScorefileSectionB* sectionB = scorefile->shottypes;
        for (size_t i = 0; i < countof(scorefile->shottypes); ++i) {
            if (sectionB->magic.as_uint == SCOREFILE_SECTION_B_MAGIC) {
                sectionB->index = i;
                clang_forceinline sectionB->checksum = sectionB->calculate_checksum();
                *(ScorefileSectionB*)&big_buffer[written_size] = *sectionB;
                written_size += sizeof(ScorefileSectionB);
            }
            ++sectionB;
        }

        ScorefileSectionA* sectionA = &scorefile->__sectionA;
        sectionA->checksum = sectionA->calculate_checksum();
        *(ScorefileSectionA*)&big_buffer[written_size] = *sectionA;
        written_size += sizeof(ScorefileSectionA) - sizeof(ScorefileHeader); // WTF ZUN

        scorefile->buffer->header.decompressed_size = written_size;
        void* compressed_buffer = __compress_buffer(&big_buffer[sizeof(ScorefileHeader)], scorefile->buffer->header.decompressed_size, &scorefile->buffer->header.compressed_size);
        scorefile->buffer->header.file_size = scorefile->buffer->header.compressed_size + sizeof(ScorefileHeader);
        __crypt_buffer(compressed_buffer, scorefile->buffer->header.compressed_size, 0xAC, 0x35, 0x10, scorefile->buffer->header.compressed_size);
        
        chdir(WINDOW_DATA.appdata_path);

        if (ZUN_FAILED(__zun_open_new_file(filename))) {
            LOG_BUFFER.write_error(JpEnStr("", "error : cannot write score file\n"));
            SAFE_FREE(compressed_buffer);
            free(big_buffer);
            chdir(WINDOW_DATA.exe_path);
            return ZUN_ERROR;
        }

        __zun_write_file(&scorefile->buffer->header, sizeof(ScorefileHeader));
        __zun_write_file(compressed_buffer, scorefile->buffer->header.compressed_size);
        __zun_close_file();

        SAFE_FREE(compressed_buffer);
        chdir(WINDOW_DATA.exe_path);
        free(big_buffer);
        return ZUN_SUCCESS;
    }

    // 0x4639B0
    dllexport gnu_noinline ZUNResult stdcall load_from_buffer(Scorefile* scorefile) {
        if (scorefile->buffer) {
            if (
                scorefile->buffer->header.magic.as_uint == SCOREFILE_MAGIC &&
                scorefile->buffer->header.version_number == SCOREFILE_VERSION_NUMBER
            ) {
                __decrypt_buffer(scorefile->buffer->file_body, scorefile->buffer->header.compressed_size, 0xAC, 0x35, 0x10, scorefile->buffer->header.compressed_size);
                scorefile->decompressed_buffer = malloc(scorefile->buffer->header.decompressed_size * 4);
                __decompress_buffer(scorefile->buffer->file_body, scorefile->buffer->header.compressed_size, scorefile->decompressed_buffer, scorefile->buffer->header.decompressed_size);

                ScorefileSectionHeader* section = (ScorefileSectionHeader*)scorefile->decompressed_buffer;
                int32_t remaining_size = scorefile->buffer->header.decompressed_size;
                while (remaining_size > 0) {
                    switch (section->magic.as_uint) {
                        case SCOREFILE_SECTION_B_MAGIC: {
                            ScorefileSectionB* sectionB = (ScorefileSectionB*)section;
                            if (
                                sectionB->__version_number == SCOREFILE_SECTION_B_VERSION_NUMBER &&
                                sectionB->checksum == sectionB->calculate_checksum() &&
                                sectionB->size == sizeof(ScorefileSectionB)
                            ) {
                                scorefile->shottypes[sectionB->index] = *sectionB;
                                remaining_size -= sectionB->size;
                                if (remaining_size < 0) break;
                                section = sectionB->next_section();
                            }
                            break;
                        }
                        case SCOREFILE_SECTION_A_MAGIC: {
                            ScorefileSectionA* sectionA = (ScorefileSectionA*)section;
                            if (
                                sectionA->__version_number == SCOREFILE_SECTION_A_VERSION_NUMBER &&
                                sectionA->checksum == sectionA->calculate_checksum() &&
                                sectionA->size == sizeof(ScorefileSectionA)
                            ) {

                            }
                            break;
                        }
                    }
                }
                return ZUN_SUCCESS;
            }
            SAFE_FREE(scorefile->buffer);
        }
        scorefile->buffer = (ScorefileBuffer*)malloc(sizeof(ScorefileBuffer));
        scorefile->buffer->header.zero_contents();
        scorefile->buffer->header.magic.as_uint = SCOREFILE_MAGIC;
        scorefile->buffer->header.version_number = SCOREFILE_VERSION_NUMBER;
        scorefile->buffer->header.__int_C = 256;
        return ZUN_SUCCESS;
    }

public:
    inline ZUNResult save_to_file(const char* filename) {
        return Scorefile::save_to_file(filename, this);
    }

    inline ZUNResult load_from_buffer() {
        return Scorefile::load_from_buffer(this);
    }

    inline void initialize(const char* filename) {
        chdir(WINDOW_DATA.appdata_path);
        int32_t bak_file_size;
        this->buffer = (ScorefileBuffer*)read_file_to_buffer(filename, &bak_file_size, true);
        chdir(WINDOW_DATA.exe_path);
        this->__sectionA.initialize();

        for (
            ScorefileSectionB* sectionB = this->shottypes;
            (int32_t)(sectionB - this->shottypes) < SHOTTYPE_COUNT + 1;
            ++sectionB
        ) {
            sectionB->initialize();
        }
    }
};
#pragma region // Scorefile Validation
ValidateFieldOffset32(0x0, Scorefile, buffer);
ValidateFieldOffset32(0x4, Scorefile, decompressed_buffer);
ValidateFieldOffset32(0x8, Scorefile, shottypes);
ValidateFieldOffset32(0x5F4B8, Scorefile, __sectionA);
ValidateStructSize32(0x5F888, Scorefile);
#pragma endregion

typedef struct ScorefileManager ScorefileManager;

extern "C" {
    // 0x4CF41C
    extern ScorefileManager* SCOREFILE_MANAGER_PTR asm("_SCOREFILE_MANAGER_PTR");
}

// size: 0xBF158
struct ScorefileManager {
    Scorefile primary_file; // 0x0
    Scorefile backup_file; // 0x5F888
    unknown_fields(0x48); // 0xBF110
    // 0xBF158

    inline void zero_contents() {
        zero_this();
    }

    ScorefileManager() {
        this->zero_contents();
        this->initialize();
    }

    inline void copy_backup_to_primary() {
        memcpy(this->primary_file.shottypes, this->backup_file.shottypes, sizeof(this->backup_file.shottypes));
        this->primary_file.__sectionA = this->backup_file.__sectionA;
    }

    inline void copy_primary_to_backup() {
        memcpy(this->backup_file.shottypes, this->primary_file.shottypes, sizeof(this->primary_file.shottypes));
        this->backup_file.__sectionA = this->primary_file.__sectionA;
    }

    inline void initialize() {
        this->backup_file.initialize("scoreth18bak.dat");
        this->backup_file.load_from_buffer();
        this->primary_file.initialize("scoreth18.dat");

        this->copy_backup_to_primary();

        this->primary_file.load_from_buffer();

        this->copy_primary_to_backup();
    }

    // 0x4637D0
    dllexport gnu_noinline static ScorefileManager* allocate() {
        ScorefileManager* scorefile_manager = new ScorefileManager();
        SCOREFILE_MANAGER_PTR = scorefile_manager;
        return scorefile_manager;
    }

    // 0x413510
    dllexport gnu_noinline static ZUNResult save_files() {
        ScorefileManager* scorefile_manager = SCOREFILE_MANAGER_PTR;
        int32_t ret = scorefile_manager->backup_file.save_to_file("scoreth18bak.dat");
        ret |= scorefile_manager->primary_file.save_to_file("scoreth18.dat");
        scorefile_manager->copy_primary_to_backup();
        return (ZUNResult)ret;
    }
};
#pragma region // ScorefileManager Validation
ValidateFieldOffset32(0x0, ScorefileManager, primary_file);
ValidateFieldOffset32(0x5F888, ScorefileManager, backup_file);
ValidateStructSize32(0xBF158, ScorefileManager);
#pragma endregion

// 0x416E10
dllexport gnu_noinline int thiscall CardData::__sub_416E10() {
    switch (this->__int_18) {
        case 0:
            return 1;
        case 1:
            if (GAME_MANAGER.globals.current_stage == 1) {
                return 2;
            }
            break;
        case 2:
            if (GAME_MANAGER.globals.current_stage == 2) {
                return 2;
            }
            break;
        case 3:
            if (GAME_MANAGER.globals.current_stage == 3) {
                return 2;
            }
            break;
        case 4:
            if (GAME_MANAGER.globals.current_stage == 4) {
                return 2;
            }
            break;
        case 5:
            if (GAME_MANAGER.globals.current_stage == 5) {
                return 2;
            }
            break;
        case 6:
            switch (GAME_MANAGER.globals.current_stage) {
                case 1: case 2:
                    return 1;
                default:
                    return !(RNG.rand_uint() % 5);
            }
        case 7:
            switch (GAME_MANAGER.globals.current_stage) {
                case 1: case 2: case 3:
                    return 1;
                default:
                    return !(RNG.rand_uint() % 5);
            }
        case 8:
            switch (GAME_MANAGER.globals.current_stage) {
                case 2: case 3: case 4:
                    return 1;
                default:
                    return !(RNG.rand_uint() % 5);
            }
        case 9:
            switch (GAME_MANAGER.globals.current_stage) {
                case 3: case 4: case 5:
                    return 1;
                default:
                    return !(RNG.rand_uint() % 5);
            }
        case 10:
            switch (GAME_MANAGER.globals.current_stage) {
                case 4: case 5:
                    return 1;
                default:
                    return !(RNG.rand_uint() % 5);
            }
        case 11:
            switch (GAME_MANAGER.globals.current_stage) {
                default:
                    return 0;
                case 1: case 2: case 3: case 4: case 5:
                    break;
            }
        case 12:
            break;
    }
    return SCOREFILE_MANAGER_PTR->primary_file.__sectionA.__byte_array_D0[this->id] != 0;
}

enum MotionMode : int32_t {
    AxisVelocityMovement = 0,
    NoMovement = 1,
    OrbitMovement = 2,
    EllipseMovement = 3,
    UnknownMovement = 4
};

// size: 0x44
struct MotionData {
    Float3 position; // 0x0
    Float3 position2; // 0xC
    float speed; // 0x18
    ZUNAngle angle; // 0x1C
    float orbit_radius; // 0x20
    float orbit_velocity; // 0x24
    ZUNAngle ellipse_angle; // 0x28
    float ellipse_ratio; // 0x2C
    float __angle_30; // 0x30
    union {
        Float3 misc_float3; // 0x34
        Float3 axis_velocity; // 0x34
        Float3 orbit_origin; // 0x34
    };
    union {
        uint32_t flags; // 0x40
        struct {
            uint32_t mode : 4; // 1-4
        };
    };

    inline void zero_contents() {
        zero_this();
    }
    
    // 0x402CC0
    dllexport gnu_noinline void update() asm_symbol_rel(0x402CC0) {
        Float3 float3B; // EBP-20, EBP-1C, EBP-18
        Float3 float3A; // EBP-14, EBP-10, EBP-C
        float floatA; // EBP-8
        float floatB; // EBP-4
        float floatC;
        switch (this->mode) {
            case AxisVelocityMovement:
                this->position += this->axis_velocity;
                break;
            case OrbitMovement:
                float3A.make_from_vector(this->angle, this->orbit_radius);
                this->position = this->orbit_origin + float3A.as2();
                break;
            case EllipseMovement: {
                ZUNAngle angle_temp = this->ellipse_angle;
                float3A.make_from_vector(reduce_angle<NoInline>(this->angle - angle_temp), this->orbit_radius);
                floatB = this->ellipse_ratio * float3A.x;
                floatA = zsinf(angle_temp);
                floatC = zcosf(angle_temp);
                Float2 float2A = { floatB, float3A.y };
                Float2 float2B = float2A;
                float2B *= floatA;
                float2A *= floatC;
                float2A.x -= float2B.y;
                float2A.y += float2B.x;
                this->position = this->orbit_origin + float2A;
                break;
            }
            case UnknownMovement: {
                float3A.as2() = this->position.as2();
                this->position2 += this->axis_velocity;
                floatB = this->ellipse_angle + HALF_PI_f;
                float3B.make_from_vector(reduce_angle<NoInline>(floatB), this->orbit_radius * zsinf(this->__angle_30) * GAME_SPEED.value);
                this->position = this->position2 + float3B.as2();
                float angle_temp = this->position.angle_to(float3A.as2());
                clang_noinline this->angle = angle_temp;
                break;
            }
        }
        this->position.x = zfloorf(this->position.x * 100.0f) / 100.0f;
        this->position.y = zfloorf(this->position.y * 100.0f) / 100.0f;
    }

    // This function doesn't exist, I merely wanted to write a simplified version
    inline void update_readable() {
        switch (this->mode) {
            case AxisVelocityMovement:
                this->position.x += this->axis_velocity.x;
                this->position.y += this->axis_velocity.y;
                this->position.z += this->axis_velocity.z;
                break;
            case OrbitMovement: {
                Float2 circle_pos;
                circle_pos.make_from_vector(this->angle, this->orbit_radius);
                this->position.x = this->orbit_origin.x + circle_pos.x;
                this->position.y = this->orbit_origin.y + circle_pos.y;
                this->position.z = this->orbit_origin.z;
                break;
            }
            case EllipseMovement: {
                Float2 ellipse_pos;
                ellipse_pos.make_from_vector(reduce_angle(this->angle - this->ellipse_angle), this->orbit_radius);
                ellipse_pos.x *= this->ellipse_ratio;
                Float2 temp_pos = ellipse_pos;
                ellipse_pos.x *= cosf(this->ellipse_angle);
                ellipse_pos.y *= cosf(this->ellipse_angle);
                temp_pos.x *= sinf(this->ellipse_angle);
                temp_pos.y *= sinf(this->ellipse_angle);
                ellipse_pos.x -= temp_pos.y;
                ellipse_pos.y += temp_pos.x;
                this->position.x = this->orbit_origin.x + ellipse_pos.x;
                this->position.y = this->orbit_origin.y + ellipse_pos.y;
                this->position.z = this->orbit_origin.z;
                break;
            }
            case UnknownMovement: {
                Float2 prev_position = this->position;
                this->position2.x += this->axis_velocity.x;
                this->position2.y += this->axis_velocity.y;
                this->position2.z += this->axis_velocity.z;
                Float2 offset;
                offset.make_from_vector(reduce_angle(this->ellipse_angle + HALF_PI_f), this->orbit_radius * sinf(this->__angle_30) * GAME_SPEED.value);
                this->position.x = this->position2.x + offset.x;
                this->position.y = this->position2.y + offset.y;
                this->position.z = this->position2.z;
                this->angle = this->position.angle_to(prev_position); // wrapper function for atan2
                break;
            }
        }
        this->position.x = floorf(this->position.x * 100.0f) / 100.0f;
        this->position.y = floorf(this->position.y * 100.0f) / 100.0f;
    }

    // 0x402F90
    dllexport gnu_noinline void update2() asm_symbol_rel(0x402F90) {
        if (this->mode == UnknownMovement) {
            this->position2 = this->position;
        }
        this->update();
    }
    
    // 0x412F60
    dllexport gnu_noinline void set_position(Float3* coord) asm_symbol_rel(0x412F60) {
        this->position = *coord;
    }
    // 0x43A290
    dllexport gnu_noinline void set_positionB(Float3* coord) asm_symbol_rel(0x43A290) {
        this->position = *coord;
    }
    
    // 0x412FD0
    dllexport gnu_noinline void vectorcall set_speed(float value) asm_symbol_rel(0x412FD0) {
        this->speed = value;
    }
    
    // 0x413280
    dllexport gnu_noinline Float3& thiscall get_position() asm_symbol_rel(0x413280) {
        return this->position;
    }
    
    // 0x422530
    dllexport gnu_noinline void vectorcall set_orbit_velocity(float value) asm_symbol_rel(0x422530) {
        this->orbit_velocity = value;
    }
    
    // 0x422540
    dllexport gnu_noinline void vectorcall set_orbit_radius(float value) asm_symbol_rel(0x422540) {
        this->orbit_radius = value;
    }
    
    // 0x422550
    dllexport gnu_noinline void set_orbit_mode() asm_symbol_rel(0x422550) {
        this->mode = OrbitMovement;
    }
    
    // 0x422560
    dllexport gnu_noinline void set_misc_float3(const Float3& value) asm_symbol_rel(0x422560) {
        this->misc_float3 = value;
    }

    forceinline void set_axis_velocity(const Float3& value) {
        this->set_misc_float3(value);
    }

    forceinline void set_orbit_origin(const Float3& value) {
        this->set_misc_float3(value);
    }

    // 0x422580
    dllexport gnu_noinline float vectorcall get_speed() asm_symbol_rel(0x422580) {
        return this->speed;
    }
    
    // 0x422590
    dllexport gnu_noinline ZUNAngle& get_angle() asm_symbol_rel(0x422590) {
        return this->angle;
    }
    
    // 0x4225A0
    dllexport gnu_noinline void vectorcall set_angle(float angle) asm_symbol_rel(0x4225A0) {
        this->angle = angle;
    }
    
    // 0x4225F0
    dllexport gnu_noinline void set_axis_velocity_mode() asm_symbol_rel(0x4225F0) {
        this->mode = AxisVelocityMovement;
    }
    
    // 0x43A210
    dllexport gnu_noinline void vectorcall set_position_y(float value) asm_symbol_rel(0x43A210) {
        this->position.y = value;
    }
    
    // 0x43A220
    dllexport gnu_noinline void vectorcall set_position_x(float value) asm_symbol_rel(0x43A220) {
        this->position.x = value;
    }
    
    // 0x43A230
    dllexport gnu_noinline float vectorcall get_position_y() asm_symbol_rel(0x43A230) {
        return this->position.y;
    }
    
    // 0x43A240
    dllexport gnu_noinline float vectorcall get_position_x() asm_symbol_rel(0x43A240) {
        return this->position.x;
    }

    // 0x439ED0
    dllexport gnu_noinline float vectorcall get_ellipse_angle() asm_symbol_rel(0x439ED0) {
        return this->ellipse_angle;
    }

    // 0x439EE0
    dllexport gnu_noinline float vectorcall get_ellipse_ratio() asm_symbol_rel(0x439EE0) {
        return this->ellipse_ratio;
    }
    
    // 0x439EF0
    dllexport gnu_noinline void set_ellipse_mode() asm_symbol_rel(0x439EF0) {
        this->mode = EllipseMovement;
    }
    
    // 0x439F00
    dllexport gnu_noinline void vectorcall set_ellipse_ratio(float ratio) asm_symbol_rel(0x439F00) {
        this->ellipse_ratio = ratio;
    }
    
    // 0x439F10
    dllexport gnu_noinline void vectorcall set_ellipse_angle(float angle) asm_symbol_rel(0x439F10) {
        this->ellipse_angle = angle;
    }

    // 0x439FA0
    dllexport gnu_noinline void vectorcall set_misc_float3_y(float value) asm_symbol_rel(0x439FA0) {
        this->misc_float3.y = value;
    }

    forceinline void vectorcall set_axis_velocity_y(float value) {
        this->set_misc_float3_y(value);
    }

    forceinline void vectorcall set_orbit_origin_y(float value) {
        this->set_misc_float3_y(value);
    }

    // 0x439FB0
    dllexport gnu_noinline void vectorcall set_misc_float3_x(float value) asm_symbol_rel(0x439FB0) {
        this->misc_float3.x = value;
    }

    forceinline void vectorcall set_axis_velocity_x(float value) {
        this->set_misc_float3_x(value);
    }

    forceinline void vectorcall set_orbit_origin_x(float value) {
        this->set_misc_float3_x(value);
    }
    
    // 0x439FC0
    dllexport gnu_noinline float vectorcall get_orbit_radius() asm_symbol_rel(0x439FD0) {
        return this->orbit_radius;
    }
    
    // 0x439FD0
    dllexport gnu_noinline float vectorcall get_orbit_velocity() asm_symbol_rel(0x439FD0) {
        return this->orbit_velocity;
    }
    
    // 0x43A270
    dllexport gnu_noinline bool mode_is_orbit() asm_symbol_rel(0x43A270) {
        return this->mode == OrbitMovement;
    }

    inline MotionData() {};
};
#pragma region // MotionData Validation
ValidateFieldOffset32(0x0, MotionData, position);
ValidateFieldOffset32(0xC, MotionData, position2);
ValidateFieldOffset32(0x18, MotionData, speed);
ValidateFieldOffset32(0x1C, MotionData, angle);
ValidateFieldOffset32(0x20, MotionData, orbit_radius);
ValidateFieldOffset32(0x24, MotionData, orbit_velocity);
ValidateFieldOffset32(0x28, MotionData, ellipse_angle);
ValidateFieldOffset32(0x2C, MotionData, ellipse_ratio);
ValidateFieldOffset32(0x30, MotionData, __angle_30);
ValidateFieldOffset32(0x34, MotionData, misc_float3);
ValidateFieldOffset32(0x40, MotionData, flags);
ValidateStructSize32(0x44, MotionData);
#pragma endregion

template <typename T>
struct ZUNAbsRel {
    T absolute;
    T relative;
};
/*
enum InterpMode {
    Linear = 0,
    AccelerateSlow = 1,
    Accelerate = 2,
    AccelerateFast = 3,
    DecelerateSlow = 4,
    Decelerate = 5,
    DecelerateFast = 6,
    ConstantVelocity = 7,
    Bezier = 8,
    AccelDecelSlow = 9,
    AccelDecel = 10,
    AccelDecelFast = 11,
    DecelAccelSlow = 12,
    DecelAccel = 13,
    DecelAccelFast = 14,
};
*/

// 0x402FB0
dllexport gnu_noinline float vectorcall __interp_inner_thing(int32_t mode, float current_time, float end_time) asm_symbol_rel(0x402FB0);
dllexport gnu_noinline float vectorcall __interp_inner_thing(int32_t mode, float current_time, float end_time) {
    float value = current_time;
    if (end_time == 0.0f) {
        goto interp_final;
    }
    value /= end_time;
    switch (mode) {
        case AccelerateSlow: // 1
            value = value * value;
        default: // linear
            return value;
        case DecelerateSlow: // 4
            value = 1.0f - value;
            value = value * value;
            value = 1.0f - value;
            return value;
        case Accelerate: // 2
            value = value * value * value;
            return value;
        case Decelerate: // 5
            value = 1.0f - value;
            value = value * value * value;
            value = 1.0f - value;
            return value;
        case AccelerateFast: // 3
            value = value * value * value * value;
            return value;
        case DecelerateFast: // 6
            value = 1.0f - value;
            value = value * value * value * value;
            value = 1.0f - value;
            return value;
        case AccelDecelSlow: // 9
            value += value;
            if (value < 1.0f) {
                value = value * value;
                return value * 0.5f;
            } else {
                value = 2.0f - value;
                value = value * value;
                value = 2.0f - value;
                return value * 0.5f;
            }
        case DecelAccelSlow: // 12
            value += value;
            if (value < 1.0f) {
                value = 1.0f - value;
                value = value * value;
                return 0.5f - value * 0.5f;
            } else {
                value = value - 1.0f;
                value = value * value;
                return 0.5f + value * 0.5f;
            }
        case AccelDecel: // 10
            value += value;
            if (value < 1.0f) {
                value = value * value * value;
                return value * 0.5f;
            } else {
                value = 2.0f - value;
                value = value * value * value;
                value = 2.0f - value;
                return value * 0.5f;
            }
        case DecelAccel: // 13
            value += value;
            if (value < 1.0f) {
                value = 1.0f - value;
                value = value * value * value;
                return 0.5f - value * 0.5f;
            } else {
                value = value - 1.0f;
                value = value * value * value;
                return 0.5f + value * 0.5f;
            }
        case AccelDecelFast: // 11
            value += value;
            if (value < 1.0f) {
                value = value * value * value * value;
                return value * 0.5f;
            } else {
                value = 2.0f - value;
                value = value * value * value * value;
                value = 2.0f - value;
                return value * 0.5f;
            }
        case DecelAccelFast: // 14
            value += value;
            if (value < 1.0f) {
                value = 1.0f - value;
                value = value * value * value * value;
                return 0.5f - value * 0.5f;
            } else {
                value = value - 1.0f;
                value = value * value * value * value;
                return 0.5f + value * 0.5f;
            }
        case DecelerateSine: // 18
            return zsinf(value * PI_f * 0.5f);
        case AccelerateSine: // 19
            return 1.0f - zsinf(value * PI_f * 0.5f + HALF_PI_f);
        case DecelAccelSine: // 20
            value += value;
            if (1.0f > value) {
                return zsinf(value * PI_f * 0.5f) * 0.5f;
            } else {
                return (1.0f - zsinf(value * PI_f * 0.5f)) * 0.5f + 0.5f;
            }
        case AccelDecelSine: // 21
            value += value;
            if (1.0f > value) {
                return (1.0f - zsinf(value * PI_f * 0.5f + HALF_PI_f)) * 0.5f;
            } else {
                value = value - 1.0f;
                return zsinf(value * PI_f * 0.5f) * 0.5f + 0.5f;
            }
        case AccelParabolaA: // 22
            value = value - 0.25f;
            value = (value * value / (9.0f / 16.0f) - 1.0f / 9.0f) / (8.0f / 9.0f);
            return value;
        case AccelParabolaB: // 23
            value = value - 0.3f;
            value = (value * value / 0.49f - 9.0f / 49.0f) / (40.0f / 49.0f);
            return value;
        case AccelParabolaC: // 24
            value = value - 0.35f;
            value = (value * value / 0.4225f - 49.0f / 169.0f) / (120.0f / 169.0f);
            return value;
        case AccelParabolaD: // 25
            value = value - 0.38f;
            value = (value * value / 0.3844f - 361.0f / 961.0f) / (600.0f / 961.0f);
            return value;
        case AccelParabolaE: // 26
            value = value - 0.4f;
            value = (value * value / 0.36f - 4.0f / 9.0f) / (5.0f / 9.0f);
            return value;
        case DecelParabolaA: // 27
            value = 1.0f - value;
            value = value - 0.25f;
            value = (value * value / (9.0f / 16.0f) - 1.0f / 9.0f) / (8.0f / 9.0f);
            value = 1.0f - value;
            return value;
        case DecelParabolaB: // 28
            value = 1.0f - value;
            value = value - 0.3f;
            value = (value * value / 0.49f - 9.0f / 49.0f) / (40.0f / 49.0f);
            value = 1.0f - value;
            return value;
        case DecelParabolaC: // 29
            value = 1.0f - value;
            value = value - 0.35f;
            value = (value * value / 0.4225f - 49.0f / 169.0f) / (120.0f / 169.0f);
            value = 1.0f - value;
            return value;
        case DecelParabolaD: // 30
            value = 1.0f - value;
            value = value - 0.38f;
            value = (value * value / 0.3844f - 361.0f / 961.0f) / (600.0f / 961.0f);
            value = 1.0f - value;
            return value;
        case DecelParabolaE: // 31
            value = 1.0f - value;
            value = value - 0.4f;
            value = (value * value / 0.36f - 4.0f / 9.0f) / (5.0f / 9.0f);
            value = 1.0f - value;
            return value;
        case ForceFinal: interp_final: // 16
            return 1.0f;
        case ForceInitial: // 15
            return 0.0f;
    }
}

template <typename T>
struct ZUNInterp { //       0x58    0x44    0x30
    //                      T3      T2      T1
    T initial_value; //     0x0     0x0     0x0
    T final_value; //       0xC     0x8     0x4
    T bezier1; //           0x18    0x10    0x8
    T bezier2; //           0x24    0x18    0xC
    T current; //           0x30    0x20    0x10
    Timer time; //          0x3C    0x28    0x14
    int32_t end_time; //    0x50    0x3C    0x28
    int32_t mode; //        0x54    0x40    0x2C

    inline ZUNInterp<T>() : end_time(0) {}

    // float: 0x41F600
    // Float2: 0x439600
    // Float3: 0x405A00
    // Float3Ex: 0x439940
    // ZUNAngle: 0x47CBF0
    dllexport gnu_noinline void set_end_time(int32_t time) {
        this->end_time = time;
    }
    
    // Float3Ex: 0x439950
    dllexport gnu_noinline void set_current(const T& value) {
        this->current = value;
    }
    
    // float: 0x41B790
    // Float2: 0x4395C0
    // Float3Ex: 0x439900
    dllexport gnu_noinline void reset_end_time() {
        this->end_time = 0;
    }

    // float: 0x41F630
    // Float2: 0x439690
    // Float3: 0x405A10
    // ZUNAngle: 0x47CC40
    dllexport gnu_noinline void set_mode(int32_t mode) {
        this->mode = mode;
    }

    // float: 0x41F620
    // Float2: 0x439670
    // Float3: 0x405A20
    // ZUNAngle: 0x47CC30
    dllexport gnu_noinline void set_initial_value(const T& value) {
        this->initial_value = value;
    }

    // float: 0x41F610
    // Float2: 0x439650
    // Float3: 0x405A40
    // Float3Ex: 0x4399B0
    // ZUNAngle: 0x47CC20
    dllexport gnu_noinline void set_final_value(const T& value) {
        this->final_value = value;
    }

    // float: 0x429A70
    // Float3: 0x405A60
    // Float3Ex: 0x439990
    // ZUNAngle: 0x47CC10
    dllexport gnu_noinline void set_bezier1(const T& value) {
        this->bezier1 = value;
    }

    // float: 0x429A60
    // Float3: 0x405A80
    // Float3Ex: 0x439970
    // ZUNAngle: 0x47CC00
    dllexport gnu_noinline void set_bezier2(const T& value) {
        this->bezier2 = value;
    }

    // float: 0x41F5D0
    // Float2: 0x4395D0
    // Float3: 0x405AA0
    // Float3Ex: 0x439910
    // ZUNAngle: 0x47CBC0
    dllexport gnu_noinline void reset_timer() {
        this->time.reset();
    }
    
    // int: 0x47CF40
    // float: 0x41F640
    // Float2: 0x4396A0
    // ZUNAngle: 0x47CC50
    // StageSky: 0x41EFA0
    dllexport T vectorcall step() {
        int32_t end_time = this->end_time;
        if (end_time > 0) {
            this->time.increment();
            end_time = this->end_time;
            if (this->time >= end_time) {
                this->time.set(end_time);
                goto TimeEnd;
            }
        } else if (end_time == 0) {
TimeEnd:
            int32_t mode = this->mode;
            if (mode != ConstantVelocity && mode != ConstantAccel) {
                return this->final_value;
            } else {
                return this->initial_value;
            }
        }
        T initial = this->initial_value;
        int32_t mode = this->mode;
        if (mode == ConstantVelocity) { // 7
            return this->current = this->initial_value = initial + this->final_value;
        }
        if (mode == ConstantAccel) { // 17
            T temp = this->bezier2;
            this->bezier2 = temp + this->final_value;
            return this->current = this->initial_value = initial + temp;
        }
        float current_time = this->time.current_f;
        float end_time_f = end_time;
        if (mode == Bezier) { // 8
            current_time /= end_time_f;
            float XMM3 = 1.0f - current_time;
            float XMM2 = current_time + current_time;
            float XMM5 = current_time - 1.0f;
            XMM3 *= XMM3;
            initial *= XMM5 * XMM5 * (XMM2 + 1.0f);
            initial += (3.0f - XMM2) * this->final_value * current_time * current_time;
            initial += XMM3 * this->bezier1 * current_time;
            initial += XMM5 * this->bezier2 * current_time * current_time;
            return this->current = initial;
        }
        else {
            float interp_value = __interp_inner_thing(mode, current_time, end_time_f);
            return this->current = lerp(initial, this->final_value, interp_value);
        }
    }

    forceinline void initialize(int32_t end_time, int32_t mode, const T& initial_value, const T& final_value) {
        const T zero = {};
        this->set_end_time(end_time);
        this->set_mode(mode);
        this->set_bezier1(zero);
        this->set_bezier2(zero);
        this->set_initial_value(initial_value);
        this->set_final_value(final_value);
        this->reset_timer();
    }

    forceinline void initialize_bezier(int32_t end_time, int32_t mode, const T& initial_value, const T& final_value, const T& bezier1_value, const T& bezier2_value) {
        this->set_end_time(end_time);
        this->set_mode(mode);
        this->set_bezier1(bezier1_value);
        this->set_bezier2(bezier2_value);
        this->set_initial_value(initial_value);
        this->set_final_value(final_value);
        this->reset_timer();
    }
};
#pragma region // ZUNInterp Validation
ValidateFieldOffset32(0x0, ZUNInterp<float>, initial_value);
ValidateFieldOffset32(0x4, ZUNInterp<float>, final_value);
ValidateFieldOffset32(0x8, ZUNInterp<float>, bezier1);
ValidateFieldOffset32(0xC, ZUNInterp<float>, bezier2);
ValidateFieldOffset32(0x10, ZUNInterp<float>, current);
ValidateFieldOffset32(0x14, ZUNInterp<float>, time);
ValidateFieldOffset32(0x28, ZUNInterp<float>, end_time);
ValidateFieldOffset32(0x2C, ZUNInterp<float>, mode);
ValidateStructSize32(0x30, ZUNInterp<float>);
ValidateFieldOffset32(0x0, ZUNInterp<Float2>, initial_value);
ValidateFieldOffset32(0x8, ZUNInterp<Float2>, final_value);
ValidateFieldOffset32(0x10, ZUNInterp<Float2>, bezier1);
ValidateFieldOffset32(0x18, ZUNInterp<Float2>, bezier2);
ValidateFieldOffset32(0x20, ZUNInterp<Float2>, current);
ValidateFieldOffset32(0x28, ZUNInterp<Float2>, time);
ValidateFieldOffset32(0x3C, ZUNInterp<Float2>, end_time);
ValidateFieldOffset32(0x40, ZUNInterp<Float2>, mode);
ValidateStructSize32(0x44, ZUNInterp<Float2>);
ValidateFieldOffset32(0x0, ZUNInterp<Float3>, initial_value);
ValidateFieldOffset32(0xC, ZUNInterp<Float3>, final_value);
ValidateFieldOffset32(0x18, ZUNInterp<Float3>, bezier1);
ValidateFieldOffset32(0x24, ZUNInterp<Float3>, bezier2);
ValidateFieldOffset32(0x30, ZUNInterp<Float3>, current);
ValidateFieldOffset32(0x3C, ZUNInterp<Float3>, time);
ValidateFieldOffset32(0x50, ZUNInterp<Float3>, end_time);
ValidateFieldOffset32(0x54, ZUNInterp<Float3>, mode);
ValidateStructSize32(0x58, ZUNInterp<Float3>);
#pragma endregion

template <typename T, typename E>
struct ZUNInterpExImpl { //                 0x68    0x50
    static inline constexpr size_t AXIS_COUNT = sizeof(T) / sizeof(E);
    T current; //                       0x0     0x0
    T initial_value; //                 0xC     0x8
    T final_value; //                   0x18    0x10
    T bezier1; //                       0x24    0x18
    T bezier2; //                       0x30    0x20
    Timer time; //                      0x3C    0x28
    int32_t end_time; //                0x50    0x3C
    int32_t axis_modes[AXIS_COUNT]; //  0x54    0x40
    int32_t combined_mode; //           0x60    0x48
    union {
        uint32_t flags; //              0x64    0x4C
        struct {
            uint32_t interp_per_axis : 1; // 1
        };
    };

    inline ZUNInterpExImpl<T, E>() : end_time(0) {}

    // Float3: 0x439940
    dllexport gnu_noinline void set_end_time(int32_t time) {
        this->end_time = time;
    }

    // Float3: 0x439900
    dllexport gnu_noinline void reset_end_time() {
        this->end_time = 0;
    }

    // Float3: 0x4399B0
    dllexport gnu_noinline void set_initial_value(const T& value) {
        this->initial_value = value;
    }

    // Float3: 0x439990
    dllexport gnu_noinline void set_final_value(const T& value) {
        this->final_value = value;
    }

    // Float3: 0x439970
    dllexport gnu_noinline void set_bezier1(const T& value) {
        this->bezier1 = value;
    }

    // Float3: 0x439950
    dllexport gnu_noinline void set_bezier2(const T& value) {
        this->bezier2 = value;
    }

    // Float3: 0x439910
    dllexport gnu_noinline void reset_timer() {
        this->time.reset();
    }
    
    // Float3: 0x4399D0
    dllexport gnu_noinline void set_axis_mode(int32_t axis, int32_t mode) {
        this->interp_per_axis = true;
        this->axis_modes[axis] = mode;
    }
    
    // Float3: 0x4399F0
    dllexport gnu_noinline void set_combined_mode(int32_t mode) {
        this->interp_per_axis = false;
        this->combined_mode = mode;
    }

    // Float3: 0x439A10
    dllexport T vectorcall step() {
        int32_t end_time = this->end_time;
        if (end_time > 0) {
            this->time.increment();
            end_time = this->end_time;
            if (this->time >= end_time) {
                this->time.set(end_time);
                goto TimeEnd;
            }
        } else if (end_time == 0) {
TimeEnd:
            int32_t mode = this->combined_mode;
            if (mode != ConstantVelocity && mode != ConstantAccel) {
                return this->final_value;
            } else {
                return this->initial_value;
            }
        }
        if (!this->interp_per_axis) {
            int32_t mode = this->combined_mode;
            if (mode == ConstantVelocity) { // 7
                T initial = this->initial_value;
                return this->current = this->initial_value = initial + this->final_value;
            }
            if (mode == ConstantAccel) { // 17
                T initial = this->initial_value;
                T temp = this->bezier2;
                this->bezier2 = temp + this->final_value;
                return this->current = this->initial_value = initial + temp;
            }
            float current_time = this->time.current_f;
            float end_time_f = end_time;
            if (mode == Bezier) { // 8
                current_time /= end_time_f;
                float XMM3 = 1.0f - current_time;
                float XMM2 = current_time + current_time;
                float XMM5 = current_time - 1.0f;
                XMM3 *= XMM3;
                T initial = this->initial_value;
                initial *= XMM5 * XMM5 * (XMM2 + 1.0f);
                initial += (3.0f - XMM2) * this->final_value * current_time * current_time;
                initial += XMM3 * this->bezier1 * current_time;
                initial += XMM5 * this->bezier2 * current_time * current_time;
                return this->current = initial;
            }
            else {
                float interp_value = __interp_inner_thing(mode, current_time, end_time_f);
                return this->current = lerp(this->initial_value, this->final_value, interp_value);
            }
        }
        else {
            for (size_t i = 0; i < AXIS_COUNT; ++i) {
                E& current = ((E*)&this->current)[i];
                E& initial_value = ((E*)&this->initial_value)[i];
                E& final_value = ((E*)&this->final_value)[i];
                E& bezier1 = ((E*)&this->bezier1)[i];
                E& bezier2 = ((E*)&this->bezier2)[i];

                int32_t mode = this->axis_modes[i];
                if (mode == ConstantVelocity) { // 7
                    current = initial_value = initial_value + final_value;
                }
                else if (mode == ConstantAccel) { // 17
                    E temp = bezier2;
                    bezier2 = temp + final_value;
                    current = initial_value = initial_value + temp;
                }
                else {
                    float end_time_f = end_time;
                    E final_val = final_value;
                    float current_time = this->time.current_f;
                    if (mode == Bezier) { // 8
                        current_time /= end_time_f;
                        float XMM3 = 1.0f - current_time;
                        float XMM2 = current_time + current_time;
                        float XMM5 = current_time - 1.0f;
                        XMM3 *= XMM3;
                        E initial = initial_value;
                        initial *= XMM5 * XMM5 * (XMM2 + 1.0f);
                        initial += (3.0f - XMM2) * final_val * current_time * current_time;
                        initial += XMM3 * bezier1 * current_time;
                        initial += XMM5 * bezier2 * current_time * current_time;
                        current = initial;
                    }
                    else {
                        float interp_value = __interp_inner_thing(mode, current_time, end_time_f);
                        current = lerp(initial_value, final_val, interp_value);
                    }
                }
            }
            return this->current;
        }
    }
};
template <typename T> struct ZUNInterpEx;
template <> struct ZUNInterpEx<Float2> : ZUNInterpExImpl<Float2, float> {};
template <> struct ZUNInterpEx<Float3> : ZUNInterpExImpl<Float3, float> {};
template <> struct ZUNInterpEx<Int2> : ZUNInterpExImpl<Int2, int32_t> {};
template <> struct ZUNInterpEx<Int3> : ZUNInterpExImpl<Int3, int32_t> {};
#pragma region // ZUNInterpEx Validation
ValidateFieldOffset32(0x0, ZUNInterpEx<Float2>, current);
ValidateFieldOffset32(0x8, ZUNInterpEx<Float2>, initial_value);
ValidateFieldOffset32(0x10, ZUNInterpEx<Float2>, final_value);
ValidateFieldOffset32(0x18, ZUNInterpEx<Float2>, bezier1);
ValidateFieldOffset32(0x20, ZUNInterpEx<Float2>, bezier2);
ValidateFieldOffset32(0x28, ZUNInterpEx<Float2>, time);
ValidateFieldOffset32(0x3C, ZUNInterpEx<Float2>, end_time);
ValidateFieldOffset32(0x40, ZUNInterpEx<Float2>, axis_modes);
ValidateFieldOffset32(0x48, ZUNInterpEx<Float2>, combined_mode);
ValidateFieldOffset32(0x4C, ZUNInterpEx<Float2>, flags);
ValidateStructSize32(0x50, ZUNInterpEx<Float2>);
ValidateFieldOffset32(0x0, ZUNInterpEx<Float3>, current);
ValidateFieldOffset32(0xC, ZUNInterpEx<Float3>, initial_value);
ValidateFieldOffset32(0x18, ZUNInterpEx<Float3>, final_value);
ValidateFieldOffset32(0x24, ZUNInterpEx<Float3>, bezier1);
ValidateFieldOffset32(0x30, ZUNInterpEx<Float3>, bezier2);
ValidateFieldOffset32(0x3C, ZUNInterpEx<Float3>, time);
ValidateFieldOffset32(0x50, ZUNInterpEx<Float3>, end_time);
ValidateFieldOffset32(0x54, ZUNInterpEx<Float3>, axis_modes);
ValidateFieldOffset32(0x60, ZUNInterpEx<Float3>, combined_mode);
ValidateFieldOffset32(0x64, ZUNInterpEx<Float3>, flags);
ValidateStructSize32(0x68, ZUNInterpEx<Float3>);
#pragma endregion

#define SetInstr(value) \
current_instruction = (decltype(current_instruction))(value)

#define IndexInstr(offset) \
SetInstr((intptr_t)current_instruction + (offset))

#define ByteArg(number) \
(((uint8_t*)current_instruction->args)[(number)])

#define OneBitArg(number) \
(ByteArg(number) & 0b1)

#define ShortArg(number) \
(((int16_t*)current_instruction->args)[(number)])

#define RawArg(number) \
(((EclArg*)current_instruction->args)[(number)])

#define IntArg(number) \
(((int32_t*)current_instruction->args)[(number)])

#define UIntArg(number) \
(((uint32_t*)current_instruction->args)[(number)])

#define FloatArg(number) \
(((float*)current_instruction->args)[(number)])

#define Float2Arg(number) \
(((Float2*)current_instruction->args)[(number)])

#define Float3Arg(number) \
(((Float3*)current_instruction->args)[(number)])

#define StringArg(offset) \
((const char*)(current_instruction->args + (offset)))

#define TypeArg(type, number) \
(((type*)current_instruction->args)[(number)])

typedef struct EclVM EclVM;

// size: 0x54
struct EnemyInitData {
    Float3 position; // 0x0
    int32_t score; // 0xC
    int32_t item_drop; // 0x10
    int32_t life; // 0x14
    int32_t mirrored; // 0x18
    int32_t __basic_anm_update; // 0x1C
    int32_t int_vars[4]; // 0x20
    float float_vars[8]; // 0x30
    int32_t parent_id; // 0x50
};
#pragma region // EnemyInitData Validation
ValidateFieldOffset32(0x0, EnemyInitData, position);
ValidateFieldOffset32(0xC, EnemyInitData, score);
ValidateFieldOffset32(0x10, EnemyInitData, item_drop);
ValidateFieldOffset32(0x14, EnemyInitData, life);
ValidateFieldOffset32(0x18, EnemyInitData, mirrored);
ValidateFieldOffset32(0x1C, EnemyInitData, __basic_anm_update);
ValidateFieldOffset32(0x20, EnemyInitData, int_vars);
ValidateFieldOffset32(0x30, EnemyInitData, float_vars);
ValidateFieldOffset32(0x50, EnemyInitData, parent_id);
ValidateStructSize32(0x54, EnemyInitData);
#pragma endregion

// size: 0x10
struct EclInstruction {
    int32_t time; // 0x0
    int16_t opcode; // 0x4
    uint16_t offset_to_next; // 0x6
    uint16_t param_mask; // 0x8
    uint8_t difficulty_mask; // 0xA
    uint8_t param_count; // 0xB
    uint8_t stack_adjust; // 0xC
    padding_bytes(0x3); // 0xD
    unsigned char args[]; // 0x10
};
#pragma region // EclInstruction Validation
ValidateFieldOffset32(0x0, EclInstruction, time);
ValidateFieldOffset32(0x4, EclInstruction, opcode);
ValidateFieldOffset32(0x6, EclInstruction, offset_to_next);
ValidateFieldOffset32(0x8, EclInstruction, param_mask);
ValidateFieldOffset32(0xA, EclInstruction, difficulty_mask);
ValidateFieldOffset32(0xB, EclInstruction, param_count);
ValidateFieldOffset32(0xC, EclInstruction, stack_adjust);
ValidateFieldOffset32(0x10, EclInstruction, args);
ValidateStructSize32(0x10, EclInstruction);
#pragma endregion

#define EclStackCount 0x400
#define EclStackSize sizeof(EclStackItem[EclStackCount])

// size: 0x8
struct EclLocation {
    int32_t sub_index; // 0x0
    int32_t instruction_offset; // 0x4

    inline void reset() {
        this->instruction_offset = -1;
        this->sub_index = -1;
    }
};
#pragma region // EclLocation Validation
ValidateFieldOffset32(0x0, EclLocation, sub_index);
ValidateFieldOffset32(0x4, EclLocation, instruction_offset);
ValidateStructSize32(0x8, EclLocation);
#pragma endregion

typedef char EclSubName[64];

union EclRawValue {
    int32_t integer;
    float real;
    struct {
        char type;
        char type2;
    };
};

struct EclValue {
    char type;
    char type2;
    EclRawValue value;

    template<typename T>
    static forceinline T cast_to(const int32_t& value, const char& type) {
        if constexpr (std::is_same_v<T, int32_t>) {
            if (type == 'f') {
                return bitcast<int32_t>((float)value);
            } else {
                return value;
            }
        } else if constexpr (std::is_same_v<T, float>) {
            if (type != 'f' && type == 'i') {
                return (float)value;
            } else {
                return bitcast<float>(value);
            }
        }
    }

    template<typename T>
    forceinline T read() {
        return this->cast_to<T>(this->value.integer, this->type);
    }
};

using EclStackItem = EclRawValue;

// size: 0x1008
struct EclStack {

    union { // 0x0
        EclStackItem data[EclStackCount];
        uint8_t raw[EclStackSize];
    };
    int32_t pointer; // 0x1000
    int32_t base; // 0x1004

    template<typename T>
    forceinline T read_offset(int32_t offset) {
        return *based_pointer<T>(this->raw, offset);
    }
    template<typename T>
    forceinline T read_typed_offset(int32_t offset) {
        return based_pointer<EclValue>(this->raw, offset)->read<T>();
    }
    template<typename T>
    forceinline T read_local(int32_t offset, int32_t base_offset) {
        return this->read_offset<T>(base_offset + offset);
    }
    template<typename T>
    forceinline T read_local(T offset) {
        return this->read_local<T>((int32_t)offset, this->base);
    }
    /*
    template<typename T>
    forceinline T read_temp(int32_t offset, int32_t top_offset) {
        return this->read_offset<T>(top_offset - offset);
    }
    template<typename T>
    forceinline T read_temp(int32_t offset) {
        return this->read_temp<T>(offset, this->pointer);
    }
    */
    template<typename T>
    forceinline T read_temp(T index, int32_t top_offset);
    template<>
    forceinline int32_t read_temp<int32_t>(int32_t index, int32_t top_offset) {
        return this->read_typed_offset<int32_t>(top_offset + index * sizeof(EclValue));
    }
    template<>
    forceinline float read_temp<float>(float index, int32_t top_offset) {
        index *= -(float)sizeof(EclValue);
        return this->read_typed_offset<float>(top_offset - (int32_t)index);
    }

    template<typename T>
    forceinline T read_temp(T index) {
        return this->read_temp<T>(index, this->pointer);
    }

    template<typename T>
    forceinline void write_offset(int32_t offset, const T& value) {
        *based_pointer<T>(this->raw, offset) = value;
    }
    template<typename T>
    forceinline void write_local(int32_t offset, const T& value, int32_t base_offset) {
        this->write_offset<T>(base_offset + offset, value);
    }
    template<typename T>
    forceinline void write_local(T offset, const T& value) {
        this->write_local<T>((int32_t)offset, value, this->base);
    }
    
    template<typename T>
    forceinline void write_temp(int32_t index, const T& value, int32_t top_offset) {
        this->write_offset<T>(top_offset - index * sizeof(int32_t), value);
    }
    template<typename T>
    forceinline void write_temp(int32_t index, const T& value) {
        this->write_temp<T>(index, value, this->pointer);
    }
    

    template<typename T>
    forceinline T& ref_offset(int32_t offset) {
        return *based_pointer<T>(this->raw, offset);
    }
    template<typename T>
    forceinline T& ref_local(int32_t offset, int32_t base_offset) {
        return this->ref_offset<T>(base_offset + offset);
    }
    template<typename T>
    forceinline T& ref_local(T offset) {
        return this->ref_local<T>((int32_t)offset, this->base);
    }
    
    template<typename T>
    forceinline T& ref_temp(int32_t index, int32_t top_offset) {
        return this->ref_offset<T>(top_offset - index * sizeof(int32_t));
    }
    template<typename T>
    forceinline T& ref_temp(int32_t index) {
        return this->ref_temp<T>(index, this->pointer);
    }
    

    template<typename T>
    forceinline void push(int32_t& starting_offset, const T& value) {
        this->write_offset(starting_offset, value);
        starting_offset += sizeof(int32_t);
    }

    template<typename T>
    forceinline void push(const T& value) {
        this->push(this->pointer, value);
    }

    template<typename T>
    forceinline T pop(int32_t& starting_offset) {
        starting_offset -= sizeof(int32_t);
        return this->read_offset<T>(starting_offset);
    }
    template<typename T>
    forceinline T pop() {
        return this->pop<T>(this->pointer);
    }

    template<typename T>
    forceinline T pop_cast(int32_t& starting_offset) {
        return EclValue::cast_to<T>(this->pop<int32_t>(), this->pop<char>());
    }
    template<typename T>
    forceinline T pop_cast() {
        return this->pop_cast<T>(this->pointer);
    }
    
    template<typename L> requires(FunctionTraitsType<L>::arg_count == 1)
    void unary_op(const L& func) {
        using T = typename FunctionTraitsType<L>::template nth_arg_type<0>;
        using P = typename FunctionTraitsType<L>::ret_type;
        this->push<P>(func(this->pop_cast<T>()));
    }

    template<typename L> requires(FunctionTraitsType<L>::arg_count == 2 && std::is_same_v<typename FunctionTraitsType<L>::template nth_arg_type<0>, typename FunctionTraitsType<L>::template nth_arg_type<1>>)
    void binary_op(const L& func) {
        using T = typename FunctionTraitsType<L>::template nth_arg_type<0>;
        using P = typename FunctionTraitsType<L>::ret_type;
        T right = this->pop_cast<T>();
        T left = this->pop_cast<T>();
        this->push<P>(func(left, right));
    }

    inline ZUNResult enter_frame(int32_t size) {
        int32_t prev_pointer = this->pointer;
        size += prev_pointer;
        if (size >= EclStackSize) {
            return ZUN_ERROR;
        } else {
            this->pointer = size;
            this->push(this->base);
            this->base = prev_pointer;
            return ZUN_SUCCESS;
        }
    }

    ZUNResult leave_frame(void) {
        int32_t new_base = this->pop<int32_t>();
        int32_t new_pointer = this->base;
        this->base = new_base;
        this->pointer = new_pointer;
        if (new_pointer) {
            return ZUN_SUCCESS;
        }
        else {
            return ZUN_ERROR;
        }
    }

    inline void zero_contents() {
        zero_this();
    }

    inline EclStack() {
        this->zero_contents();
    }
};
#pragma region // EclStack Validation
ValidateFieldOffset32(0x0, EclStack, data);
ValidateFieldOffset32(0x1000, EclStack, pointer);
ValidateFieldOffset32(0x1004, EclStack, base);
ValidateStructSize32(0x1008, EclStack);
#pragma endregion

// size: 0x1208
struct EclContext {
    float time; // 0x0
    EclLocation location; // 0x4
    EclStack stack; // 0xC
    int32_t async_id; // 0x1014
    EclVM* vm; // 0x1018
    int32_t __int_101C; // 0x101C
    uint8_t difficulty_mask; // 0x1020
    padding_bytes(3);
    ZUNInterp<float> float_interps[8]; // 0x1024
    int32_t float_interp_stack_offsets[8]; // 0x11A4
    EclLocation float_interp_locations[8]; // 0x11C4
    union {
        uint32_t flags; // 0x1204
        struct {
            uint32_t __unknown_flag_A : 1;
        };
    };
    // 0x1208

    inline void set_float_interp_times(int32_t value) {
        this->float_interps[0].end_time = value;
        this->float_interps[1].end_time = value;
        this->float_interps[2].end_time = value;
        this->float_interps[3].end_time = value;
        this->float_interps[4].end_time = value;
        this->float_interps[5].end_time = value;
        this->float_interps[6].end_time = value;
        this->float_interps[7].end_time = value;
    }

    inline EclInstruction* get_instruction(int32_t sub_index, int32_t instruction_offset);

    // 0x48DBE0
    dllexport EclInstruction* thiscall EclContext::get_current_instruction() asm_symbol_rel(0x48DBE0) {
        int32_t instr_offset = this->location.instruction_offset;
        if (instr_offset != -1) {
            int32_t sub_index = this->location.sub_index;
            if (sub_index != -1) {
                return this->get_instruction(sub_index, instr_offset);
            }
        }
        return NULL;
    }

    inline void step_float_interps();

    forceinline int32_t thiscall get_int_arg(int32_t index, EclInstruction* current_instruction);

    // 0x48D4F0
    dllexport gnu_noinline int32_t thiscall get_int_arg(int32_t index) asm_symbol_rel(0x48D4F0);

    forceinline float vectorcall get_float_arg(int32_t index, EclInstruction* current_instruction);

private:
    // 0x48D5A0
    dllexport gnu_noinline float vectorcall get_float_arg(int, int32_t index) asm_symbol_rel(0x48D5A0);
public:
    forceinline float get_float_arg(int32_t index) {
        return this->get_float_arg(UNUSED_DWORD, index);
    }

    forceinline int32_t thiscall get_int_arg_pop(int32_t index, EclInstruction* current_instruction);

    forceinline int32_t thiscall get_int_arg_pop(int32_t index);

    forceinline float vectorcall get_float_arg_pop(int32_t index, EclInstruction* current_instruction);

    forceinline float vectorcall get_float_arg_pop(int32_t index);

    forceinline int32_t thiscall parse_int_as_arg_pop(int32_t index, int32_t value, EclInstruction* current_instruction);

    // 0x48D690
    dllexport gnu_noinline int32_t thiscall parse_int_as_arg_pop(int32_t index, int32_t value) asm_symbol_rel(0x48D690);

    forceinline float vectorcall parse_float_as_arg_pop(int32_t index, float value, EclInstruction* current_instruction);

    inline float vectorcall parse_float_as_arg_pop(int32_t index, float value);

    forceinline int32_t* thiscall get_int_ptr_arg(int32_t index, EclInstruction* current_instruction);

    // 0x48D750
    dllexport gnu_noinline int32_t* thiscall get_int_ptr_arg(int32_t index = UNUSED_DWORD) asm_symbol_rel(0x48D750);

    forceinline float* thiscall get_float_ptr_arg(int32_t index, EclInstruction* current_instruction);

    // 0x48D7C0
    dllexport gnu_noinline float* thiscall get_float_ptr_arg(int32_t index) asm_symbol_rel(0x48D7C0);

    forceinline int32_t thiscall parse_int_as_arg(int32_t index, int32_t value, EclInstruction* current_instruction);

    forceinline int32_t thiscall parse_int_as_arg(int32_t index, int32_t value);

    forceinline float parse_float_as_arg(int32_t index, float value, EclInstruction* current_instruction);

    forceinline float parse_float_as_arg(int32_t index, float value);

    // 0x42CCC0
    dllexport gnu_noinline EclContext() noexcept(true) {}

    // 0x48B030
    dllexport gnu_noinline ZUNResult thiscall call(EclContext* new_context, int32_t va_index, int32_t = UNUSED_DWORD) asm_symbol_rel(0x48B030);

private:
    // 0x48B3A0
    dllexport gnu_noinline ZUNResult vectorcall low_ecl_run(float, float current_gamespeed) asm_symbol_rel(0x48B3A0);

public:
    forceinline ZUNResult low_ecl_run(float current_gamespeed) {
        return this->low_ecl_run(UNUSED_FLOAT, current_gamespeed);
    }
};
#pragma region // EclContext Validation
ValidateFieldOffset32(0x0, EclContext, time);
ValidateFieldOffset32(0x4, EclContext, location);
ValidateFieldOffset32(0xC, EclContext, stack);
ValidateFieldOffset32(0x1014, EclContext, async_id);
ValidateFieldOffset32(0x1018, EclContext, vm);
ValidateFieldOffset32(0x101C, EclContext, __int_101C);
ValidateFieldOffset32(0x1024, EclContext, float_interps);
ValidateFieldOffset32(0x11A4, EclContext, float_interp_stack_offsets);
ValidateFieldOffset32(0x11C4, EclContext, float_interp_locations);
ValidateFieldOffset32(0x1204, EclContext, flags);
ValidateStructSize32(0x1208, EclContext);
#pragma endregion

using BulletEffectType = enum BulletEffectType : uint32_t;

// size: 0x2C
struct BulletEffectArgs {
    float float_values[4]; // 0x0
    int32_t int_values[4]; // 0x10
    BulletEffectType type; // 0x20
    int32_t async; // 0x24
    const char* string; // 0x28
    // 0x2C
};
#pragma region // BulletEffectArgs Validation
ValidateFieldOffset32(0x0, BulletEffectArgs, float_values);
ValidateFieldOffset32(0x10, BulletEffectArgs, int_values);
ValidateFieldOffset32(0x20, BulletEffectArgs, type);
ValidateFieldOffset32(0x24, BulletEffectArgs, async);
ValidateFieldOffset32(0x28, BulletEffectArgs, string);
ValidateStructSize32(0x2C, BulletEffectArgs);
#pragma endregion

static inline constexpr int32_t BULLET_EFFECT_MAX = 24;

// size: 0x488
struct ShooterData {
    int32_t type; // 0x0
    int32_t color; // 0x4
    Float3 position; // 0x8
    float angle1; // 0x14
    float angle2; // 0x18
    float speed1; // 0x1C
    float speed2; // 0x20
    float distance; // 0x24
    BulletEffectArgs effects[BULLET_EFFECT_MAX]; // 0x28
    float width; // 0x448
    unknown_fields(0xC); // 0x44C
    int32_t start_time; // 0x458
    int32_t __transform_A; // 0x45C
    int32_t duration; // 0x460
    int32_t __transform_B; // 0x464
    int32_t __laser_flags; // 0x468
    int16_t count1; // 0x46C
    int16_t count2; // 0x46E
    int32_t aim_mode; // 0x470
    union {
        uint32_t flags; // 0x474
        struct {
            uint32_t : 5;
            uint32_t play_sound_on_spawn : 1;
        };
    };
    int32_t shoot_sound; // 0x478
    int32_t transform_sound; // 0x47C
    int32_t start_transform; // 0x480
    int __dword_484; // 0x484
    // 0x488

    inline void zero_contents() {
        zero_this();
    }

    inline ShooterData() {
        this->zero_contents();
        this->transform_sound = -1;
    }

    inline ShooterData(int) {}
};
#pragma region // ShooterData Validation
ValidateFieldOffset32(0x0, ShooterData, type);
ValidateFieldOffset32(0x4, ShooterData, color);
ValidateFieldOffset32(0x8, ShooterData, position);
ValidateFieldOffset32(0x14, ShooterData, angle1);
ValidateFieldOffset32(0x18, ShooterData, angle2);
ValidateFieldOffset32(0x1C, ShooterData, speed1);
ValidateFieldOffset32(0x20, ShooterData, speed2);
ValidateFieldOffset32(0x24, ShooterData, distance);
ValidateFieldOffset32(0x28, ShooterData, effects);
ValidateFieldOffset32(0x448, ShooterData, width);
ValidateFieldOffset32(0x458, ShooterData, start_time);
ValidateFieldOffset32(0x45C, ShooterData, __transform_A);
ValidateFieldOffset32(0x460, ShooterData, duration);
ValidateFieldOffset32(0x464, ShooterData, __transform_B);
ValidateFieldOffset32(0x468, ShooterData, __laser_flags);
ValidateFieldOffset32(0x46C, ShooterData, count1);
ValidateFieldOffset32(0x46E, ShooterData, count2);
ValidateFieldOffset32(0x470, ShooterData, aim_mode);
ValidateFieldOffset32(0x474, ShooterData, flags);
ValidateFieldOffset32(0x478, ShooterData, shoot_sound);
ValidateFieldOffset32(0x47C, ShooterData, transform_sound);
ValidateFieldOffset32(0x480, ShooterData, start_transform);
ValidateFieldOffset32(0x484, ShooterData, __dword_484);
ValidateStructSize32(0x488, ShooterData);
#pragma endregion

union EnemyID {
    uint32_t raw;

    inline constexpr operator uint32_t() const {
        return this->raw;
    }
    template<typename T> requires(std::is_integral_v<T>)
        inline constexpr EnemyID& operator=(const T& raw) {
        this->raw = raw;
        return *this;
    }

    // 0x42E0C0
    dllexport gnu_noinline Enemy* thiscall get_enemy_ptr() asm_symbol_rel(0x42E0C0);
};

static inline constexpr uint32_t MAX_CALLBACKS = 8;

// size: 0x88
struct EnemyCallback {
    int32_t life; // 0x0
    int32_t time; // 0x4
    EclSubName life_sub; // 0x8
    EclSubName time_sub; // 0x48

    inline void initialize() {
        this->life = -1;
        this->time = -1;
        this->life_sub[0] = '\0';
    }
};

// WEIRD CALLING CONVENTION
struct HitboxManager {
private:
    // 0x45F0F0
    static dllexport gnu_noinline int32_t vectorcall enm_compute_damage_sources(int32_t, int32_t, float, float, float, Float3* position, Float2* size, float rotation, float radius, int32_t* arg5, Float3* hit_position_out, BOOL arg7, int32_t enemy_id) asm_symbol_rel(0x45F0F0) {
        
    }
public:
    static forceinline int32_t enm_compute_damage_sources(Float3* position, Float2* size, float rotation, float radius, int32_t* arg5, Float3* hit_position_out, BOOL arg7, int32_t enemy_id) {
        return enm_compute_damage_sources(UNUSED_DWORD, UNUSED_DWORD, UNUSED_FLOAT, UNUSED_FLOAT, UNUSED_FLOAT, position, size, rotation, radius, arg5, hit_position_out, arg7, enemy_id);
    }
};

typedef struct AbilityShop AbilityShop;
extern "C" {
    // 0x4CF2A4
    extern AbilityShop* ABILITY_SHOP_PTR asm("_ABILITY_SHOP_PTR");
}

typedef struct BombBase BombBase;
extern "C" {
    // 0x4CF2B8
    extern BombBase* BOMB_PTR asm("_BOMB_PTR");
}

// size: 0xA8
struct BombBase : ZUNTask {
    // void* vftable; // 0x0
    // ZUNTask base; // 0x4
    unknown_fields(0x4); // 0x10
    Float3 __float3_14; // 0x14
    unknown_fields(0x4); // 0x20
    Float3 __float3_24; // 0x24 (only 0x2C is know so far, but it's Z rotation)
    BOOL bomb_active; // 0x30
    Timer __timer_34; // 0x34
    unknown_fields(0x14); // 0x48
    AnmID __vm_id_5C; // 0x5C
    AnmID __vm_id_60; // 0x60
    AnmID __vm_id_64; // 0x64
    unknown_fields(0x8); // 0x68
    void* __ptr_70; // 0x70
    float __float_74; // 0x74
    float __float_78; // 0x78
    Timer __timer_7C; // 0x7C
    int __int_90; // 0x90
    Float3 __float3_94; // 0x94
    int __dword_A0; // 0xA0
    int __int_A4; // 0xA4
    // 0xA8

    inline void zero_contents() {
        zero_this();
    }

    inline BombBase() {
        this->zero_contents();
        this->__unknown_task_flag_A = true;
    }

    // Method 0
    // 0x41FC10
    virtual ~BombBase() {
        this->__vm_id_5C.mark_tree_for_delete();
        this->__vm_id_60.mark_tree_for_delete();
        this->__vm_id_64.mark_tree_for_delete();
        // TODO
        SAFE_FREE(this->__ptr_70);
    }

    // Method 4
    // 0x41FB80
    dllexport gnu_noinline virtual int thiscall activate() {
        return 0;
    }
    // Method 8
    // 0x41FB90
    dllexport gnu_noinline virtual int thiscall on_tick_impl() {
        return 0;
    }
    // Method C
    // 0x41FBA0
    dllexport gnu_noinline virtual int thiscall on_draw_impl() {
        return 0;
    }
    // Method 10
    // 0x41FBB0
    dllexport gnu_noinline virtual int thiscall __method_10(int, int) {
        return 0;
    }
    // Method 14
    // 0x41FBC0
    dllexport gnu_noinline virtual int thiscall __method_14() {
        return 0;
    }
    // Method 18
    // 0x41FBD0
    dllexport gnu_noinline virtual void thiscall __method_18() {
    }

    // 0x41FD40
    dllexport gnu_noinline static void allocate();

    // 0x420040
    dllexport gnu_noinline static UpdateFuncRet fastcall on_tick(void* ptr) {
        BombBase* self = (BombBase*)ptr;
        if (!ABILITY_SHOP_PTR) {
            if (self->__timer_34 < 0) {
                ++self->__timer_34;
            }
            if (self->bomb_active) {
                if (!self->on_tick_impl()) {
                    self->bomb_active = FALSE;
                    return UpdateFuncNext;
                }
                ++self->__timer_34;
            }
        }
        return UpdateFuncNext;
    }

    // 0x420160
    dllexport gnu_noinline static UpdateFuncRet fastcall on_draw(void* ptr) {
        BombBase* self = (BombBase*)ptr;
        self->on_draw_impl();
        if (self->__timer_7C <= 0) {
            self->__float_78 = -1.0f;
            return UpdateFuncNext;
        }
        if (self->__timer_7C <= 60) {
            // TODO
            --self->__timer_7C;
        }
        return UpdateFuncNext;
    }
};

#pragma region // BombBase Validation
ValidateVirtualFieldOffset32(0x30, BombBase, bomb_active);
ValidateStructSize32(0xA8, BombBase);
#pragma endregion

// size: 0x14A0
struct BombReimuAData {
    unknown_fields(0x14A0); // 0x0
    // 0x14A0

    inline void zero_contents() {
        zero_this();
    }

    // 0x4212A0
    dllexport gnu_noinline void thiscall __sub_4212A0() asm_symbol_rel(0x4212A0) {
        // TODO
    }
};

struct BombReimuA : BombBase {
    // Method 4
    // 0x421420
    dllexport gnu_noinline virtual int thiscall activate() {
        // TODO
        //SOUND_MANAGER.play_sound(49);
        // TODO
        //++ENEMY_MANAGER_PTR->player_bomb_count;
        SAFE_FREE(this->__ptr_70);
        this->__ptr_70 = malloc(sizeof(BombReimuAData));
        memset(this->__ptr_70, 0, sizeof(BombReimuAData));
        // TODO
        return 0;
    }
    // Method 8
    // 0x421590
    dllexport gnu_noinline virtual int thiscall on_tick_impl() {
        // TODO
        if (this->__timer_34 >= 120) {
            // TODO
        }
        // TODO
        return 0;
    }
    // Method C
    // 0x422380
    dllexport gnu_noinline virtual int thiscall on_draw_impl() {
        return 1;
    }
    // Method 10
    // 0x422390
    dllexport gnu_noinline virtual int thiscall __method_10(int, int) {
        return 0;
    }
    // Method 14
    // 0x4223A0
    dllexport gnu_noinline virtual int thiscall __method_14() {
        // TODO
        return 0;
    }
    // Method 18
    // 0x41FBD0
    dllexport gnu_noinline virtual void thiscall __method_18() {
        ((BombReimuAData*)this->__ptr_70)->__sub_4212A0();
        this->__vm_id_64.interrupt_tree(1);
        SAFE_FREE(this->__ptr_70);
        // TODO
        this->bomb_active = FALSE;
    }
};

struct BombMarisaA : BombBase {

};

struct BombSakuya : BombBase {

};

struct BombSanaeA : BombBase {

};

// 0x41FD40
dllexport gnu_noinline void BombBase::allocate() {
    BombBase* bomb_ptr;
    switch (GAME_MANAGER.globals.shottype_index()) {
        default:
            bomb_ptr = new BombReimuA();
            break;
        case 1:
            bomb_ptr = new BombMarisaA();
            break;
        case 2:
            bomb_ptr = new BombSakuya();
            break;
        case 3:
            bomb_ptr = new BombSanaeA();
            break;
    }
    UpdateFunc* update_func = new UpdateFunc(&on_tick, true, bomb_ptr);
    UpdateFuncRegistry::register_on_tick(update_func, 25);
    bomb_ptr->on_tick_func = update_func;
    update_func = new UpdateFunc(&on_draw, true, bomb_ptr);
    UpdateFuncRegistry::register_on_draw(update_func, 41);
    bomb_ptr->on_draw_func = update_func;
    bomb_ptr->__timer_34.reset();
    bomb_ptr->__timer_7C.reset();
    bomb_ptr->__float_78 = -1.0f;
    bomb_ptr->__float_74 = 0.0f;
    bomb_ptr->__dword_A0 = 0;
    bomb_ptr->__int_A4 = 0;
    BOMB_PTR = bomb_ptr;
}

// size: 0xC4
struct EnemyDrops {
    int32_t main_id; // 0x0
    int32_t extra_ids[20]; // 0x4
    int32_t limited_extra_ids[20]; // 0x54
    int32_t limited_end_time; // 0xA4
    Timer limited_timer; // 0xA8
    float width; // 0xBC
    float height; // 0xC0
    // 0xC4

    inline void zero_contents() {
        zero_this();
    }

    // 0x42D010
    dllexport gnu_noinline void set_extra_drop(int32_t index, int32_t id) asm_symbol_rel(0x42D010) {
        this->extra_ids[index - 1] = id;
    }

    // 0x42D020
    dllexport gnu_noinline void set_timed_extra_drop(int32_t index, int32_t id) asm_symbol_rel(0x42D020) {
        this->limited_extra_ids[index - 1] = id;
    }

    // 0x42D040
    dllexport gnu_noinline void set_timed_drop_time(int32_t time) asm_symbol_rel(0x42D040) {
        this->limited_end_time = time;
        this->limited_timer.reset();
    }

private:
    // 0x42D090
    dllexport gnu_noinline void vectorcall set_area(float, float width, float height) asm_symbol_rel(0x42D090) {
        this->width = width;
        this->height = height;
    }
public:
    inline void vectorcall set_area(float width, float height) {
        return this->set_area(UNUSED_FLOAT, width, height);
    }

    // 0x42D0B0
    dllexport gnu_noinline void set_main_drop(int32_t id) asm_symbol_rel(0x42D0B0) {
        this->main_id = id;
    }

    // 0x430510
    dllexport gnu_noinline void spawn_extra_items(Float3* position) asm_symbol_rel(0x430510);

    // 0x42D0C0
    dllexport void spawn_items(Float3* position) asm_symbol_rel(0x42D0C0);

    // 0x42D110
    dllexport gnu_noinline void initialize() asm_symbol_rel(0x42D110) {
        this->zero_contents();
        this->height = 32.0f;
        this->width = 32.0f;
        this->limited_timer.reset();
    }

    inline void reset() {
        memset(this->extra_ids, 0, sizeof(EnemyDrops) - sizeof(this->main_id));
        this->height = 32.0f;
        this->width = 32.0f;
        this->main_id = 0;
        this->limited_timer.reset();
    }

    // 0x42D180
    dllexport gnu_noinline void reset_extra_drops() asm_symbol_rel(0x42D180) {
        memset(this->extra_ids, 0, sizeof(this->extra_ids) + sizeof(this->limited_extra_ids));
        this->limited_end_time = 0;
        this->limited_timer.reset();
    }
};

// size: 0x1C
struct EnemyLife {
    int32_t current; // 0x0, 0x4FF4, 0x6220
    int32_t maximum; // 0x4, 0x4FF8, 0x6224
    int32_t remaining_current_attack; // 0x8, 0x4FFC, 0x6228
    int32_t current_scaled_by_seven; // 0xC, 0x5000, 0x622C
    int32_t starting_value_for_next_attack; // 0x10, 0x5004, 0x6230
    int32_t total_damage_including_ignored; // 0x14, 0x5008, 0x6234
    union {
        uint32_t flags; // 0x18, 0x500C, 0x6238
        struct {
            uint32_t is_spell : 1; // 1
            uint32_t __unknown_flag_A : 1; // 2
        };
    };
    // 0x1C

    inline void initialize() {
        this->__unknown_flag_A = false;
        this->current = 0;
        this->maximum = 0;
        this->remaining_current_attack = 0;
        this->total_damage_including_ignored = 0;
    }

    // 0x42CF80
    dllexport gnu_noinline int32_t get_current() asm_symbol_rel(0x42CF80) {
        return this->current;
    }

    // 0x42CF90
    dllexport gnu_noinline void set_current_scaled(int32_t value) asm_symbol_rel(0x42CF90) {
        this->current_scaled_by_seven = value * 7;
    }

    // 0x42CFB0
    dllexport gnu_noinline void set_spell(int32_t value) asm_symbol_rel(0x42CFB0) {
        this->is_spell = value;
    }

    // 0x42CFD0
    dllexport gnu_noinline int32_t get_maximum() asm_symbol_rel(0x42CFD0) {
        return this->maximum;
    }

    // 0x42CFE0
    dllexport gnu_noinline void set_maximum(int32_t value) asm_symbol_rel(0x42CFE0) {
        this->maximum = value;
    }

    // 0x42CFF0
    dllexport gnu_noinline void set_current_remaining(int32_t value) asm_symbol_rel(0x42CFF0) {
        this->remaining_current_attack = value;
    }

    // 0x42D000
    dllexport gnu_noinline void set_current(int32_t value) asm_symbol_rel(0x42D000) {
        this->current = value;
    }

    inline void take_damage(int32_t damage, bool invulnerable) {
        if (!invulnerable) {
            this->total_damage_including_ignored += damage;
            if (this->is_spell) {
                this->current_scaled_by_seven -= damage;
                int32_t next_base = this->starting_value_for_next_attack;
                this->current = next_base + (this->current_scaled_by_seven - next_base * 7) / 7;
            } else {
                this->current -= damage;
            }
        } else {
            this->total_damage_including_ignored += damage;
        }
    }
};

// size: 0x1C
struct EnemyFog {
    void* fog_ptr; // 0x0
    unknown_fields(0x4); // 0x4
    float radius; // 0x8
    float __float_C; // 0xC
    D3DCOLOR color; // 0x10
    float __angle_14; // 0x14
    float __angle_18; // 0x18
    // 0x1C
};

typedef struct EnemyData EnemyData;

typedef int32_t fastcall ExtraDamageFunc(EnemyData* enemy_data, int32_t prev_damage);
typedef int32_t fastcall ExtraHitboxFunc(EnemyData* enemy_data);

// size: 0x5600
struct EnemyData {
    MotionData previous_motion; // 0x0, 0x122C
    MotionData current_motion; // 0x44, 0x1270
    ZUNAbsRel<MotionData> motion; // 0x88, 0x12B4
    Float2 hitbox_size; // 0x110, 0x133C
    Float2 collision_size; // 0x118, 0x1344
    float hitbox_rotation; // 0x120, 0x134C
    AnmID anm_vms[16]; // 0x124, 0x1350
    Float3 anm_positions[16]; // 0x164, 0x1390
    int32_t anm_vm_indices[16]; // 0x224, 0x1450
    int32_t anm_source_index; // 0x264, 0x1490
    int32_t anm_slot_0_source_index; // 0x268, 0x1494
    int32_t anm_slot_0_script; // 0x26C, 0x1498
    int32_t current_anm_script; // 0x270, 0x149C
    int32_t current_anm_pose; // 0x274, 0x14A0
    int32_t kill_id; // 0x278, 0x14A4
    int32_t anm_base_layer; // 0x27C, 0x14A8
    Float3 position_of_last_damage_source_to_hit; // 0x280, 0x14AC
    int32_t int_vars[4]; // 0x28C, 0x14B8
    float float_vars[8]; // 0x29C, 0x14C8
    Timer ecl_time; // 0x2BC, 0x14E8
    Timer boss_timer; // 0x2D0, 0x14FC
    float slowdown; // 0x2E4, 0x1510
    ZUNList<Enemy> global_list_node; // 0x2E8, 0x1514
    ZUNAbsRel<ZUNInterpEx<Float3>> position_interp; // 0x2F8, 0x1524
    ZUNInterp<float> angle_interp_absolute; // 0x3C8, 0x15F4
    ZUNInterp<float> speed_interp_absolute; // 0x3F8, 0x1624
    ZUNInterp<float> angle_interp_relative; // 0x428, 0x1654
    ZUNInterp<float> speed_interp_relative; // 0x458, 0x1684
    ZUNAbsRel<ZUNInterp<Float2>> orbit_radius_interp; // 0x488, 0x16B4
    ZUNAbsRel<ZUNInterp<Float2>> ellipse_interp; // 0x510, 0x173C
    ShooterData shooters[16]; // 0x598, 0x17C4
    int32_t bullet_effect_indices[16]; // 0x4E18, 0x6044
    Float3 shooter_offsets[16]; // 0x4E58, 0x6084
    Float3 shooter_origins[16]; // 0x4F18, 0x6144
    Float2 final_sprite_size; // 0x4FD8, 0x6204
    Float2 move_bounds_center; // 0x4FE0, 0x620C
    Float2 move_bounds_size; // 0x4FE8, 0x6214
    int32_t score; // 0x4FF0, 0x621C
    EnemyLife life; // 0x4FF4, 0x6220
    EnemyDrops drops; // 0x5010, 0x623C
    int32_t __int_50D4; // 0x50D4, 0x6300
    int32_t death_sound; // 0x50D8, 0x6304
    int32_t death_anm_script; // 0x50DC, 0x6308
    int32_t death_anm_index; // 0x50E0, 0x630C
    int32_t __int_50E4; // 0x50E4, 0x6310
    int __dword_50E8; // 0x50E8, 0x6314
    int32_t hit_sound; // 0x50EC, 0x6318
    Timer invulnerable_timer; // 0x50F0, 0x631C
    Timer no_collision_timer; // 0x5104, 0x6330
    Timer __timer_5118; // 0x5118, 0x6344
    float bomb_damage_multiplier; // 0x512C, 0x6358
    union {
        uint32_t flags_low; // 0x5130, 0x635C
        struct {
            uint32_t disable_hitbox : 1; // 1
            uint32_t disable_collision : 1; // 2
            uint32_t offscreen_immune_horizontal : 1; // 3
            uint32_t offscreen_immune_vertical : 1; // 4
            uint32_t invincible : 1; // 5
            uint32_t intangible : 1; // 6
            uint32_t __is_midboss : 1; // 7
            uint32_t no_delete : 1; // 8
            uint32_t always_delete : 1; // 9
            uint32_t grazable : 1; // 10
            uint32_t only_dialogue_delete : 1; // 11
            uint32_t delete_as_bullet : 1; // 12
            uint32_t rectangular_hitbox : 1; // 13
            uint32_t slowdown_immune : 1; // 14
            uint32_t __unknown_flag_E : 1; // 15
            uint32_t __unknown_flag_F : 1; // 16
            uint32_t __unknown_flag_G : 1; // 17
            uint32_t move_bounds_enable : 1; // 18
            uint32_t __unknown_flag_A : 1; // 19
            uint32_t mirrored : 1; // 20
            uint32_t __unknown_flag_I : 1; // 21
            uint32_t __damaged_this_frame : 1; // 22
            uint32_t __delete_related : 1; // 23 like is_boss, but skips something in the GUI code
            uint32_t is_boss : 1; // 24
            uint32_t __unknown_flag_L : 1; // 25
            uint32_t __unknown_flag_B : 1; // 26
            uint32_t __basic_anm_update : 1; // 27
            uint32_t homing_disable : 1; // 28
            uint32_t bomb_shield : 1; // 29
            uint32_t bomb_shield_active : 1; // 30
            uint32_t __unknown_flag_O : 1; // 31
            uint32_t __anm_related_flag_A : 1; // 32
        };
    };
    union {
        uint32_t flags_high; // 0x5134, 0x6360
        struct {
            uint32_t __anm_slowdown_immune : 1; // 1
            uint32_t : 1; // 2
            uint32_t __unknown_flag_P : 1; // 3
        };
    };
    int32_t bombshield_on_anm; // 0x5138, 0x6364
    int32_t bombshield_off_anm; // 0x513C, 0x6368
    int32_t boss_id; // 0x5140, 0x636C
    float player_protect_radius; // 0x5144, 0x6370
    EnemyCallback callbacks[MAX_CALLBACKS]; // 0x5148, 0x6374
    EclVM* vm; // 0x5588, 0x67B4
    EnemyFog fog; // 0x558C, 0x67B8
    EclSubName death_callback_sub; // 0x55A8, 0x67D4
    ZUNResult(thiscall *func_set_func)(EnemyData*); // 0x55E8, 0x6814
    uint32_t __is_func_set_2; // 0x55EC, 0x6818
    ExtraDamageFunc* extra_damage_func; // 0x55F0, 0x681C
    ExtraHitboxFunc* extra_hitbox_func; // 0x55F4, 0x6820
    int32_t chapter; // 0x55F8, 0x6824
    int32_t chapter_spawn_weight; // 0x55FC, 0x6828
    // 0x5600, 0x682C

    inline Enemy* enemy() {
        return (Enemy*)this->vm;
    }

    inline EnemyData() {
        zero_this();
    }

    inline void initialize_callbacks() {
        this->callbacks[0].initialize();
        this->callbacks[1].initialize();
        this->callbacks[2].initialize();
        this->callbacks[3].initialize();
        this->callbacks[4].initialize();
        this->callbacks[5].initialize();
        this->callbacks[6].initialize();
        this->callbacks[7].initialize();
    }

    inline void initialize_anm_vm_slots() {
        this->anm_vm_indices[0] = -1;
        this->anm_vm_indices[1] = -1;
        this->anm_vm_indices[2] = -1;
        this->anm_vm_indices[3] = -1;
        this->anm_vm_indices[4] = -1;
        this->anm_vm_indices[5] = -1;
        this->anm_vm_indices[6] = -1;
        this->anm_vm_indices[7] = -1;
        this->anm_vm_indices[8] = -1;
        this->anm_vm_indices[9] = -1;
        this->anm_vm_indices[10] = -1;
        this->anm_vm_indices[11] = -1;
        this->anm_vm_indices[12] = -1;
        this->anm_vm_indices[13] = -1;
        this->anm_vm_indices[14] = -1;
        this->anm_vm_indices[15] = -1;
    }

    inline void set_anm_vm_slowdowns(const float& slowdown_value);

    inline void initialize(Enemy* enemy);

    // 0x42D1E0
    dllexport gnu_noinline MotionData& get_current_motion() asm_symbol_rel(0x42D1E0) {
        return this->current_motion;
    }

    inline Float3& get_position() {
        return this->get_current_motion().position;
    }

    // 0x42D1F0
    dllexport gnu_noinline EnemyLife& get_life_data() asm_symbol_rel(0x42D1F0) {
        return this->life;
    }

    forceinline bool get_mirror_flag() {
        return this->mirrored;
    }

    inline bool flags_allow_kill() {
        return !(this->is_boss | this->__delete_related | this->intangible | this->no_delete | this->only_dialogue_delete) ||
                this->always_delete;
    }

    inline bool has_active_hitbox() {
        return !(this->disable_hitbox | this->intangible);
    }

    inline bool has_active_collision() {
        return !(this->disable_collision | this->intangible) && this->no_collision_timer <= 0;
    }

    inline bool is_invulnerable() {
        return this->invincible || this->invulnerable_timer > 0;
    }

    inline void enforce_move_bounds() {
        if (this->move_bounds_enable) {
            float x_limit_size = this->move_bounds_size.x * 0.5f;
            float x_limit_pos = this->move_bounds_center.x;
            float x_pos = this->current_motion.position.x;
            {
                float temp = x_limit_pos - x_limit_size;
                if (temp > x_pos) {
                    this->current_motion.position.x = temp;
                } else {
                    temp = x_limit_pos + x_limit_size;
                    if (x_pos > temp) {
                        this->current_motion.position.x = temp;
                    }
                }
            }
            float y_limit_size = this->move_bounds_size.y * 0.5f;
            float y_limit_pos = this->move_bounds_center.y;
            float y_pos = this->current_motion.position.y;
            {
                float temp = y_limit_pos - y_limit_size;
                if (temp > y_pos) {
                    this->current_motion.position.y = temp;
                } else {
                    temp = y_limit_pos + y_limit_size;
                    if (y_pos > temp) {
                        this->current_motion.position.y = temp;
                    }
                }
            }
            this->motion.absolute.position = this->current_motion.position - this->motion.relative.position;
        }
    }

    // 0x42EC00
    dllexport gnu_noinline void update_current_motion() asm_symbol_rel(0x42EC00) {
        this->current_motion.axis_velocity = this->motion.relative.position + this->motion.absolute.position - this->current_motion.position;
        this->current_motion.update();
        this->enforce_move_bounds();
    }

    inline ZUNResult run_ecl();

    // 0x430D40
    dllexport gnu_noinline int32_t thiscall high_ecl_run() asm_symbol_rel(0x430D40);

    // 0x438AA0
    dllexport gnu_noinline int32_t thiscall get_int_arg(int32_t index) asm_symbol_rel(0x438AA0);

    // 0x438AC0
    dllexport gnu_noinline int32_t* thiscall get_int_ptr_arg(int32_t index = UNUSED_DWORD) asm_symbol_rel(0x438AC0);

private:
    // 0x438AD0
    dllexport gnu_noinline float vectorcall get_float_arg(int32_t, int32_t index) asm_symbol_rel(0x438AD0);

public:
    forceinline float get_float_arg(int32_t index) {
        return this->get_float_arg(UNUSED_DWORD, index);
    }

    // 0x438AF0
    dllexport gnu_noinline float* thiscall get_float_ptr_arg(int32_t index) asm_symbol_rel(0x438AF0);

    // 0x438B10
    dllexport gnu_noinline int32_t thiscall parse_int_as_arg(int32_t index, int32_t value) asm_symbol_rel(0x438B10);

private:
    // 0x438BC0
    dllexport gnu_noinline float vectorcall parse_float_as_arg(int32_t, int32_t index, float, float, float value) asm_symbol_rel(0x438BC0);

public:
    forceinline float parse_float_as_arg(int32_t index, float value) {
        return this->parse_float_as_arg(UNUSED_DWORD, index, UNUSED_FLOAT, UNUSED_FLOAT, value);
    }

    // 0x4369E0
    dllexport gnu_noinline int32_t thiscall ecl_enm_create() asm_symbol_rel(0x4369E0);

    // 0x42E5A0
    dllexport gnu_noinline ZUNResult thiscall __move() asm_symbol_rel(0x42E5A0) {
        clang_noinline this->previous_motion = this->current_motion;
        // TODO: Finish this function and all the giga-jank in it

        return ZUN_SUCCESS;
    }

    forceinline ZUNResult thiscall update();

    // 0x42ED40
    dllexport gnu_noinline ZUNResult thiscall __update_state() asm_symbol_rel(0x42ED40);

    // 0x42F890
    dllexport gnu_noinline void thiscall __update_fog() asm_symbol_rel(0x42F890) {

    }

    // 0x42FF80
    dllexport gnu_noinline ZUNResult thiscall on_tick() asm_symbol_rel(0x42FF80);
    
    // 0x439480
    dllexport gnu_noinline static int32_t fastcall extra_damage_func1(EnemyData* enemy_data, int32_t prev_damage) asm_symbol_rel(0x439480) {
        int32_t new_damage = enemy_data->int_vars[3];
        if (new_damage > 0) {
            new_damage += prev_damage;
            enemy_data->int_vars[3] = 0;
            return new_damage;
        } else {
            return prev_damage;
        }
    }
    
    // 0x4394A0
    dllexport gnu_noinline static int32_t fastcall extra_damage_func2(EnemyData* enemy_data, int32_t prev_damage) asm_symbol_rel(0x4394A0);

    // 0x436BB0
    dllexport gnu_noinline void thiscall anm_set_slot_impl() asm_symbol_rel(0x436BB0);

    inline void thiscall anm_set_slot_main_impl();

    inline void thiscall anm_play_main_impl();

    inline void thiscall anm_play_attack_impl();

    inline void thiscall anm_play_attack_ex_impl();

    template <bool sanity_check_script>
    inline float kill_effects();

    template <bool inline_calls = true>
    inline void add_spawn_weight_to_chapter_destroy() {
        if constexpr (inline_calls) {
            if (
                this->chapter_spawn_weight &&
                this->chapter == GAME_MANAGER.globals.chapter
            ) {
                GAME_MANAGER.globals.__int_90 += this->chapter_spawn_weight;
                this->chapter_spawn_weight = 0;
            }
        }
        else {
            if (
                this->chapter_spawn_weight &&
                this->chapter == GAME_MANAGER.get_chapter()
            ) {
                GAME_MANAGER.globals.__add_to_int_90(this->chapter_spawn_weight);
                this->chapter_spawn_weight = 0;
            }
        }
    }

    inline void reinitialize_vm_with_sub(const char* sub_name);
};
#pragma region // EnemyData Field Validation
ValidateFieldOffset32(0x0, EnemyData, previous_motion);
ValidateFieldOffset32(0x44, EnemyData, current_motion);
ValidateFieldOffset32(0x88, EnemyData, motion);
ValidateFieldOffset32(0x110, EnemyData, hitbox_size);
ValidateFieldOffset32(0x118, EnemyData, collision_size);
ValidateFieldOffset32(0x120, EnemyData, hitbox_rotation);
ValidateFieldOffset32(0x124, EnemyData, anm_vms);
ValidateFieldOffset32(0x164, EnemyData, anm_positions);
ValidateFieldOffset32(0x224, EnemyData, anm_vm_indices);
ValidateFieldOffset32(0x264, EnemyData, anm_source_index);
ValidateFieldOffset32(0x268, EnemyData, anm_slot_0_source_index);
ValidateFieldOffset32(0x26C, EnemyData, anm_slot_0_script);
ValidateFieldOffset32(0x270, EnemyData, current_anm_script);
ValidateFieldOffset32(0x274, EnemyData, current_anm_pose);
ValidateFieldOffset32(0x278, EnemyData, kill_id);
ValidateFieldOffset32(0x27C, EnemyData, anm_base_layer);
ValidateFieldOffset32(0x280, EnemyData, position_of_last_damage_source_to_hit);
ValidateFieldOffset32(0x28C, EnemyData, int_vars);
ValidateFieldOffset32(0x29C, EnemyData, float_vars);
ValidateFieldOffset32(0x2BC, EnemyData, ecl_time);
ValidateFieldOffset32(0x2D0, EnemyData, boss_timer);
ValidateFieldOffset32(0x2E4, EnemyData, slowdown);
ValidateFieldOffset32(0x2E8, EnemyData, global_list_node);
ValidateFieldOffset32(0x2F8, EnemyData, position_interp);
ValidateFieldOffset32(0x3C8, EnemyData, angle_interp_absolute);
ValidateFieldOffset32(0x3F8, EnemyData, speed_interp_absolute);
ValidateFieldOffset32(0x428, EnemyData, angle_interp_relative);
ValidateFieldOffset32(0x458, EnemyData, speed_interp_relative);
ValidateFieldOffset32(0x488, EnemyData, orbit_radius_interp);
ValidateFieldOffset32(0x510, EnemyData, ellipse_interp);
ValidateFieldOffset32(0x598, EnemyData, shooters);
ValidateFieldOffset32(0x4E18, EnemyData, bullet_effect_indices);
ValidateFieldOffset32(0x4E58, EnemyData, shooter_offsets);
ValidateFieldOffset32(0x4F18, EnemyData, shooter_origins);
ValidateFieldOffset32(0x4FD8, EnemyData, final_sprite_size);
ValidateFieldOffset32(0x4FE0, EnemyData, move_bounds_center);
ValidateFieldOffset32(0x4FE8, EnemyData, move_bounds_size);
ValidateFieldOffset32(0x4FF0, EnemyData, score);
ValidateFieldOffset32(0x4FF4, EnemyData, life);
ValidateFieldOffset32(0x5010, EnemyData, drops);
ValidateFieldOffset32(0x50D4, EnemyData, __int_50D4);
ValidateFieldOffset32(0x50E8, EnemyData, __dword_50E8);
ValidateFieldOffset32(0x50EC, EnemyData, hit_sound);
ValidateFieldOffset32(0x50F0, EnemyData, invulnerable_timer);
ValidateFieldOffset32(0x5104, EnemyData, no_collision_timer);
ValidateFieldOffset32(0x5118, EnemyData, __timer_5118);
ValidateFieldOffset32(0x512C, EnemyData, bomb_damage_multiplier);
ValidateFieldOffset32(0x5130, EnemyData, flags_low);
ValidateFieldOffset32(0x5134, EnemyData, flags_high);
ValidateFieldOffset32(0x5138, EnemyData, bombshield_on_anm);
ValidateFieldOffset32(0x513C, EnemyData, bombshield_off_anm);
ValidateFieldOffset32(0x5140, EnemyData, boss_id);
ValidateFieldOffset32(0x5144, EnemyData, player_protect_radius);
ValidateFieldOffset32(0x5148, EnemyData, callbacks);
ValidateFieldOffset32(0x5588, EnemyData, vm);
ValidateFieldOffset32(0x558C, EnemyData, fog);
ValidateFieldOffset32(0x55A8, EnemyData, death_callback_sub);
ValidateFieldOffset32(0x55E8, EnemyData, func_set_func);
ValidateFieldOffset32(0x55EC, EnemyData, __is_func_set_2);
ValidateFieldOffset32(0x55F0, EnemyData, extra_damage_func);
ValidateFieldOffset32(0x55F4, EnemyData, extra_hitbox_func);
ValidateFieldOffset32(0x55F8, EnemyData, chapter);
ValidateFieldOffset32(0x55FC, EnemyData, chapter_spawn_weight);
ValidateStructSize32(0x5600, EnemyData);
#pragma endregion

// 0x4B36E4
static ExtraDamageFunc* EXTRA_DAMAGE_FUNC_TABLE[] = {
    NULL,
    &EnemyData::extra_damage_func1,
    &EnemyData::extra_damage_func2,
};
// 0x4CF2D8
static ExtraHitboxFunc* EXTRA_HITBOX_FUNC_TABLE[] = {
    NULL
};

#pragma region // IMPORTED_FROM_MOF_DATA_NEEDS_VALIDATION

// size: 0x10
struct EclSub {
    ZUNMagic magic; // 0x0
    uint32_t data_offset; // 0x4
    unknown_fields(0x8); // 0x8
    EclInstruction instructions[]; // 0x10
};

// size: 0x8
struct EclSubHeader {
    char* name; // 0x0
    EclSub* data; // 0x4
};

// size: 0x24
struct EclFileHeader {
    ZUNMagic magic; // 0x0
    uint16_t version; // 0x4
    uint16_t include_length; // 0x6 include_offset + ANIM+ECLI length
    uint32_t include_offset; // 0x8
    int __dword_C; // 0xC
    uint16_t sub_count; // 0x10

    int __dword_14; // 0x14
    int __dword_18; // 0x18
    int __dword_1C; // 0x1C
    int __dword_20; // 0x20
    // 0x24
};

struct EclFile {
    EclFileHeader header; // 0x0
    unsigned char data[]; // 0x24
};
#pragma endregion

struct SptResource {
    //void* vtable; // 0x0
    int32_t file_count; // 0x4
    int32_t sub_count; // 0x8
    EclFile* files[32]; // 0xC
    EclSubHeader(*subs)[]; // 0x8C

    // 0x48D9D0
    dllexport virtual gnu_noinline ZUNResult __method_0(const char* file_buffer) asm_symbol_rel(0x48D9D0) {
        this->files[this->file_count] = (EclFile*)file_buffer;
        EclFile* ecl_file = this->files[this->file_count];
        if (
            ecl_file->header.magic.as_uint == PackUInt('S', 'C', 'P', 'T') &&
            ecl_file->header.version == 1
        ) {
            char* includes = based_pointer<char>(ecl_file, ecl_file->header.include_length);
            this->sub_count += ecl_file->header.sub_count;
            EclSubHeader(*old_sub_array)[] = this->subs;
            void* file_data = ecl_file->data;
            // TODO
        }
        else {
            this->files[this->file_count] = NULL;
            return ZUN_ERROR;
        }
    }
};

// size: 0x1098
struct EnemyController {
    void* vtable; // 0x0
    int32_t file_count; // 0x4
    int32_t sub_count; // 0x8
    EclFile* files[32]; // 0xC
    EclSubHeader(*subs)[]; // 0x8C
    EclStack __wtf_stack_maybe; // 0x90
    // 0x1098

    inline void zero_contents() {
        zero_this();
    }

    inline EnemyController() {
        this->zero_contents();
    }
};

// size: 0x122C
struct EclVM {
    //void* vtable; // 0x0
    EclContext* next_context; // 0x4
    EclContext* prev_context; // 0x8
    EclContext* current_context; // 0xC
    EclContext context; // 0x10
    EnemyController* controller; // 0x1218
    ZUNList<EclContext> context_list; // 0x121C
    // 0x122C

private:
    // 0x42CDC0
    dllexport gnu_noinline void vectorcall subtract_time_float(float, float amount) asm_symbol_rel(0x42CDC0) {
        this->current_context->time -= amount;
    }
public:
    inline void subtract_time_float(float amount) {
        return this->subtract_time_float(UNUSED_FLOAT, amount);
    }

    // 0x42CE10
    dllexport gnu_noinline EclVM() {
        this->context.set_float_interp_times(0);
    }

    // 0x42CE80
    dllexport gnu_noinline void initialize_vm() asm_symbol_rel(0x42CE80) {
        this->context.__unknown_flag_A = false;
        this->context.time = 0.0f;
        this->context.location.reset();
        this->context.async_id = -1;
        this->context.vm = this;
        this->context.__int_101C = 0;
        this->context.set_float_interp_times(0);
        this->current_context = &this->context;
        this->context.stack.pointer = 0;
        this->context.stack.base = 0;
        this->context_list.initialize_with(&this->context);
    }

    // 0x42CD70
    dllexport gnu_noinline virtual int32_t high_ecl_run() asm_symbol_rel(0x42CD70) {
        return 0;
    }

    // 0x42CD80
    dllexport gnu_noinline virtual int32_t get_int_var(int32_t index) asm_symbol_rel(0x42CD80) {
        return 0;
    }

    // 0x42CD90
    dllexport gnu_noinline virtual int32_t* get_int_ptr(int32_t index) asm_symbol_rel(0x42CD90) {
        return NULL;
    }

    // 0x42CDA0
    dllexport gnu_noinline virtual float get_float_var(int32_t index) asm_symbol_rel(0x42CDA0) {
        return 0.0f;
    }

    // 0x42CDB0
    dllexport gnu_noinline virtual float* get_float_ptr(int32_t index) asm_symbol_rel(0x42CDB0) {
        return NULL;
    }

    // 0x42CDD0
    dllexport gnu_noinline void cleanup_vm() asm_symbol_rel(0x42CDD0) {
        this->context_list.as_head().delete_each();
    }

    // 0x42CF50
    dllexport inline virtual ~EclVM() asm_symbol_rel(0x42CF50) {
        clang_forceinline this->cleanup_vm();
    }

private:
    // 0x48D420
    dllexport gnu_noinline ZUNResult vectorcall run_ecl(float, float current_gamespeed) asm_symbol_rel(0x48D420) {
        BOOL is_primary_context = true;
        if (this->context_list.do_while_safe([=, &is_primary_context](EclContext* context, ZUNList<EclContext>* node) {
            this->current_context = context;
            if (is_primary_context) {
                if (ZUN_FAILED(context->low_ecl_run(current_gamespeed))) {
                    return false;
                }
                is_primary_context = false;
            } else {
                if (ZUN_FAILED(context->low_ecl_run(current_gamespeed))) {
                    delete context;
                    node->unlink();
                    delete node;
                }
            }
            return true;
        })) {
            this->current_context = &this->context;
            return ZUN_SUCCESS;
        } else {
            return ZUN_ERROR;
        }
    }

public:
    forceinline ZUNResult run_ecl(float time) {
        return this->run_ecl(UNUSED_FLOAT, time);
    }

    // 0x48D850
    dllexport gnu_noinline ZUNResult thiscall new_async(int32_t async_id, int32_t args_index) asm_symbol_rel(0x48D850) {
        EclContext* context = new EclContext();
        ZUNList<EclContext>* list_node = new ZUNList<EclContext>();
        context->async_id = async_id;
        context->vm = this;
        context->time = 0.0f;
        context->location.reset();
        context->difficulty_mask = this->current_context->difficulty_mask;
        list_node->initialize_with(context);
        this->context_list.append(list_node);
        return this->current_context->call(context, args_index);
    }

    // 0x48D920
    dllexport gnu_noinline void thiscall locate_sub(const char* sub_name) asm_symbol_rel(0x48D920) {
        EnemyController* enemy_controller = this->controller;
        int32_t left_index = 0;
        assume(sub_name[0] != '\0');
        int32_t right_index = enemy_controller->sub_count - 1;
        if (expect(right_index >= 0, true)) {
            EclSubHeader* subs = *enemy_controller->subs;
            do {
                int32_t index = right_index - left_index;
                const char* name = sub_name;
                index /= 2;
                index += left_index;
                int32_t cmp_value = strcmp_asm(name, subs[index].name);
                if (!cmp_value) {
                    this->current_context->location.sub_index = index;
                    return;
                } else if (cmp_value < 0) {
                    right_index = index - 1;
                } else {
                    left_index = index + 1;
                }
            } while (left_index <= right_index);
        }
        this->current_context->location.sub_index = -1;
    }

    // 0x48DC20
    dllexport gnu_noinline int32_t thiscall set_context_to_sub(const char* sub_name) asm_symbol_rel(0x48DC20) {
        this->locate_sub(sub_name);
        this->current_context->location.instruction_offset = 0;
        this->current_context->time = 0.0f;
        return 0;
    }

    inline void reinitialize_vm_with_sub(const char* sub_name) {
        this->cleanup_vm();
        this->initialize_vm();
        this->set_context_to_sub(sub_name);
    }
};
#pragma region // EclVM Validation
ValidateVirtualFieldOffset32(0x4, EclVM, next_context);
ValidateVirtualFieldOffset32(0x8, EclVM, prev_context);
ValidateVirtualFieldOffset32(0xC, EclVM, current_context);
ValidateVirtualFieldOffset32(0x10, EclVM, context);
ValidateVirtualFieldOffset32(0x1218, EclVM, controller);
ValidateVirtualFieldOffset32(0x121C, EclVM, context_list);
ValidateStructSize32(0x122C, EclVM);
#pragma endregion

inline ZUNResult EnemyData::run_ecl() {
    return this->vm->run_ecl(this->ecl_time.get_scale_unsafe());
}

inline void EnemyData::reinitialize_vm_with_sub(const char* sub_name) {
    this->vm->cleanup_vm();
    this->vm->initialize_vm();
    this->vm->set_context_to_sub(sub_name);
}

inline EclInstruction* EclContext::get_instruction(int32_t sub_index, int32_t instr_offset) {
    return based_pointer((*this->vm->controller->subs)[sub_index].data->instructions, instr_offset);
}

forceinline int32_t thiscall EclContext::get_int_arg(int32_t index, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        int32_t value = IntArg(index);
        if (value >= 0) {
            return this->stack.read_local(value);
        } else if (value <= -1 && value >= -100) {
            return this->stack.read_temp(value);
        } else {
            return this->vm->get_int_var(value);
        }
    } else {
        return IntArg(index);
    }
}

// 0x48D4F0
dllexport gnu_noinline int32_t thiscall EclContext::get_int_arg(int32_t index) {
    return this->get_int_arg(index, this->get_current_instruction());
}

forceinline float vectorcall EclContext::get_float_arg(int32_t index, EclInstruction* current_instruction) {
    float value = FloatArg(index);
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0.0f) {
            return this->stack.read_local(value);
        } else if (value <= -1.0f && value >= -100.0f) {
            return this->stack.read_temp(value);
        } else {
            return this->vm->get_float_var((int32_t)value);
        }
    } else {
        return value;
    }
}

// 0x48D5A0
dllexport gnu_noinline float vectorcall EclContext::get_float_arg(int32_t, int32_t index) {
    return this->get_float_arg(index, this->get_current_instruction());
}

forceinline int32_t thiscall EclContext::get_int_arg_pop(int32_t index, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        int32_t value = IntArg(index);
        if (value >= 0) {
            return this->stack.read_local<int32_t>(value);
        } else if (value <= -1 && value >= -100) {
            return this->stack.pop_cast<int32_t>();
        } else {
            return this->vm->get_int_var(value);
        }
    } else {
        return IntArg(index);
    }
}

forceinline int32_t thiscall EclContext::get_int_arg_pop(int32_t index) {
    return this->get_int_arg_pop(index, this->get_current_instruction());
}

forceinline float vectorcall EclContext::get_float_arg_pop(int32_t index, EclInstruction* current_instruction) {
    float value = FloatArg(index);
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0.0f) {
            return this->stack.read_local<float>(value);
        } else if (value <= -1.0f && value >= -100.0f) {
            return this->stack.pop_cast<float>();
        } else {
            return this->vm->get_float_var(value);
        }
    } else {
        return value;
    }
}

forceinline float vectorcall EclContext::get_float_arg_pop(int32_t index) {
    return this->get_float_arg_pop(index, this->get_current_instruction());
}

forceinline int32_t thiscall EclContext::parse_int_as_arg_pop(int32_t index, int32_t value, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0) {
            return this->stack.read_local(value);
        } else if (value <= -1 && value >= -100) {
            return this->stack.pop_cast<int32_t>();
        } else {
            return this->vm->get_int_var(value);
        }
    } else {
        return value;
    }
}

// 0x48D690
dllexport gnu_noinline int32_t thiscall EclContext::parse_int_as_arg_pop(int32_t index, int32_t value) {
    return this->parse_int_as_arg_pop(index, value, this->get_current_instruction());
}

forceinline float vectorcall EclContext::parse_float_as_arg_pop(int32_t index, float value, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0.0f) {
            return this->stack.read_local(value);
        } else if (value <= -1.0f && value >= -100.0f) {
            return this->stack.pop_cast<float>();
        } else {
            return this->vm->get_float_var(value);
        }
    } else {
        return value;
    }
}

inline float vectorcall EclContext::parse_float_as_arg_pop(int32_t index, float value) {
    return this->parse_float_as_arg_pop(index, value, this->get_current_instruction());
}

forceinline int32_t* thiscall EclContext::get_int_ptr_arg(int32_t index, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        int32_t value = IntArg(index);
        if (value >= 0) {
            return &this->stack.ref_local(value);
        } else {
            return this->vm->get_int_ptr(value);
        }
    } else {
        return NULL;
    }
}

// 0x48D750
dllexport gnu_noinline int32_t* thiscall EclContext::get_int_ptr_arg(int32_t index) {
    return this->get_int_ptr_arg(index, this->get_current_instruction());
}

forceinline float* thiscall EclContext::get_float_ptr_arg(int32_t index, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        float value = FloatArg(index);
        if (value >= 0.0f) {
            return &this->stack.ref_local(value);
        } else {
            return this->vm->get_float_ptr((int32_t)value);
        }
    } else {
        return NULL;
    }
}

// 0x48D7C0
dllexport gnu_noinline float* thiscall EclContext::get_float_ptr_arg(int32_t index) {
    return this->get_float_ptr_arg(index, this->get_current_instruction());
}

forceinline int32_t thiscall EclContext::parse_int_as_arg(int32_t index, int32_t value, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0) {
            return this->stack.read_local(value);
        } else if (value <= -1 && value >= -100) {
            return this->stack.read_temp(value);
        } else {
            return this->vm->get_int_var(value);
        }
    } else {
        return IntArg(index);
    }
}

forceinline int32_t thiscall EclContext::parse_int_as_arg(int32_t index, int32_t value) {
    return this->parse_int_as_arg(index, value, this->get_current_instruction());
}

forceinline float EclContext::parse_float_as_arg(int32_t index, float value, EclInstruction* current_instruction) {
    if (current_instruction->param_mask & (1 << index)) {
        if (value >= 0.0f) {
            return this->stack.read_local(value);
        } else if (value <= -1.0f && value >= -100.0f) {
            return this->stack.read_temp(value);
        } else {
            return this->vm->get_float_var((int32_t)value);
        }
    } else {
        return value;
    }
}

forceinline float EclContext::parse_float_as_arg(int32_t index, float value) {
    return this->parse_float_as_arg(index, value, this->get_current_instruction());
}

// 0x438AA0
dllexport gnu_noinline int32_t thiscall EnemyData::get_int_arg(int32_t index) {
    return this->vm->current_context->get_int_arg(index);
}

// 0x438AC0
dllexport gnu_noinline int32_t* thiscall EnemyData::get_int_ptr_arg(int32_t index) {
    return this->vm->current_context->get_int_ptr_arg(index);
}

// 0x438AD0
dllexport gnu_noinline float vectorcall EnemyData::get_float_arg(int32_t, int32_t index) {
    return this->vm->current_context->get_float_arg(index);
}

// 0x438AF0
dllexport gnu_noinline float* thiscall EnemyData::get_float_ptr_arg(int32_t index) {
    return this->vm->current_context->get_float_ptr_arg(index);
}

// 0x438B10
dllexport gnu_noinline int32_t thiscall EnemyData::parse_int_as_arg(int32_t index, int32_t value) {
    return this->vm->current_context->parse_int_as_arg(index, value);
}

// 0x438BC0
dllexport gnu_noinline float vectorcall EnemyData::parse_float_as_arg(int32_t, int32_t index, float, float, float value) {
    return this->vm->current_context->parse_float_as_arg(index, value);
}

namespace Ecl {
enum Var : int32_t {
    RAND_INT = -10000,
    RAND_FLOAT = -9999,
    RAND_ANGLE = -9998,
    SELF_X = -9997,
    SELF_Y = -9996,
    SELF_X_ABS = -9995,
    SELF_Y_ABS = -9994,
    SELF_X_REL = -9993,
    SELF_Y_REL = -9992,

    SELF_X2 = -9977,
    SELF_Y2 = -9976,
    SELF_X2_ABS = -9975,
    SELF_Y2_ABS = -9974,
    SELF_X2_REL = -9973,
    SELF_Y2_REL = -9972
};
enum Opcode : uint16_t {
    // Section A
    nop = 0,
    enemy_delete = 1,
    ret = 10,
    call = 11,
    jump = 12,
    jump_equ = 13,
    jump_neq = 14,
    async_call = 15,
    async_call_id = 16,
    async_stop_id = 17,
    __async_unknown_flag_set = 18,
    __async_unknown_flag_clear = 19,
    __async_unknown_value = 20,
    async_stop_all = 21,
    __debug_unknown_A = 22,
    ecl_time_sub = 23,
    ecl_time_sub_float = 24,
    debug_print = 30,
    __debug_unknown_B = 31,
    frame_enter = 40,
    frame_leave = 41,
    push_int = 42,
    pop_int = 43,
    push_float = 44,
    pop_float = 45,
    math_int_add = 50,
    math_float_add = 51,
    math_int_sub = 52,
    math_float_sub = 53,
    math_int_mul = 54,
    math_float_mul = 55,
    math_int_div = 56,
    math_float_div = 57,
    math_int_mod = 58,
    cmp_int_equ = 59,
    cmp_float_equ = 60,
    cmp_int_neq = 61,
    cmp_float_neq = 62,
    cmp_int_les = 63,
    cmp_float_les = 64,
    cmp_int_leq = 65,
    cmp_float_leq = 66,
    cmp_int_gre = 67,
    cmp_float_gre = 68,
    cmp_int_geq = 69,
    cmp_float_geq = 70,
    cmp_int_not = 71,
    cmp_float_not = 72,
    cmp_or = 73,
    cmp_and = 74,
    math_bit_xor = 75,
    math_bit_or = 76,
    math_bit_and = 77,
    math_post_dec = 78,
    math_sin = 79,
    math_cos = 80,
    math_circle_pos = 81,
    math_reduce_angle = 82,
    math_int_neg = 83,
    math_float_neg = 84,
    math_hypot_squared = 85,
    math_hypot = 86,
    math_line_angle = 87,
    math_sqrt = 88,
    math_angle_diff = 89,
    math_point_rotate = 90,
    math_float_interp = 91,
    math_float_interp_bezier = 92,
    math_circle_pos_rand = 93,
    math_ellipse_pos = 94,
    __math_angle_95,
    __math_angle_96,
    __math_angle_97,

    // Section B
    enemy_create_rel = 300,
    enemy_create_abs,
    anm_source,
    anm_set_slot,
    enemy_create_rel_mirror,
    enemy_create_abs_mirror,
    anm_set_slot_main,
    anm_create_front,
    anm_create_zero_front,
    enemy_create_rel_stage,
    enemy_create_abs_stage,
    enemy_create_rel_stage_mirror,
    enemy_create_abs_stage_mirror,
    anm_play_attack,
    anm_create_back,
    anm_create_front_rotated,
    anm_play_attack_ex,
    anm_interrupt_slot,
    anm_play_main,
    anm_rotate_slot,
    anm_move_position_slot,
    __enemy_create_rel_2,
    __anm_set_slot_anchor_index,
    anm_death_effects,
    enemy_id_get_position,
    anm_color_slot,
    anm_color_slot_interp,
    anm_alpha_slot,
    anm_alpha_slot_interp,
    anm_scale_slot,
    anm_scale_slot_interp,
    anm_alpha2_slot,
    anm_alpha2_slot_interp,
    anm_move_position_slot_interp,
    __effect_create_special,
    anm_scale2_slot,
    __anm_layer_slot,
    anm_blend_mode_slot,
    anm_create_rel_front_rotated,
    __anm_create_zero_front_and_run,
    __enemy_id_set_flag_unknown_B,

    // Section C
    move_position_abs = 400,
    move_position_abs_interp,
    move_position_rel,
    move_position_rel_interp,
    move_velocity_abs,
    move_velocity_abs_interp,
    move_velocity_rel,
    move_velocity_rel_interp,
    move_orbit_abs,
    move_orbit_abs_interp,
    move_orbit_rel,
    move_orbit_rel_interp,
    move_rand_interp_abs,
    move_rand_interp_rel,
    move_to_boss0_abs,
    move_to_boss0_rel,
    move_position_add_abs,
    move_position_add_rel,
    move_origin_abs,
    move_origin_rel,
    move_ellipse_abs,
    move_ellipse_abs_interp,
    move_ellipse_rel,
    move_ellipse_rel_interp,
    enemy_flag_mirror,
    move_bezier_abs,
    move_bezier_rel,
    move_stop,
    move_velocity_no_mirror_abs,
    move_velocity_no_mirror_abs_interp,
    move_velocity_no_mirror_rel,
    move_velocity_no_mirror_rel_interp,
    move_to_enemy_id_abs,
    move_to_enemy_id_rel,
    move_axis_interp_abs,
    move_axis_interp_rel,
    __move_position_offset_abs_interp,
    __move_position_offset_rel_interp,
    __move_axis_offset_abs_interp,
    __move_axis_offset_rel_interp,
    move_angle_abs,
    move_angle_abs_interp,
    move_angle_rel,
    move_angle_rel_interp,
    move_speed_abs,
    move_speed_abs_interp,
    move_speed_rel,
    move_speed_rel_interp,

    // Section D
    enemy_set_hitbox = 500,
    enemy_set_collision,
    enemy_flags_set,
    enemy_flags_clear,
    move_bounds_set,
    move_bounds_disable,
    item_bonus_slots_reset,
    item_bonus_slot_set,
    item_drop_area,
    drop_item_rewards,
    item_reward_set,
    enemy_life_set,
    boss_set,
    boss_timer_clear,
    callback_ex,
    enemy_invincible_timer,
    effect_sound,
    effect_screen_shake,
    msg_read,
    msg_wait,
    boss_wait,
    timer_callback_sub,
    spellcard_start,
    spellcard_end,
    chapter_set,
    enemy_kill_all,
    player_protect_range,
    enemy_lifebar_color,
    spellcard_start_2,
    set_float_rank_3,
    set_float_rank_5,
    math_float_rank_lerp,
    set_int_rank_3,
    set_int_rank_5,
    math_int_rank_lerp,
    set_int_difficulty,
    set_float_difficulty,
    spellcard_start_difficulty,
    spellcard_start_difficulty_1,
    spellcard_start_difficulty_2,
    boss_set_life_count,
    enemy_no_collision_timer,
    spellcard_flag_timeout_set,
    __spellcard_flag_anm_unknown,
    enemy_flag_homing_disable,
    laser_clear_all,
    enemy_bomb_shield,
    game_speed_set,
    ecl_time_sub_difficulty,
    __enemy_flag_unknown_A,
    enemy_set_kill_id,
    enemy_kill_all_id,
    anm_layer_base,
    enemy_damage_sound,
    __stage_logo,
    enemy_id_exists,
    death_callback_sub,
    std_fog_interp,
    enemy_flag_mirror2,
    enemy_limit_set,
    bullet_bounce_bounds_set,
    __enemy_kill_effect_create,
    drop_item_rewards_force,
    enemy_flag_hitbox_shape,
    enemy_set_hitbox_rotation,
    enemy_bomb_shield_multiplier,
    enemy_kill,
    __spellcard_flag_unknown_A,
    __enemy_flag_armored,
    __enemy_set_chapter_spawn_weight,
    __enemy_add_spawn_weight_to_destroy,
    enemy_kill_all_no_callbacks,
    __enemy_life_set_current,
    item_timed_bonus_slot_set,
    item_timed_bonus_duration,

    // Section E
    shooter_reset = 600,
    shoot_now,
    bullet_sprite,
    shoot_offset,
    shoot_angle,
    bullet_speed,
    bullet_count,
    shoot_aim_mode,
    bullet_sound,
    bullet_effects,
    bullet_effects_ex,
    bullet_effects_add,
    bullet_effects_add_ex,
    bullet_cancel,
    shooter_copy,
    bullet_cancel_radius,
    bullet_clear_radius,
    bullet_speed_rank_3,
    bullet_speed_rank_5,
    bullet_speed_rank_lerp,
    bullet_count_rank_3,
    bullet_count_rank_5,
    bullet_count_rank_lerp,
    set_float_angle_to_player_from_point,
    bullet_speed_difficulty,
    bullet_count_difficulty,
    shoot_offset_circle,
    shoot_spawn_distance,
    __shoot_origin,
    enemy_fog_spawn,
    std_interrupt,
    __enemy_manager_flag_unknown_A,
    ex_ins_repeat,
    enemy_damage_ex,
    enemy_hitbox_ex,
    bullet_cancel_weak_radius,
    bullet_clear_weak_radius,
    ex_ins_call,
    score_add,
    __ex_ins_repeat2,
    bullet_effects_set_string,
    __bullet_effects_prev,

    // Section F
    laser_size_data = 700,
    laser_timing_data,
    laser_line_create,
    laser_infinite_create,
    laser_offset,
    laser_target,
    laser_speed,
    laser_width,
    laser_angle,
    laser_rotate,
    laser_clear,
    laser_curve_create,
    __bullet_cancel_weak_rectangle,
    laser_beam_create,
    __laser_beam_flag_unknown_A,

    // Section G
    enemy_id_change_sub = 800,
    enemy_id_get_position_crash,
    boss_callback,

    // Section H
    __debug_unknown_C = 901,
    __debug_unknown_D = 902,

    // Section I
    __globals_flag_unknown_A = 1001
};
}

using EnemyOnKillFunc = void fastcall (Enemy*);

// size: 0x683C
struct Enemy : EclVM {
    //EclVM vm; // 0x0
    EnemyData data; // 0x122C
    EnemyOnKillFunc* __on_kill_func; // 0x682C
    EnemyID id; // 0x6830
    EnemyID parent_id; // 0x6834
    int __dword_6838; // 0x6838
    // 0x683C

    // 0x42E100
    dllexport gnu_noinline Enemy(const char* sub_name);

    // 0x42D200
    dllexport gnu_noinline void __set_unknown_flag_B() asm_symbol_rel(0x42D200) {
        this->data.__unknown_flag_B = true;
    }

    // 0x42D210
    dllexport gnu_noinline EnemyData& get_data() asm_symbol_rel(0x42D210) {
        return this->data;
    }

    // 0x42D220
    dllexport gnu_noinline ~Enemy() asm_symbol_rel(0x42D220);

    // 0x42FE80
    dllexport gnu_noinline void thiscall on_tick() asm_symbol_rel(0x42FE80) {
        float enemy_slowdown = this->data.slowdown;
        if (enemy_slowdown <= 0.0f) {
            if (this->data.__anm_slowdown_immune) {
                this->data.set_anm_vm_slowdowns(0.0f);
            }
            this->data.on_tick();
        } else {
            float previous_gamespeed = GAME_SPEED.value;
            GAME_SPEED.value = confine_to_range(0.0f, previous_gamespeed - enemy_slowdown * previous_gamespeed, 1.0f);
            this->data.set_anm_vm_slowdowns(this->data.slowdown);
            this->data.on_tick();
            GAME_SPEED.value = previous_gamespeed;
            this->data.__anm_slowdown_immune = true; // Why?
        }
    }

    // 0x4389F0
    dllexport gnu_noinline void thiscall set_callback(int32_t index, int32_t life, int32_t time, const char* sub_name) asm_symbol_rel(0x4389F0) {
        EnemyCallback& callback = this->data.callbacks[index];
        callback.life = life;
        if (life >= 0) {
            callback.time = time;
            if (sub_name) {
                byteloop_strcpy(callback.life_sub, sub_name);
                byteloop_strcpy(callback.time_sub, sub_name);
            } else {
                callback.life_sub[0] = '\0';
                callback.time_sub[0] = '\0';
            }
        }
    }

    inline void set_callback_life_sub_name(int32_t index, const char* sub_name) {
        EnemyCallback& callback = this->data.callbacks[index];
        if (sub_name) {
            byteloop_strcpy(callback.life_sub, sub_name);
        } else {
            callback.life_sub[0] = '\0';
        }
    }

    // 0x438A60
    dllexport gnu_noinline void thiscall set_callback_time_sub_name(int32_t index, const char* sub_name) asm_symbol_rel(0x438A60) {
        EnemyCallback& callback = this->data.callbacks[index];
        if (sub_name) {
            byteloop_strcpy(callback.time_sub, sub_name);
        } else {
            callback.time_sub[0] = '\0';
        }
    }

    inline const char* check_timer_callbacks();

    inline const char* check_life_callbacks();

    // 0x409980
    dllexport gnu_noinline MotionData* thiscall get_current_motion() {
        return &this->data.current_motion;
    }

    // 0x430D30
    dllexport gnu_noinline virtual int32_t high_ecl_run() asm_symbol_rel(0x430D30) {
        return this->data.high_ecl_run();
    }

    // 0x437360
    dllexport gnu_noinline virtual int32_t get_int_var(int32_t index) asm_symbol_rel(0x437360) {
        switch (index) {

            default:
                return 0;
        }
    }

    // 0x437B20
    dllexport gnu_noinline virtual int32_t* get_int_ptr(int32_t index) asm_symbol_rel(0x437B20) {
        switch (index) {

            default:
                return NULL;
        }
    }

    // 0x437C90
    dllexport gnu_noinline virtual float get_float_var(int32_t index) asm_symbol_rel(0x437C90) {
        switch (index) {

            default:
                return 0.0f;
        }
    }

    // 0x4387E0
    dllexport gnu_noinline virtual float* get_float_ptr(int32_t index) asm_symbol_rel(0x4387E0) {
        switch (index) {

            default:
                return NULL;
        }
    }

    // 0x430240
    dllexport gnu_noinline int thiscall kill() asm_symbol_rel(0x430240);

protected:
    template <bool no_callbacks = false>
    forceinline void try_kill_success() {
        this->data.drops.reset();
        this->data.position_of_last_damage_source_to_hit.x = 0.0f;
        this->data.position_of_last_damage_source_to_hit.y = 192.0f;
        this->data.chapter_spawn_weight = 0;
        if constexpr (no_callbacks) {
            this->data.death_callback_sub[0] = '\0';
        }
        this->kill();
        nounroll for (size_t i = 0; i < 16; ++i) {
            this->data.anm_vms[i].mark_tree_for_delete();
        }
        this->data.__unknown_flag_B = true;
    }

public:
    template <bool no_callbacks = false>
    forceinline void try_kill() {
        if (this->data.flags_allow_kill()) {
            this->try_kill_success<no_callbacks>();
        }
    }

    template <bool no_callbacks = false>
    forceinline void try_kill_by_kill_id(int32_t kill_id) {
        if (
            this->data.flags_allow_kill() &&
            this->data.kill_id == kill_id
        ) {
            this->try_kill_success<no_callbacks>();
        }
    }
};
#pragma region // Enemy Validation
//ValidateFieldOffset32(0x0, Enemy, vm);
ValidateFieldOffset32(0x122C, Enemy, data);
ValidateFieldOffset32(0x682C, Enemy, __on_kill_func);
ValidateFieldOffset32(0x6830, Enemy, id);
ValidateFieldOffset32(0x6834, Enemy, parent_id);
ValidateFieldOffset32(0x6838, Enemy, __dword_6838);
ValidateStructSize32(0x683C, Enemy);
#pragma endregion

// size: 0xC
struct RGB {
    int32_t r; // 0x0
    int32_t g; // 0x4
    int32_t b; // 0x8
    // 0xC
};

typedef struct Gui Gui;
extern "C" {
    // 0x4CF2E0
    extern Gui* GUI_PTR asm("_GUI_PTR");
    // 0x570918
    extern void* CACHED_MSG_FILE_PTR asm("_CACHED_MSG_FILE_PTR");
}

static inline constexpr int32_t MENU_STACK_DEPTH = 16;

// size: 0xD8
struct MenuSelect {
    int32_t current_selection; // 0x0
    int32_t previous_selection; // 0x4
    int32_t menu_length; // 0x8
    int32_t selection_stack[MENU_STACK_DEPTH]; // 0xC
    int32_t menu_length_stack[MENU_STACK_DEPTH]; // 0x4C
    int32_t stack_index; // 0x8C
    int32_t disabled_selections[MENU_STACK_DEPTH]; // 0x90
    BOOL enable_wrap; // 0xD0
    int32_t disabled_selections_count; // 0xD4
    // 0xD8

    // 0x402940
    dllexport gnu_noinline void thiscall push_state() asm_symbol_rel(0x402940) {
        this->selection_stack[this->stack_index] = this->current_selection;
        this->menu_length_stack[this->stack_index] = this->menu_length;
        ++this->stack_index;
        if (this->stack_index >= MENU_STACK_DEPTH) {
            this->stack_index = MENU_STACK_DEPTH - 1;
        }
        this->disabled_selections_count = 0;
    }

    // 0x402990
    dllexport gnu_noinline void thiscall pop_state() asm_symbol_rel(0x402990) {
        if (--this->stack_index < 0) {
            this->stack_index = 0;
            this->current_selection = 0;
            this->menu_length = 0;
            this->disabled_selections_count = 0;
        }
        else {
            this->current_selection = this->selection_stack[this->stack_index];
            this->menu_length = this->menu_length_stack[this->stack_index];
            this->disabled_selections_count = 0;
        }
    }

    // 0x4029E0
    dllexport gnu_noinline int32_t thiscall __move_selection(int32_t offset) asm_symbol_rel(0x4029E0) {
        int32_t selection = this->current_selection;
        int32_t menu_length = this->menu_length;

        if (menu_length > 0) {
            int32_t disabled_count = this->disabled_selections_count;

        retry_selection:
            selection += offset;
            this->current_selection = selection;
            if (selection >= menu_length) {
                BOOL wrap = this->enable_wrap;
                do {
                    if (wrap) {
                        selection -= menu_length;
                    } else {
                        --selection;
                    }
                    this->current_selection = selection;
                } while (selection >= menu_length);
            }
            if (selection < 0) {
                BOOL wrap = this->enable_wrap;
                do {
                    if (wrap) {
                        selection += menu_length;
                    } else {
                        selection = 0;
                    }
                    this->current_selection = selection;
                } while (selection < 0);
            }

            for (int32_t i = 0; i < disabled_count; ++i) {
                if (this->current_selection == this->disabled_selections[i]) {
                    goto retry_selection;
                }
            }
        }

        return selection;
    }
};
#pragma region // MenuSelect Verification
ValidateFieldOffset32(0x0, MenuSelect, current_selection);
ValidateFieldOffset32(0x4, MenuSelect, previous_selection);
ValidateFieldOffset32(0x8, MenuSelect, menu_length);
ValidateFieldOffset32(0xC, MenuSelect, selection_stack);
ValidateFieldOffset32(0x4C, MenuSelect, menu_length_stack);
ValidateFieldOffset32(0x8C, MenuSelect, stack_index);
ValidateFieldOffset32(0x90, MenuSelect, disabled_selections);
ValidateFieldOffset32(0xD0, MenuSelect, enable_wrap);
ValidateFieldOffset32(0xD4, MenuSelect, disabled_selections_count);
ValidateStructSize32(0xD8, MenuSelect);
#pragma endregion

// size: 0x4
struct MsgInstruction {
    uint16_t time; // 0x0
    uint8_t opcode; // 0x2
    uint8_t args_size; // 0x3
    unsigned char args[]; // 0x4
};

namespace Msg {
enum Opcode : uint8_t {
    msg_delete = 0,
    initialize_player = 1,
    initialize_boss = 2,
    initialize_textbox = 3,
    delete_player = 4,
    delete_boss = 5,
    delete_textbox = 6,
    focus_player = 7,
    focus_boss = 8,
    focus_none = 9,
    msg_flag_wait_skippable = 10,
    wait = 11,
    ecl_resume = 12,
    portrait_player = 13,
    portrait_boss = 14,
    text_top_line = 15,
    text_bottom_line = 16,
    text_dialogue = 17,
    text_clear = 18,
    music_boss = 19,
    text_intro = 20,
    stage_end = 21,
    music_fade_out = 22,
    player_shake = 23,
    boss_shake = 24,
    text_offset = 25,
    __unknown_flag_set_A = 26,
    music_fade_out_time = 27,
    text_position = 28,
    text_type = 29,
    
};
}

// 0x570DA0
static char MSG_DECRYPT_BUFFER[0x100];

// 0x4419F0
dllexport gnu_noinline const char* fastcall __decrypt_related(const char* str) {
    uint8_t xor_mask = 0x77;
    uint8_t xor_accel = 7;

    char* buffer_write = MSG_DECRYPT_BUFFER;
    uint8_t c;
    do {
        c = *str++;
        c ^= xor_mask;
        xor_mask += xor_accel;
        xor_accel += 16;
        *buffer_write++ = c;
    } while (c);

    char* buffer_read = MSG_DECRYPT_BUFFER;

    while ((c = *buffer_read)) {
        if (
            (c <= 0x80 || 0xA0 <= c) &&
            (c + ' ' > 0x1C)
        ) {
            if (c == '_') {
                *buffer_read = ' ';
            }
        } else {
            ++buffer_read;
        }
        ++buffer_read;
    }

    return MSG_DECRYPT_BUFFER;
}

// 0x4B6620
static int32_t PLAYER_PORTRAIT_SCRIPT_TABLE[] = {
    40, 46, 29, 28
};

// size: 0x1D8
struct MsgVM {
    unknown_fields(0x4); // 0x0
    Timer __timer_4; // 0x4
    Timer script_time; // 0x18
    Timer pause_timer; // 0x2C
    AnmID player_portraits[2]; // 0x40
    AnmID enemy_portraits[4]; // 0x48
    AnmID __vm_id_58; // 0x58
    int __dword_5C; // 0x5C
    unknown_fields(0x4); // 0x60
    AnmID dialogue_lines[2]; // 0x64
    AnmID furigana_lines[2]; // 0x6C
    AnmID intro; // 0x74
    AnmID __textbox_related; // 0x78
    AnmID __vm_id_7C; // 0x7C
    int32_t menu_time; // 0x80
    int32_t menu_state; // 0x84
    MenuSelect menu_controller; // 0x88
    int __dword_160; // 0x160
    MsgInstruction* current_instr; // 0x164
    Float3 __float3_168; // 0x168
    Float3 __float3_174; // 0x174
    Float3 __float3_180; // 0x180
    Float3 __float3_18C; // 0x18C
    int32_t __enemy_appear_counter; // 0x198
    union {
        uint32_t flags; // 0x19C
        struct {
            uint32_t __unknown_flag_B : 1; // 1
            uint32_t __unknown_flag_C : 1; // 1
            uint32_t : 4; // 3-6
            uint32_t __unknown_flag_A : 1; // 7
        };
    };
    int32_t next_text_line; // 0x1A0
    int __dword_1A4; // 0x1A4
    int32_t __int_1A8; // 0x1A8
    int32_t active_portait; // 0x1AC
    D3DCOLOR __color_array_1B0[1]; // 0x1B0
    int __dword_1B4; // 0x1B4
    int __dword_1B8; // 0x1B8
    int __dword_1BC; // 0x1BC
    Float3 callout_position; // 0x1C0
    float __float_1CC; // 0x1CC
    unknown_fields(0x4); // 0x1D0
    int32_t __int_1D4; // 0x1D4
    // 0x1D8
    
private:
    // 0x4416D0
    dllexport gnu_noinline void vectorcall __sub_4416D0(int, float, float arg1, float arg2, float arg3, int arg4) asm_symbol_rel(0x4416D0) {
        this->__textbox_related.mark_tree_for_delete();
        // TODO
    }
public:
    inline void __sub_4416D0(float arg1, float arg2, float arg3, int arg4) {
        return this->__sub_4416D0(UNUSED_DWORD, UNUSED_FLOAT, arg1, arg2, arg3, arg4);
    }

    // 0x43E550
    dllexport gnu_noinline int thiscall run_msg() {
        using namespace Msg;

        if (this->__enemy_appear_counter > 0) {
            --this->__enemy_appear_counter;
        }
        if (this->__int_1A8 > 0) {
            --this->__int_1A8;
        } else {
            if (INPUT_STATES[0].check_inputs_no_repeat(BUTTON_SHOOT | BUTTON_SKIP)) {
                this->__unknown_flag_A = true;
            }
        }
        if (
            (this->__unknown_flag_A & this->__unknown_flag_B) &&
            (
                (INPUT_STATES[0].check_inputs(BUTTON_SKIP) && INPUT_STATES[0].inputs_held[BUTTON_SKIP_INDEX] >= 20) ||
                (INPUT_STATES[0].check_inputs(BUTTON_SHOOT) && INPUT_STATES[0].inputs_held[BUTTON_SHOOT_INDEX] >= 20)
            )
        ) {
            this->script_time.set(this->current_instr->time);
        }

        for (
            MsgInstruction* current_instruction = this->current_instr;
            this->script_time >= current_instruction->time;
            this->current_instr = IndexInstr(sizeof(MsgInstruction) + this->current_instr->args_size)
        ) {
            switch (current_instruction->opcode) {
                case __unknown_flag_set_A: // 36
                    this->__unknown_flag_C = true;
                    break;
                case text_top_line: { // 15
                    AnmVM* vm = this->dialogue_lines[0].get_vm_ptr();
                    const char* text = __decrypt_related(StringArg(0));
                    // ANM_MANAGER_PTR->draw_text_left(vm, this->__color_array_1B0[this->active_portait], 0, this->__unknown_flag_C + 4, 0, 0, text);
                    break;
                }
                case text_bottom_line: { // 16
                    AnmVM* vm = this->dialogue_lines[1].get_vm_ptr();
                    const char* text = __decrypt_related(StringArg(0));
                    // ANM_MANAGER_PTR->draw_text_left(vm, this->__color_array_1B0[this->active_portait], 0, this->__unknown_flag_C + 4, 0, 0, text);
                    break;
                }
                case text_position: // 28
                    this->callout_position.x = FloatArg(0) * 2;
                    this->callout_position.y = FloatArg(1) * 2;
                    break;
                case text_dialogue: { // 17
                    // TODO: A disgusting pile of inlined ANM code
                    break;
                }
                case text_clear: // 18
                    this->__textbox_related.mark_tree_for_delete();
                    this->dialogue_lines[0].interrupt_tree(3);
                    this->dialogue_lines[1].interrupt_tree(3);
                    this->furigana_lines[0].interrupt_tree(3);
                    this->furigana_lines[1].interrupt_tree(3);
                    break;
                case initialize_player: { // 1
                    int32_t who = IntArg(0);
                    if (who == 0) {

                    }
                    else {

                    }
                }
            }
        }
        this->script_time++;
        if (AnmVM* vm = this->__textbox_related.__wtf_child_list_jank_A(this->__int_1D4 + 170, 0)) {
            // TODO
        }
        return 0;
    }
};
#pragma region // MsgVM Validation
ValidateFieldOffset32(0x4, MsgVM, __timer_4);
ValidateFieldOffset32(0x18, MsgVM, script_time);
ValidateFieldOffset32(0x2C, MsgVM, pause_timer);
ValidateFieldOffset32(0x40, MsgVM, player_portraits);
ValidateFieldOffset32(0x48, MsgVM, enemy_portraits);
ValidateFieldOffset32(0x58, MsgVM, __vm_id_58);
ValidateFieldOffset32(0x5C, MsgVM, __dword_5C);
ValidateFieldOffset32(0x64, MsgVM, dialogue_lines);
ValidateFieldOffset32(0x6C, MsgVM, furigana_lines);
ValidateFieldOffset32(0x74, MsgVM, intro);
ValidateFieldOffset32(0x78, MsgVM, __textbox_related);
ValidateFieldOffset32(0x7C, MsgVM, __vm_id_7C);
ValidateFieldOffset32(0x80, MsgVM, menu_time);
ValidateFieldOffset32(0x84, MsgVM, menu_state);
ValidateFieldOffset32(0x88, MsgVM, menu_controller);
ValidateFieldOffset32(0x160, MsgVM, __dword_160);
ValidateFieldOffset32(0x164, MsgVM, current_instr);
ValidateFieldOffset32(0x168, MsgVM, __float3_168);
ValidateFieldOffset32(0x174, MsgVM, __float3_174);
ValidateFieldOffset32(0x180, MsgVM, __float3_180);
ValidateFieldOffset32(0x18C, MsgVM, __float3_18C);
ValidateFieldOffset32(0x198, MsgVM, __enemy_appear_counter);
ValidateFieldOffset32(0x19C, MsgVM, flags);
ValidateFieldOffset32(0x1A0, MsgVM, next_text_line);
ValidateFieldOffset32(0x1A4, MsgVM, __dword_1A4);
ValidateFieldOffset32(0x1A8, MsgVM, __int_1A8);
ValidateFieldOffset32(0x1AC, MsgVM, active_portait);
ValidateFieldOffset32(0x1B0, MsgVM, __color_array_1B0);
ValidateFieldOffset32(0x1B4, MsgVM, __dword_1B4);
ValidateFieldOffset32(0x1B8, MsgVM, __dword_1B8);
ValidateFieldOffset32(0x1BC, MsgVM, __dword_1BC);
ValidateFieldOffset32(0x1C0, MsgVM, callout_position);
ValidateFieldOffset32(0x1CC, MsgVM, __float_1CC);
ValidateFieldOffset32(0x1D4, MsgVM, __int_1D4);
ValidateStructSize32(0x1D8, MsgVM);
#pragma endregion

#pragma region IMPORTED_FROM_VD_DATA_NEEDS_VALIDATION
// size: 0x8
struct LifebarMarker {
    float bar_position; // 0x0
    D3DCOLOR section_color; // 0x4
    // 0x8
};
// size: 0x54
struct Lifebar {
    float bar_value; // 0x0
    float life_percentage; // 0x4
    int32_t current_life; // 0x8
    unknown_fields(0x4); // 0xC
    LifebarMarker markers[4]; // 0x10
    AnmID main_vm; // 0x30
    AnmID glowA_vm; // 0x34
    AnmID glowB_vm; // 0x38
    AnmID marker_vms[4]; // 0x3C
    int32_t vms_initialized; // 0x4C
    int __dword_50; // 0x50
    // 0x54
};
#pragma endregion

// size: 0x2CC
struct Gui : ZUNTask {
    // ZUNTask base; // 0x0
    unknown_fields(0x5C); // 0xC
    AnmVM* __anm_vm_ptr_array_68[7]; // 0x68
    AnmVM* __anm_vm_84; // 0x84
    AnmVM* __anm_vm_88; // 0x88
    AnmID __anm_id_8C; // 0x8C
    unknown_fields(0x28); // 0x90
    AnmID __anm_id_B8; // 0xB8
    AnmID __anm_id_BC; // 0xBC
    unknown_fields(0x50); // 0xC0
    AnmID __anm_id_110; // 0x110
    unknown_fields(0x20); // 0x104
    int __int_134; // 0x134
    unknown_fields(0x4); // 0x138
    int32_t __int_13C; // 0x13C
    Timer __timer_140; // 0x140
    unknown_fields(0x4); // 0x154
    int32_t __score; // 0x158
    int32_t __int_15C; // 0x15C
    AnmLoaded* stage_logo_anm; // 0x160
    unknown_fields(0xC); // 0x164
    int __dword_170; // 0x170
    unknown_fields(0x20); // 0x174
    union {
        uint32_t flags; // 0x194
        struct {
            uint32_t : 8; // 1-8
            uint32_t __unknown_flag_A : 1; // 9
        };
    };
    Timer __timer_198; // 0x198
    unknown_fields(0x4); // 0x1AC
    MsgVM* msg_vm; // 0x1B0
    void* msg_file; // 0x1B4
    int32_t spell_timer_seconds; // 0x1B8
    int32_t spell_timer_hundredths; // 0x1BC
    int32_t __int_1C0; // 0x1C0
    Lifebar lifebars[3]; // 0x1C4
    AnmLoaded* __anm_loaded_2C0; // 0x2C0
    unknown_fields(0x8); // 0x2C4
    // 0x2CC

    inline void update_spell_timer(int32_t time) {
        // I'm only ~80% sure I got this math right
        int32_t seconds = time / 60;
        int32_t frames = time % 60;

        int32_t hundredths = frames * 100;
        hundredths += (hundredths / 60);

        this->spell_timer_seconds = seconds > 99 ? seconds : 99;
